#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第七巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第七巻）</h1>

 <h2>雜歌 / 詠天</h2>
<p><a href="1068.html">天の海に雲の波立ち月の舟星の林に漕ぎ隠る見ゆ</a></p>
<h2>詠月</h2>
<p><a href="1069.html">常はさね思はぬものをこの月の過ぎ隠らまく惜しき宵かも</a></p>
<h2>（詠月）</h2>
<p><a href="1070.html">大夫の弓末振り起し狩高の野辺さへ清く照る月夜かも</a></p>
<h2>（詠月）</h2>
<p><a href="1071.html">山の端にいさよふ月を出でむかと待ちつつ居るに夜ぞ更けにける</a></p>
<h2>（詠月）</h2>
<p><a href="1072.html">明日の宵照らむ月夜は片寄りに今夜に寄りて夜長くあらなむ</a></p>
<h2>（詠月）</h2>
<p><a href="1073.html">玉垂の小簾の間通しひとり居て見る験なき夕月夜かも</a></p>
<h2>（詠月）</h2>
<p><a href="1074.html">春日山おして照らせるこの月は妹が庭にもさやけくありけり</a></p>
<h2>（詠月）</h2>
<p><a href="1075.html">海原の道遠みかも月読の光少き夜は更けにつつ</a></p>
<h2>（詠月）</h2>
<p><a href="1076.html">ももしきの大宮人の罷り出て遊ぶ今夜の月のさやけさ</a></p>
<h2>（詠月）</h2>
<p><a href="1077.html">ぬばたまの夜渡る月を留めむに西の山辺に関もあらぬかも</a></p>
<h2>（詠月）</h2>
<p><a href="1078.html">この月のここに来たれば今とかも妹が出で立ち待ちつつあるらむ</a></p>
<h2>（詠月）</h2>
<p><a href="1079.html">まそ鏡照るべき月を白栲の雲か隠せる天つ霧かも</a></p>
<h2>（詠月）</h2>
<p><a href="1080.html">ひさかたの天照る月は神代にか出で反るらむ年は経につつ</a></p>
<h2>（詠月）</h2>
<p><a href="1081.html">ぬばたまの夜渡る月をおもしろみ我が居る袖に露ぞ置きにける</a></p>
<h2>（詠月）</h2>
<p><a href="1082.html">水底の玉さへさやに見つべくも照る月夜かも夜の更けゆけば</a></p>
<h2>（詠月）</h2>
<p><a href="1083.html">霜曇りすとにかあるらむ久方の夜渡る月の見えなく思へば</a></p>
<h2>（詠月）</h2>
<p><a href="1084.html">山の端にいさよふ月をいつとかも我は待ち居らむ夜は更けにつつ</a></p>
<h2>（詠月）</h2>
<p><a href="1085.html">妹があたり我が袖振らむ木の間より出で来る月に雲なたなびき</a></p>
<h2>（詠月）</h2>
<p><a href="1086.html">靫懸くる伴の男広き大伴に国栄えむと月は照るらし</a></p>
<h2>詠雲</h2>
<p><a href="1087.html">穴師川川波立ちぬ巻向の弓月が岳に雲居立てるらし</a></p>
<h2>（詠雲）</h2>
<p><a href="1088.html">あしひきの山川の瀬の鳴るなへに弓月が岳に雲立ちわたる</a></p>
<h2>（詠雲）</h2>
<p><a href="1089.html">大海に島もあらなくに海原のたゆたふ波に立てる白雲</a></p>
<h2>詠雨</h2>
<p><a href="1090.html">我妹子が赤裳の裾のひづちなむ今日の小雨に我れさへ濡れな</a></p>
<h2>（詠雨）</h2>
<p><a href="1091.html">通るべく雨はな降りそ我妹子が形見の衣我れ下に着り</a></p>
<h2>詠山</h2>
<p><a href="1092.html">鳴る神の音のみ聞きし巻向の桧原の山を今日見つるかも</a></p>
<h2>（詠山）</h2>
<p><a href="1093.html">三諸のその山なみに子らが手を巻向山は継ぎしよろしも</a></p>
<h2>（詠山）</h2>
<p><a href="1094.html">我が衣色取り染めむ味酒三室の山は黄葉しにけり</a></p>
<h2>（詠山）</h2>
<p><a href="1095.html">三諸つく三輪山見れば隠口の泊瀬の桧原思ほゆるかも</a></p>
<h2>（詠山）</h2>
<p><a href="1096.html">いにしへのことは知らぬを我れ見ても久しくなりぬ天の香具山</a></p>
<h2>（詠山）</h2>
<p><a href="1097.html">我が背子をこち巨勢山と人は言へど君も来まさず山の名にあらし</a></p>
<h2>（詠山）</h2>
<p><a href="1098.html">紀道にこそ妹山ありといへ玉櫛笥二上山も妹こそありけれ</a></p>
<h2>詠岳</h2>
<p><a href="1099.html">片岡のこの向つ峰に椎蒔かば今年の夏の蔭にならむか</a></p>
<h2>詠河</h2>
<p><a href="1100.html">巻向の穴師の川ゆ行く水の絶ゆることなくまたかへり見む</a></p>
<h2>（詠河）</h2>
<p><a href="1101.html">ぬばたまの夜さり来れば巻向の川音高しもあらしかも疾き</a></p>
<h2>（詠河）</h2>
<p><a href="1102.html">大君の御笠の山の帯にせる細谷川の音のさやけさ</a></p>
<h2>（詠河）</h2>
<p><a href="1103.html">今しくは見めやと思ひしみ吉野の大川淀を今日見つるかも</a></p>
<h2>（詠河）</h2>
<p><a href="1104.html">馬並めてみ吉野川を見まく欲りうち越え来てぞ瀧に遊びつる</a></p>
<h2>（詠河）</h2>
<p><a href="1105.html">音に聞き目にはいまだ見ぬ吉野川六田の淀を今日見つるかも</a></p>
<h2>（詠河）</h2>
<p><a href="1106.html">かはづ鳴く清き川原を今日見てはいつか越え来て見つつ偲はむ</a></p>
<h2>（詠河）</h2>
<p><a href="1107.html">泊瀬川白木綿花に落ちたぎつ瀬をさやけみと見に来し我れを</a></p>
<h2>（詠河）</h2>
<p><a href="1108.html">泊瀬川流るる水脈の瀬を早みゐで越す波の音の清けく</a></p>
<h2>（詠河）</h2>
<p><a href="1109.html">さ桧の隈桧隈川の瀬を早み君が手取らば言寄せむかも</a></p>
<h2>（詠河）</h2>
<p><a href="1110.html">ゆ種蒔くあらきの小田を求めむと足結ひ出で濡れぬこの川の瀬に</a></p>
<h2>（詠河）</h2>
<p><a href="1111.html">いにしへもかく聞きつつか偲ひけむこの布留川の清き瀬の音を</a></p>
<h2>（詠河）</h2>
<p><a href="1112.html">はねかづら今する妹をうら若みいざ率川の音のさやけさ</a></p>
<h2>（詠河）</h2>
<p><a href="1113.html">この小川霧ぞ結べるたぎちゆく走井の上に言挙げせねども</a></p>
<h2>（詠河）</h2>
<p><a href="1114.html">我が紐を妹が手もちて結八川またかへり見む万代までに</a></p>
<h2>（詠河）</h2>
<p><a href="1115.html">妹が紐結八河内をいにしへのみな人見きとここを誰れ知る</a></p>
<h2>詠露</h2>
<p><a href="1116.html">ぬばたまの我が黒髪に降りなづむ天の露霜取れば消につつ</a></p>
<h2>詠花</h2>
<p><a href="1117.html">島廻すと磯に見し花風吹きて波は寄すとも採らずはやまじ</a></p>
<h2>詠葉</h2>
<p><a href="1118.html">いにしへにありけむ人も我がごとか三輪の桧原にかざし折りけむ</a></p>
<h2>（詠葉）</h2>
<p><a href="1119.html">行く川の過ぎにし人の手折らねばうらぶれ立てり三輪の桧原は</a></p>
<h2>詠蘿</h2>
<p><a href="1120.html">み吉野の青根が岳の蘿むしろ誰れか織りけむ経緯なしに</a></p>
<h2>詠草</h2>
<p><a href="1121.html">妹らがり我が通ひ道の小竹すすき我れし通はば靡け小竹原</a></p>
<h2>詠鳥</h2>
<p><a href="1122.html">山の際に渡るあきさの行きて居むその川の瀬に波立つなゆめ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1123.html">佐保川の清き川原に鳴く千鳥かはづと二つ忘れかねつも</a></p>
<h2>（詠鳥）</h2>
<p><a href="1124.html">佐保川に騒ける千鳥さ夜更けて汝が声聞けば寐ねかてなくに</a></p>
<h2>思故郷</h2>
<p><a href="1125.html">清き瀬に千鳥妻呼び山の際に霞立つらむ神なびの里</a></p>
<h2>（思故郷）</h2>
<p><a href="1126.html">年月もいまだ経なくに明日香川瀬々ゆ渡しし石橋もなし</a></p>
<h2>詠井</h2>
<p><a href="1127.html">落ちたぎつ走井水の清くあれば置きては我れは行きかてぬかも</a></p>
<h2>（詠井）</h2>
<p><a href="1128.html">馬酔木なす栄えし君が掘りし井の石井の水は飲めど飽かぬかも</a></p>
<h2>詠&lt;倭&gt;琴</h2>
<p><a href="1129.html">琴取れば嘆き先立つけだしくも琴の下樋に妻や隠れる</a></p>
<h2>芳野作</h2>
<p><a href="1130.html">神さぶる岩根こごしきみ吉野の水分山を見れば悲しも</a></p>
<h2>（芳野作）</h2>
<p><a href="1131.html">皆人の恋ふるみ吉野今日見ればうべも恋ひけり山川清み</a></p>
<h2>（芳野作）</h2>
<p><a href="1132.html">夢のわだ言にしありけりうつつにも見て来るものを思ひし思へば</a></p>
<h2>（芳野作）</h2>
<p><a href="1133.html">すめろきの神の宮人ところづらいやとこしくに我れかへり見む</a></p>
<h2>（芳野作）</h2>
<p><a href="1134.html">吉野川巌と栢と常磐なす我れは通はむ万代までに</a></p>
<h2>山背作</h2>
<p><a href="1135.html">宇治川は淀瀬なからし網代人舟呼ばふ声をちこち聞こゆ</a></p>
<h2>（山背作）</h2>
<p><a href="1136.html">宇治川に生ふる菅藻を川早み採らず来にけりつとにせましを</a></p>
<h2>（山背作）</h2>
<p><a href="1137.html">宇治人の譬への網代我れならば今は寄らまし木屑来ずとも</a></p>
<h2>（山背作）</h2>
<p><a href="1138.html">宇治川を舟渡せをと呼ばへども聞こえざるらし楫の音もせず</a></p>
<h2>（山背作）</h2>
<p><a href="1139.html">ちはや人宇治川波を清みかも旅行く人の立ちかてにする</a></p>
<h2>攝津作</h2>
<p><a href="1140.html">しなが鳥猪名野を来れば有馬山夕霧立ちぬ宿りはなくて [一本云 猪名の浦みを漕ぎ来れば]</a></p>
<h2>（攝津作）</h2>
<p><a href="1141.html">武庫川の水脈を早みと赤駒の足掻くたぎちに濡れにけるかも</a></p>
<h2>（攝津作）</h2>
<p><a href="1142.html">命をし幸くよけむと石走る垂水の水をむすびて飲みつ</a></p>
<h2>（攝津作）</h2>
<p><a href="1143.html">さ夜更けて堀江漕ぐなる松浦舟楫の音高し水脈早みかも</a></p>
<h2>（攝津作）</h2>
<p><a href="1144.html">悔しくも満ちぬる潮か住吉の岸の浦廻ゆ行かましものを</a></p>
<h2>（攝津作）</h2>
<p><a href="1145.html">妹がため貝を拾ふと茅渟の海に濡れにし袖は干せど乾かず</a></p>
<h2>（攝津作）</h2>
<p><a href="1146.html">めづらしき人を我家に住吉の岸の埴生を見むよしもがも</a></p>
<h2>（攝津作）</h2>
<p><a href="1147.html">暇あらば拾ひに行かむ住吉の岸に寄るといふ恋忘れ貝</a></p>
<h2>（攝津作）</h2>
<p><a href="1148.html">馬並めて今日我が見つる住吉の岸の埴生を万代に見む</a></p>
<h2>（攝津作）</h2>
<p><a href="1149.html">住吉に行くといふ道に昨日見し恋忘れ貝言にしありけり</a></p>
<h2>（攝津作）</h2>
<p><a href="1150.html">住吉の岸に家もが沖に辺に寄する白波見つつ偲はむ</a></p>
<h2>（攝津作）</h2>
<p><a href="1151.html">大伴の御津の浜辺をうちさらし寄せ来る波のゆくへ知らずも</a></p>
<h2>（攝津作）</h2>
<p><a href="1152.html">楫の音ぞほのかにすなる海人娘子沖つ藻刈りに舟出すらしも [一云 夕されば楫の音すなり]</a></p>
<h2>（攝津作）</h2>
<p><a href="1153.html">住吉の名児の浜辺に馬立てて玉拾ひしく常忘らえず</a></p>
<h2>（攝津作）</h2>
<p><a href="1154.html">雨は降る仮廬は作るいつの間に吾児の潮干に玉は拾はむ</a></p>
<h2>（攝津作）</h2>
<p><a href="1155.html">名児の海の朝明のなごり今日もかも磯の浦廻に乱れてあるらむ</a></p>
<h2>（攝津作）</h2>
<p><a href="1156.html">住吉の遠里小野の真榛もち摺れる衣の盛り過ぎゆく</a></p>
<h2>（攝津作）</h2>
<p><a href="1157.html">時つ風吹かまく知らず吾児の海の朝明の潮に玉藻刈りてな</a></p>
<h2>（攝津作）</h2>
<p><a href="1158.html">住吉の沖つ白波風吹けば来寄する浜を見れば清しも</a></p>
<h2>（攝津作）</h2>
<p><a href="1159.html">住吉の岸の松が根うちさらし寄せ来る波の音のさやけさ</a></p>
<h2>（攝津作）</h2>
<p><a href="1160.html">難波潟潮干に立ちて見わたせば淡路の島に鶴渡る見ゆ</a></p>
<h2>覊旅作</h2>
<p><a href="1161.html">家離り旅にしあれば秋風の寒き夕に雁鳴き渡る</a></p>
<h2>（覊旅作）</h2>
<p><a href="1162.html">円方の港の洲鳥波立てや妻呼びたてて辺に近づくも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1163.html">年魚市潟潮干にけらし知多の浦に朝漕ぐ舟も沖に寄る見ゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1164.html">潮干ればともに潟に出で鳴く鶴の声遠ざかる磯廻すらしも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1165.html">夕なぎにあさりする鶴潮満てば沖波高み己妻呼ばふ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1166.html">いにしへにありけむ人の求めつつ衣に摺りけむ真野の榛原</a></p>
<h2>（覊旅作）</h2>
<p><a href="1167.html">あさりすと礒に我が見しなのりそをいづれの島の海人か刈りけむ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1168.html">今日もかも沖つ玉藻は白波の八重をるが上に乱れてあるらむ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1169.html">近江の海港は八十ちいづくにか君が舟泊て草結びけむ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1170.html">楽浪の連庫山に雲居れば雨ぞ降るちふ帰り来我が背</a></p>
<h2>（覊旅作）</h2>
<p><a href="1171.html">大御船泊ててさもらふ高島の三尾の勝野の渚し思ほゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1172.html">いづくにか舟乗りしけむ高島の香取の浦ゆ漕ぎ出来る舟</a></p>
<h2>（覊旅作）</h2>
<p><a href="1173.html">飛騨人の真木流すといふ丹生の川言は通へど舟ぞ通はぬ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1174.html">霰降り鹿島の崎を波高み過ぎてや行かむ恋しきものを</a></p>
<h2>（覊旅作）</h2>
<p><a href="1175.html">足柄の箱根飛び越え行く鶴の羨しき見れば大和し思ほゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1176.html">夏麻引く海上潟の沖つ洲に鳥はすだけど君は音もせず</a></p>
<h2>（覊旅作）</h2>
<p><a href="1177.html">若狭なる三方の海の浜清みい行き帰らひ見れど飽かぬかも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1178.html">印南野は行き過ぎぬらし天伝ふ日笠の浦に波立てり見ゆ [一云 飾磨江は漕ぎ過ぎぬらし]</a></p>
<h2>（覊旅作）</h2>
<p><a href="1179.html">家にして我れは恋ひむな印南野の浅茅が上に照りし月夜を</a></p>
<h2>（覊旅作）</h2>
<p><a href="1180.html">荒磯越す波を畏み淡路島見ずか過ぎなむここだ近きを</a></p>
<h2>（覊旅作）</h2>
<p><a href="1181.html">朝霞止まずたなびく龍田山舟出せむ日は我れ恋ひむかも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1182.html">海人小舟帆かも張れると見るまでに鞆の浦廻に波立てり見ゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1183.html">ま幸くてまたかへり見む大夫の手に巻き持てる鞆の浦廻を</a></p>
<h2>（覊旅作）</h2>
<p><a href="1184.html">鳥じもの海に浮き居て沖つ波騒くを聞けばあまた悲しも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1185.html">朝なぎに真楫漕ぎ出て見つつ来し御津の松原波越しに見ゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1186.html">あさりする海人娘子らが袖通り濡れにし衣干せど乾かず</a></p>
<h2>（覊旅作）</h2>
<p><a href="1187.html">網引する海人とか見らむ飽の浦の清き荒磯を見に来し我れを</a></p>
<h2>（覊旅作）</h2>
<p><a href="1188.html">山越えて遠津の浜の岩つつじ我が来るまでにふふみてあり待て</a></p>
<h2>（覊旅作）</h2>
<p><a href="1189.html">大海にあらしな吹きそしなが鳥猪名の港に舟泊つるまで</a></p>
<h2>（覊旅作）</h2>
<p><a href="1190.html">舟泊ててかし振り立てて廬りせむ名児江の浜辺過ぎかてぬかも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1191.html">妹が門出入の川の瀬を早み我が馬つまづく家思ふらしも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1192.html">白栲ににほふ真土の山川に我が馬なづむ家恋ふらしも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1193.html">背の山に直に向へる妹の山事許せやも打橋渡す</a></p>
<h2>（覊旅作）</h2>
<p><a href="1194.html">紀の国の雑賀の浦に出で見れば海人の燈火波の間ゆ見ゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1195.html">麻衣着ればなつかし紀の国の妹背の山に麻蒔く我妹</a></p>
<h2>（覊旅作）</h2>
<p><a href="1196.html">つともがと乞はば取らせむ貝拾ふ我れを濡らすな沖つ白波</a></p>
<h2>（覊旅作）</h2>
<p><a href="1197.html">手に取るがからに忘ると海人の言ひし恋忘れ貝言にしありけり</a></p>
<h2>（覊旅作）</h2>
<p><a href="1198.html">あさりすと礒に棲む鶴明けされば浜風寒み己妻呼ぶも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1199.html">藻刈り舟沖漕ぎ来らし妹が島形見の浦に鶴翔る見ゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1200.html">我が舟は沖ゆな離り迎へ舟方待ちがてり浦ゆ漕ぎ逢はむ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1201.html">大海の水底響み立つ波の寄らむと思へる礒のさやけさ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1202.html">荒礒ゆもまして思へや玉の浦離れ小島の夢にし見ゆる</a></p>
<h2>（覊旅作）</h2>
<p><a href="1203.html">礒の上に爪木折り焚き汝がためと我が潜き来し沖つ白玉</a></p>
<h2>（覊旅作）</h2>
<p><a href="1204.html">浜清み礒に我が居れば見む人は海人とか見らむ釣りもせなくに</a></p>
<h2>（覊旅作）</h2>
<p><a href="1205.html">沖つ楫やくやくしぶを見まく欲り我がする里の隠らく惜しも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1206.html">沖つ波辺つ藻巻き持ち寄せ来とも君にまされる玉寄せめやも [一云 沖つ波辺波しくしく寄せ来とも]</a></p>
<h2>（覊旅作）</h2>
<p><a href="1207.html">粟島に漕ぎ渡らむと思へども明石の門波いまだ騒けり</a></p>
<h2>（覊旅作）</h2>
<p><a href="1208.html">妹に恋ひ我が越え行けば背の山の妹に恋ひずてあるが羨しさ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1209.html">人ならば母が愛子ぞあさもよし紀の川の辺の妹と背の山</a></p>
<h2>（覊旅作）</h2>
<p><a href="1210.html">我妹子に我が恋ひ行けば羨しくも並び居るかも妹と背の山</a></p>
<h2>（覊旅作）</h2>
<p><a href="1211.html">妹があたり今ぞ我が行く目のみだに我れに見えこそ言問はずとも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1212.html">足代過ぎて糸鹿の山の桜花散らずもあらなむ帰り来るまで</a></p>
<h2>（覊旅作）</h2>
<p><a href="1213.html">名草山言にしありけり我が恋ふる千重の一重も慰めなくに</a></p>
<h2>（覊旅作）</h2>
<p><a href="1214.html">安太へ行く小為手の山の真木の葉も久しく見ねば蘿生しにけり</a></p>
<h2>（覊旅作）</h2>
<p><a href="1215.html">玉津島よく見ていませあをによし奈良なる人の待ち問はばいかに</a></p>
<h2>（覊旅作）</h2>
<p><a href="1216.html">潮満たばいかにせむとか海神の神が手渡る海人娘子ども</a></p>
<h2>（覊旅作）</h2>
<p><a href="1217.html">玉津島見てしよけくも我れはなし都に行きて恋ひまく思へば</a></p>
<h2>（覊旅作）</h2>
<p><a href="1218.html">黒牛の海紅にほふももしきの大宮人しあさりすらしも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1219.html">若の浦に白波立ちて沖つ風寒き夕は大和し思ほゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1220.html">妹がため玉を拾ふと紀伊の国の由良の岬にこの日暮らしつ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1221.html">我が舟の楫はな引きそ大和より恋ひ来し心いまだ飽かなくに</a></p>
<h2>（覊旅作）</h2>
<p><a href="1222.html">玉津島見れども飽かずいかにして包み持ち行かむ見ぬ人のため</a></p>
<h2>（覊旅作）</h2>
<p><a href="1223.html">海の底沖漕ぐ舟を辺に寄せむ風も吹かぬか波立てずして</a></p>
<h2>（覊旅作）</h2>
<p><a href="1224.html">大葉山霞たなびきさ夜更けて我が舟泊てむ泊り知らずも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1225.html">さ夜更けて夜中の方におほほしく呼びし舟人泊てにけむかも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1226.html">三輪の崎荒磯も見えず波立ちぬいづくゆ行かむ避き道はなしに</a></p>
<h2>（覊旅作）</h2>
<p><a href="1227.html">礒に立ち沖辺を見れば藻刈り舟海人漕ぎ出らし鴨翔る見ゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1228.html">風早の三穂の浦廻を漕ぐ舟の舟人騒く波立つらしも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1229.html">我が舟は明石の水門に漕ぎ泊てむ沖へな離りさ夜更けにけり</a></p>
<h2>（覊旅作）</h2>
<p><a href="1230.html">ちはやぶる鐘の岬を過ぎぬとも我れは忘れじ志賀の皇神</a></p>
<h2>（覊旅作）</h2>
<p><a href="1231.html">天霧らひひかた吹くらし水茎の岡の港に波立ちわたる</a></p>
<h2>（覊旅作）</h2>
<p><a href="1232.html">大海の波は畏ししかれども神を斎ひて舟出せばいかに</a></p>
<h2>（覊旅作）</h2>
<p><a href="1233.html">娘子らが織る機の上を真櫛もち掻上げ栲島波の間ゆ見ゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1234.html">潮早み磯廻に居れば潜きする海人とや見らむ旅行く我れを</a></p>
<h2>（覊旅作）</h2>
<p><a href="1235.html">波高しいかに楫取り水鳥の浮寝やすべきなほや漕ぐべき</a></p>
<h2>（覊旅作）</h2>
<p><a href="1236.html">夢のみに継ぎて見えつつ高島の礒越す波のしくしく思ほゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1237.html">静けくも岸には波は寄せけるかこれの屋通し聞きつつ居れば</a></p>
<h2>（覊旅作）</h2>
<p><a href="1238.html">高島の安曇白波は騒けども我れは家思ふ廬り悲しみ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1239.html">大海の礒もと揺り立つ波の寄せむと思へる浜の清けく</a></p>
<h2>（覊旅作）</h2>
<p><a href="1240.html">玉櫛笥みもろと山を行きしかばおもしろくしていにしへ思ほゆ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1241.html">ぬばたまの黒髪山を朝越えて山下露に濡れにけるかも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1242.html">あしひきの山行き暮らし宿借らば妹立ち待ちてやど貸さむかも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1243.html">見わたせば近き里廻をた廻り今ぞ我が来る領巾振りし野に</a></p>
<h2>（覊旅作）</h2>
<p><a href="1244.html">娘子らが放りの髪を由布の山雲なたなびき家のあたり見む</a></p>
<h2>（覊旅作）</h2>
<p><a href="1245.html">志賀の海人の釣舟の綱堪へずして心に思ひて出でて来にけり</a></p>
<h2>（覊旅作）</h2>
<p><a href="1246.html">志賀の海人の塩焼く煙風をいたみ立ちは上らず山にたなびく</a></p>
<h2>（覊旅作）</h2>
<p><a href="1247.html">大汝少御神の作らしし妹背の山を見らくしよしも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1248.html">我妹子と見つつ偲はむ沖つ藻の花咲きたらば我れに告げこそ</a></p>
<h2>（覊旅作）</h2>
<p><a href="1249.html">君がため浮沼の池の菱摘むと我が染めし袖濡れにけるかも</a></p>
<h2>（覊旅作）</h2>
<p><a href="1250.html">妹がため菅の実摘みに行きし我れ山道に惑ひこの日暮らしつ</a></p>
<h2>問答</h2>
<p><a href="1251.html">佐保川に鳴くなる千鳥何しかも川原を偲ひいや川上る</a></p>
<h2>（問答）</h2>
<p><a href="1252.html">人こそばおほにも言はめ我がここだ偲ふ川原を標結ふなゆめ</a></p>
<h2>（問答）</h2>
<p><a href="1253.html">楽浪の志賀津の海人は我れなしに潜きはなせそ波立たずとも</a></p>
<h2>（問答）</h2>
<p><a href="1254.html">大船に楫しもあらなむ君なしに潜きせめやも波立たずとも</a></p>
<h2>臨時</h2>
<p><a href="1255.html">月草に衣ぞ染むる君がため斑の衣摺らむと思ひて</a></p>
<h2>（臨時）</h2>
<p><a href="1256.html">春霞井の上ゆ直に道はあれど君に逢はむとた廻り来も</a></p>
<h2>（臨時）</h2>
<p><a href="1257.html">道の辺の草深百合の花笑みに笑みしがからに妻と言ふべしや</a></p>
<h2>（臨時）</h2>
<p><a href="1258.html">黙あらじと言のなぐさに言ふことを聞き知れらくは悪しくはありけり</a></p>
<h2>（臨時）</h2>
<p><a href="1259.html">佐伯山卯の花持ちし愛しきが手をし取りてば花は散るとも</a></p>
<h2>（臨時）</h2>
<p><a href="1260.html">時ならぬ斑の衣着欲しきか島の榛原時にあらねども</a></p>
<h2>（臨時）</h2>
<p><a href="1261.html">山守の里へ通ひし山道ぞ茂くなりける忘れけらしも</a></p>
<h2>（臨時）</h2>
<p><a href="1262.html">あしひきの山椿咲く八つ峰越え鹿待つ君が斎ひ妻かも</a></p>
<h2>（臨時）</h2>
<p><a href="1263.html">暁と夜烏鳴けどこの岡の木末の上はいまだ静けし</a></p>
<h2>（臨時）</h2>
<p><a href="1264.html">西の市にただ独り出でて目並べず買ひてし絹の商じこりかも</a></p>
<h2>（臨時）</h2>
<p><a href="1265.html">今年行く新防人が麻衣肩のまよひは誰れか取り見む</a></p>
<h2>（臨時）</h2>
<p><a href="1266.html">大船を荒海に漕ぎ出でや船たけ我が見し子らがまみはしるしも</a></p>
<h2>就所發思  [旋頭歌]</h2>
<p><a href="1267.html">ももしきの大宮人の踏みし跡ところ沖つ波来寄らずありせば失せずあらましを</a></p>
<h2>（就所發思）</h2>
<p><a href="1268.html">子らが手を巻向山は常にあれど過ぎにし人に行きまかめやも</a></p>
<h2>（就所發思）</h2>
<p><a href="1269.html">巻向の山辺響みて行く水の水沫のごとし世の人我れは</a></p>
<h2>寄物發思</h2>
<p><a href="1270.html">こもりくの泊瀬の山に照る月は満ち欠けしけり人の常なき</a></p>
<h2>行路</h2>
<p><a href="1271.html">遠くありて雲居に見ゆる妹が家に早く至らむ歩め黒駒</a></p>
<h2>旋頭歌</h2>
<p><a href="1272.html">大刀の後鞘に入野に葛引く我妹真袖もち着せてむとかも夏草刈るも</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1273.html">住吉の波豆麻の君が馬乗衣さひづらふ漢女を据ゑて縫へる衣ぞ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1274.html">住吉の出見の浜の柴な刈りそね娘子らが赤裳の裾の濡れて行かむ見む</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1275.html">住吉の小田を刈らす子奴かもなき奴あれど妹がみためと私田刈る</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1276.html">池の辺の小槻の下の小竹な刈りそねそれをだに君が形見に見つつ偲はむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1277.html">天なる日売菅原の草な刈りそね蜷の腸か黒き髪にあくたし付くも</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1278.html">夏蔭の妻屋の下に衣裁つ我妹うら設けて我がため裁たばやや大に裁て</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1279.html">梓弓引津の辺なるなのりその花摘むまでに逢はずあらめやもなのりその花</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1280.html">うちひさす宮道を行くに我が裳は破れぬ玉の緒の思ひ乱れて家にあらましを</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1281.html">君がため手力疲れ織れる衣ぞ春さらばいかなる色に摺りてばよけむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1282.html">はしたての倉橋山に立てる白雲見まく欲り我がするなへに立てる白雲</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1283.html">はしたての倉橋川の石の橋はも男盛りに我が渡りてし石の橋はも</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1284.html">はしたての倉橋川の川の静菅我が刈りて笠にも編まぬ川の静菅</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1285.html">春日すら田に立ち疲る君は悲しも若草の妻なき君が田に立ち疲る</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1286.html">山背の久世の社の草な手折りそ我が時と立ち栄ゆとも草な手折りそ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1287.html">青みづら依網の原に人も逢はぬかも石走る近江県の物語りせむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1288.html">港の葦の末葉を誰れか手折りし我が背子が振る手を見むと我れぞ手折りし</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1289.html">垣越しに犬呼び越して鳥猟する君青山の茂き山辺に馬休め君</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1290.html">海の底沖つ玉藻のなのりその花妹と我れとここにしありとなのりその花</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1291.html">この岡に草刈るわらはなしか刈りそねありつつも君が来まさば御馬草にせむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1292.html">江林に臥せる獣やも求むるによき白栲の袖巻き上げて獣待つ我が背</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1293.html">霰降り遠つ淡海の吾跡川楊刈れどもまたも生ふといふ吾跡川楊</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1294.html">朝月の日向の山に月立てり見ゆ遠妻を待ちたる人し見つつ偲はむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1295.html">春日なる御笠の山に月の舟出づ風流士の飲む酒杯に影に見えつつ</a></p>
<h2>譬喩歌 / 寄衣</h2>
<p><a href="1296.html">今作る斑の衣面影に我れに思ほゆいまだ着ねども</a></p>
<h2>（寄衣）</h2>
<p><a href="1297.html">紅に衣染めまく欲しけども着てにほはばか人の知るべき</a></p>
<h2>（寄衣）</h2>
<p><a href="1298.html">かにかくに人は言ふとも織り継がむ我が機物の白麻衣</a></p>
<h2>寄玉</h2>
<p><a href="1299.html">あぢ群のとをよる海に舟浮けて白玉採ると人に知らゆな</a></p>
<h2>（寄玉）</h2>
<p><a href="1300.html">をちこちの礒の中なる白玉を人に知らえず見むよしもがも</a></p>
<h2>（寄玉）</h2>
<p><a href="1301.html">海神の手に巻き持てる玉故に礒の浦廻に潜きするかも</a></p>
<h2>（寄玉）</h2>
<p><a href="1302.html">海神の持てる白玉見まく欲り千たびぞ告りし潜きする海人</a></p>
<h2>（寄玉）</h2>
<p><a href="1303.html">潜きする海人は告れども海神の心し得ねば見ゆといはなくに</a></p>
<h2>寄木</h2>
<p><a href="1304.html">天雲のたなびく山の隠りたる我が下心木の葉知るらむ</a></p>
<h2>（寄木）</h2>
<p><a href="1305.html">見れど飽かぬ人国山の木の葉をし我が心からなつかしみ思ふ</a></p>
<h2>寄花</h2>
<p><a href="1306.html">この山の黄葉が下の花を我れはつはつに見てなほ恋ひにけり</a></p>
<h2>寄川</h2>
<p><a href="1307.html">この川ゆ舟は行くべくありといへど渡り瀬ごとに守る人のありて</a></p>
<h2>寄海</h2>
<p><a href="1308.html">大海をさもらふ港事しあらばいづへゆ君は我を率しのがむ</a></p>
<h2>（寄海）</h2>
<p><a href="1309.html">風吹きて海は荒るとも明日と言はば久しくあるべし君がまにまに</a></p>
<h2>（寄海）</h2>
<p><a href="1310.html">雲隠る小島の神の畏けば目こそ隔てれ心隔てや</a></p>
<h2>寄衣</h2>
<p><a href="1311.html">橡の衣は人皆事なしと言ひし時より着欲しく思ほゆ</a></p>
<h2>（寄衣）</h2>
<p><a href="1312.html">おほろかに我れし思はば下に着てなれにし衣を取りて着めやも</a></p>
<h2>（寄衣）</h2>
<p><a href="1313.html">紅の深染めの衣下に着て上に取り着ば言なさむかも</a></p>
<h2>（寄衣）</h2>
<p><a href="1314.html">橡の解き洗ひ衣のあやしくもことに着欲しきこの夕かも</a></p>
<h2>（寄衣）</h2>
<p><a href="1315.html">橘の島にし居れば川遠みさらさず縫ひし我が下衣</a></p>
<h2>寄絲</h2>
<p><a href="1316.html">河内女の手染めの糸を繰り返し片糸にあれど絶えむと思へや</a></p>
<h2>寄玉</h2>
<p><a href="1317.html">海の底沈く白玉風吹きて海は荒るとも取らずはやまじ</a></p>
<h2>（寄玉）</h2>
<p><a href="1318.html">底清み沈ける玉を見まく欲り千たびぞ告りし潜きする海人</a></p>
<h2>（寄玉）</h2>
<p><a href="1319.html">大海の水底照らし沈く玉斎ひて採らむ風な吹きそね</a></p>
<h2>（寄玉）</h2>
<p><a href="1320.html">水底に沈く白玉誰が故に心尽して我が思はなくに</a></p>
<h2>（寄玉）</h2>
<p><a href="1321.html">世間は常かくのみか結びてし白玉の緒の絶ゆらく思へば</a></p>
<h2>（寄玉）</h2>
<p><a href="1322.html">伊勢の海の海人の島津が鰒玉採りて後もか恋の繁けむ</a></p>
<h2>（寄玉）</h2>
<p><a href="1323.html">海の底沖つ白玉よしをなみ常かくのみや恋ひわたりなむ</a></p>
<h2>（寄玉）</h2>
<p><a href="1324.html">葦の根のねもころ思ひて結びてし玉の緒といはば人解かめやも</a></p>
<h2>（寄玉）</h2>
<p><a href="1325.html">白玉を手には巻かずに箱のみに置けりし人ぞ玉嘆かする</a></p>
<h2>（寄玉）</h2>
<p><a href="1326.html">照左豆が手に巻き古す玉もがもその緒は替へて我が玉にせむ</a></p>
<h2>（寄玉）</h2>
<p><a href="1327.html">秋風は継ぎてな吹きそ海の底沖なる玉を手に巻くまでに</a></p>
<h2>寄日本琴</h2>
<p><a href="1328.html">膝に伏す玉の小琴の事なくはいたくここだく我れ恋ひめやも</a></p>
<h2>寄弓</h2>
<p><a href="1329.html">陸奥の安達太良真弓弦はけて引かばか人の我を言なさむ</a></p>
<h2>（寄弓）</h2>
<p><a href="1330.html">南淵の細川山に立つ檀弓束巻くまで人に知らえじ</a></p>
<h2>寄山</h2>
<p><a href="1331.html">岩畳畏き山と知りつつも我れは恋ふるか並にあらなくに</a></p>
<h2>（寄山）</h2>
<p><a href="1332.html">岩が根のこごしき山に入りそめて山なつかしみ出でかてぬかも</a></p>
<h2>（寄山）</h2>
<p><a href="1333.html">佐保山をおほに見しかど今見れば山なつかしも風吹くなゆめ</a></p>
<h2>（寄山）</h2>
<p><a href="1334.html">奥山の岩に苔生し畏けど思ふ心をいかにかもせむ</a></p>
<h2>（寄山）</h2>
<p><a href="1335.html">思ひあまりいたもすべなみ玉たすき畝傍の山に我れ標結ひつ</a></p>
<h2>寄草</h2>
<p><a href="1336.html">冬こもり春の大野を焼く人は焼き足らねかも我が心焼く</a></p>
<h2>（寄草）</h2>
<p><a href="1337.html">葛城の高間の草野早知りて標刺さましを今ぞ悔しき</a></p>
<h2>（寄草）</h2>
<p><a href="1338.html">我がやどに生ふるつちはり心ゆも思はぬ人の衣に摺らゆな</a></p>
<h2>（寄草）</h2>
<p><a href="1339.html">月草に衣色どり摺らめどもうつろふ色と言ふが苦しさ</a></p>
<h2>（寄草）</h2>
<p><a href="1340.html">紫の糸をぞ我が搓るあしひきの山橘を貫かむと思ひて</a></p>
<h2>（寄草）</h2>
<p><a href="1341.html">真玉つく越智の菅原我れ刈らず人の刈らまく惜しき菅原</a></p>
<h2>（寄草）</h2>
<p><a href="1342.html">山高み夕日隠りぬ浅茅原後見むために標結はましを</a></p>
<h2>（寄草）</h2>
<p><a href="1343.html">言痛くはかもかもせむを岩代の野辺の下草我れし刈りてば [一云 紅の現し心や妹に逢はずあらむ]</a></p>
<h2>（寄草）</h2>
<p><a href="1344.html">真鳥棲む雲梯の杜の菅の根を衣にかき付け着せむ子もがも</a></p>
<h2>（寄草）</h2>
<p><a href="1345.html">常ならぬ人国山の秋津野のかきつはたをし夢に見しかも</a></p>
<h2>（寄草）</h2>
<p><a href="1346.html">をみなへし佐紀沢の辺の真葛原いつかも繰りて我が衣に着む</a></p>
<h2>（寄草）</h2>
<p><a href="1347.html">君に似る草と見しより我が標めし野山の浅茅人な刈りそね</a></p>
<h2>（寄草）</h2>
<p><a href="1348.html">三島江の玉江の薦を標めしより己がとぞ思ふいまだ刈らねど</a></p>
<h2>（寄草）</h2>
<p><a href="1349.html">かくしてやなほや老いなむみ雪降る大荒木野の小竹にあらなくに</a></p>
<h2>（寄草）</h2>
<p><a href="1350.html">近江のや八橋の小竹を矢はがずてまことありえむや恋しきものを</a></p>
<h2>（寄草）</h2>
<p><a href="1351.html">月草に衣は摺らむ朝露に濡れての後はうつろひぬとも</a></p>
<h2>（寄草）</h2>
<p><a href="1352.html">我が心ゆたにたゆたに浮蓴辺にも沖にも寄りかつましじ</a></p>
<h2>寄稲</h2>
<p><a href="1353.html">石上布留の早稲田を秀でずとも縄だに延へよ守りつつ居らむ</a></p>
<h2>寄木</h2>
<p><a href="1354.html">白菅の真野の榛原心ゆも思はぬ我れし衣に摺りつ</a></p>
<h2>（寄木）</h2>
<p><a href="1355.html">真木柱作る杣人いささめに仮廬のためと作りけめやも</a></p>
<h2>（寄木）</h2>
<p><a href="1356.html">向つ峰に立てる桃の木ならむやと人ぞささやく汝が心ゆめ</a></p>
<h2>（寄木）</h2>
<p><a href="1357.html">たらちねの母がそのなる桑すらに願へば衣に着るといふものを</a></p>
<h2>（寄木）</h2>
<p><a href="1358.html">はしきやし我家の毛桃本茂く花のみ咲きてならずあらめやも</a></p>
<h2>（寄木）</h2>
<p><a href="1359.html">向つ峰の若桂の木下枝取り花待つい間に嘆きつるかも</a></p>
<h2>寄花</h2>
<p><a href="1360.html">息の緒に思へる我れを山ぢさの花にか君がうつろひぬらむ</a></p>
<h2>（寄花）</h2>
<p><a href="1361.html">住吉の浅沢小野のかきつはた衣に摺り付け着む日知らずも</a></p>
<h2>（寄花）</h2>
<p><a href="1362.html">秋さらば移しもせむと我が蒔きし韓藍の花を誰れか摘みけむ</a></p>
<h2>（寄花）</h2>
<p><a href="1363.html">春日野に咲きたる萩は片枝はいまだふふめり言な絶えそね</a></p>
<h2>（寄花）</h2>
<p><a href="1364.html">見まく欲り恋ひつつ待ちし秋萩は花のみ咲きてならずかもあらむ</a></p>
<h2>（寄花）</h2>
<p><a href="1365.html">我妹子がやどの秋萩花よりは実になりてこそ恋ひまさりけれ</a></p>
<h2>寄鳥</h2>
<p><a href="1366.html">明日香川七瀬の淀に住む鳥も心あれこそ波立てざらめ</a></p>
<h2>寄獸</h2>
<p><a href="1367.html">三国山木末に住まふむささびの鳥待つごとく我れ待ち痩せむ</a></p>
<h2>寄雲</h2>
<p><a href="1368.html">岩倉の小野ゆ秋津に立ちわたる雲にしもあれや時をし待たむ</a></p>
<h2>寄雷</h2>
<p><a href="1369.html">天雲に近く光りて鳴る神の見れば畏し見ねば悲しも</a></p>
<h2>寄雨</h2>
<p><a href="1370.html">はなはだも降らぬ雨故にはたづみいたくな行きそ人の知るべく</a></p>
<h2>（寄雨）</h2>
<p><a href="1371.html">ひさかたの雨には着ぬをあやしくも我が衣手は干る時なきか</a></p>
<h2>寄月</h2>
<p><a href="1372.html">み空行く月読壮士夕さらず目には見れども寄るよしもなし</a></p>
<h2>（寄月）</h2>
<p><a href="1373.html">春日山山高くあらし岩の上の菅の根見むに月待ちかたし</a></p>
<h2>（寄月）</h2>
<p><a href="1374.html">闇の夜は苦しきものをいつしかと我が待つ月も早も照らぬか</a></p>
<h2>（寄月）</h2>
<p><a href="1375.html">朝霜の消やすき命誰がために千年もがもと我が思はなくに</a></p>
<h2>寄赤土</h2>
<p><a href="1376.html">大和の宇陀の真埴のさ丹付かばそこもか人の我を言なさむ</a></p>
<h2>寄神</h2>
<p><a href="1377.html">木綿懸けて祭る三諸の神さびて斎むにはあらず人目多みこそ</a></p>
<h2>（寄神）</h2>
<p><a href="1378.html">木綿懸けて斎ふこの社越えぬべく思ほゆるかも恋の繁きに</a></p>
<h2>寄河</h2>
<p><a href="1379.html">絶えず行く明日香の川の淀めらば故しもあるごと人の見まくに</a></p>
<h2>（寄河）</h2>
<p><a href="1380.html">明日香川瀬々に玉藻は生ひたれどしがらみあれば靡きあはなくに</a></p>
<h2>（寄河）</h2>
<p><a href="1381.html">広瀬川袖漬くばかり浅きをや心深めて我が思へるらむ</a></p>
<h2>（寄河）</h2>
<p><a href="1382.html">泊瀬川流るる水沫の絶えばこそ我が思ふ心遂げじと思はめ</a></p>
<h2>（寄河）</h2>
<p><a href="1383.html">嘆きせば人知りぬべみ山川のたぎつ心を塞かへてあるかも</a></p>
<h2>（寄河）</h2>
<p><a href="1384.html">水隠りに息づきあまり早川の瀬には立つとも人に言はめやも</a></p>
<h2>寄埋木</h2>
<p><a href="1385.html">真鉋持ち弓削の川原の埋れ木のあらはるましじきことにあらなくに</a></p>
<h2>寄海</h2>
<p><a href="1386.html">大船に真楫しじ貫き漕ぎ出なば沖は深けむ潮は干ぬとも</a></p>
<h2>（寄海）</h2>
<p><a href="1387.html">伏越ゆ行かましものをまもらふにうち濡らさえぬ波数まずして</a></p>
<h2>（寄海）</h2>
<p><a href="1388.html">石そそき岸の浦廻に寄する波辺に来寄らばか言の繁けむ</a></p>
<h2>（寄海）</h2>
<p><a href="1389.html">礒の浦に来寄る白波返りつつ過ぎかてなくは誰れにたゆたへ</a></p>
<h2>（寄海）</h2>
<p><a href="1390.html">近江の海波畏みと風まもり年はや経なむ漕ぐとはなしに</a></p>
<h2>（寄海）</h2>
<p><a href="1391.html">朝なぎに来寄る白波見まく欲り我れはすれども風こそ寄せね</a></p>
<h2>寄浦沙</h2>
<p><a href="1392.html">紫の名高の浦の真砂土袖のみ触れて寝ずかなりなむ</a></p>
<h2>（寄浦沙）</h2>
<p><a href="1393.html">豊国の企救の浜辺の真砂土真直にしあらば何か嘆かむ</a></p>
<h2>寄藻</h2>
<p><a href="1394.html">潮満てば入りぬる礒の草なれや見らく少く恋ふらくの多き</a></p>
<h2>（寄藻）</h2>
<p><a href="1395.html">沖つ波寄する荒礒のなのりそは心のうちに障みとなれり</a></p>
<h2>（寄藻）</h2>
<p><a href="1396.html">紫の名高の浦のなのりその礒に靡かむ時待つ我れを</a></p>
<h2>（寄藻）</h2>
<p><a href="1397.html">荒礒越す波は畏ししかすがに海の玉藻の憎くはあらずて</a></p>
<h2>寄船</h2>
<p><a href="1398.html">楽浪の志賀津の浦の舟乗りに乗りにし心常忘らえず</a></p>
<h2>（寄船）</h2>
<p><a href="1399.html">百伝ふ八十の島廻を漕ぐ舟に乗りにし心忘れかねつも</a></p>
<h2>（寄船）</h2>
<p><a href="1400.html">島伝ふ足早の小舟風まもり年はや経なむ逢ふとはなしに</a></p>
<h2>（寄船）</h2>
<p><a href="1401.html">水霧らふ沖つ小島に風をいたみ舟寄せかねつ心は思へど</a></p>
<h2>（寄船）</h2>
<p><a href="1402.html">こと放けば沖ゆ放けなむ港より辺著かふ時に放くべきものか</a></p>
<h2>旋頭歌</h2>
<p><a href="1403.html">御幣取り三輪の祝が斎ふ杉原薪伐りほとほとしくに手斧取らえぬ</a></p>
<h2>挽歌</h2>
<p><a href="1404.html">鏡なす我が見し君を阿婆の野の花橘の玉に拾ひつ</a></p>
<h2></h2>
<p><a href="1405.html">秋津野を人の懸くれば朝撒きし君が思ほえて嘆きはやまず</a></p>
<h2></h2>
<p><a href="1406.html">秋津野に朝居る雲の失せゆけば昨日も今日もなき人思ほゆ</a></p>
<h2></h2>
<p><a href="1407.html">隠口の泊瀬の山に霞立ちたなびく雲は妹にかもあらむ</a></p>
<h2></h2>
<p><a href="1408.html">たはことかおよづれことかこもりくの泊瀬の山に廬りせりといふ</a></p>
<h2></h2>
<p><a href="1409.html">秋山の黄葉あはれとうらぶれて入りにし妹は待てど来まさず</a></p>
<h2></h2>
<p><a href="1410.html">世間はまこと二代はゆかざらし過ぎにし妹に逢はなく思へば</a></p>
<h2></h2>
<p><a href="1411.html">幸はひのいかなる人か黒髪の白くなるまで妹が声を聞く</a></p>
<h2></h2>
<p><a href="1412.html">我が背子をいづち行かめとさき竹のそがひに寝しく今し悔しも</a></p>
<h2></h2>
<p><a href="1413.html">庭つ鳥鶏の垂り尾の乱れ尾の長き心も思ほえぬかも</a></p>
<h2></h2>
<p><a href="1414.html">薦枕相枕きし子もあらばこそ夜の更くらくも我が惜しみせめ</a></p>
<h2></h2>
<p><a href="1415.html">玉梓の妹は玉かもあしひきの清き山辺に撒けば散りぬる</a></p>
<h2>或本歌曰</h2>
<p><a href="1416.html">玉梓の妹は花かもあしひきのこの山蔭に撒けば失せぬる</a></p>
<h2>羈旅歌</h2>
<p><a href="1417.html">名児の海を朝漕ぎ来れば海中に鹿子ぞ鳴くなるあはれその鹿子</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
