#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第四巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第四巻）</h1>

 <h2>相聞 / 難波天皇妹奉上在山跡皇兄御歌一首</h2>
<p><a href="0484.html">一日こそ人も待ちよき長き日をかくのみ待たば有りかつましじ</a></p>
<h2>&lt;崗&gt;本天皇御製一首[并短歌]</h2>
<p><a href="0485.html">神代より 生れ継ぎ来れば 人さはに 国には満ちて あぢ群の 通ひは行けど 我が恋ふる 君にしあらねば 昼は 日の暮るるまで 夜は 夜の明くる極み 思ひつつ 寐も寝かてにと 明かしつらくも 長きこの夜を</a></p>
<h2>（&lt;崗&gt;本天皇御製一首[并短歌]）反歌</h2>
<p><a href="0486.html">山の端にあぢ群騒き行くなれど我れは寂しゑ君にしあらねば</a></p>
<h2>（（&lt;崗&gt;本天皇御製一首[并短歌]）反歌）</h2>
<p><a href="0487.html">近江道の鳥篭の山なる不知哉川日のころごろは恋ひつつもあらむ</a></p>
<h2>額田王思近江天皇作歌一首</h2>
<p><a href="0488.html">君待つと我が恋ひ居れば我が宿の簾動かし秋の風吹く</a></p>
<h2>鏡王女作歌一首</h2>
<p><a href="0489.html">風をだに恋ふるは羨し風をだに来むとし待たば何か嘆かむ</a></p>
<h2>吹Ｂ刀自歌二首</h2>
<p><a href="0490.html">真野の浦の淀の継橋心ゆも思へや妹が夢にし見ゆる</a></p>
<h2>（吹Ｂ刀自歌二首）</h2>
<p><a href="0491.html">川上のいつ藻の花のいつもいつも来ませ我が背子時じけめやも</a></p>
<h2>田部忌寸櫟子任&lt;大&gt;宰時歌四首</h2>
<p><a href="0492.html">衣手に取りとどこほり泣く子にもまされる我れを置きていかにせむ [舎人吉年]</a></p>
<h2>（田部忌寸櫟子任&lt;大&gt;宰時歌四首）</h2>
<p><a href="0493.html">置きていなば妹恋ひむかも敷栲の黒髪敷きて長きこの夜を <[田部忌寸櫟子]></a></p>
<h2>（田部忌寸櫟子任&lt;大&gt;宰時歌四首）</h2>
<p><a href="0494.html">我妹子を相知らしめし人をこそ恋のまされば恨めしみ思へ</a></p>
<h2>（田部忌寸櫟子任&lt;大&gt;宰時歌四首）</h2>
<p><a href="0495.html">朝日影にほへる山に照る月の飽かざる君を山越しに置きて</a></p>
<h2>柿本朝臣人麻呂歌四首</h2>
<p><a href="0496.html">み熊野の浦の浜木綿百重なす心は思へど直に逢はぬかも</a></p>
<h2>（柿本朝臣人麻呂歌四首）</h2>
<p><a href="0497.html">いにしへにありけむ人も我がごとか妹に恋ひつつ寐ねかてずけむ</a></p>
<h2>（柿本朝臣人麻呂歌四首）</h2>
<p><a href="0498.html">今のみのわざにはあらずいにしへの人ぞまさりて音にさへ泣きし</a></p>
<h2>（柿本朝臣人麻呂歌四首）</h2>
<p><a href="0499.html">百重にも来及かぬかもと思へかも君が使の見れど飽かずあらむ</a></p>
<h2>碁檀越徃伊勢國時留妻作歌一首</h2>
<p><a href="0500.html">神風の伊勢の浜荻折り伏せて旅寝やすらむ荒き浜辺に</a></p>
<h2>柿本朝臣人麻呂歌三首</h2>
<p><a href="0501.html">娘子らが袖布留山の瑞垣の久しき時ゆ思ひき我れは</a></p>
<h2>（柿本朝臣人麻呂歌三首）</h2>
<p><a href="0502.html">夏野行く牡鹿の角の束の間も妹が心を忘れて思へや</a></p>
<h2>（柿本朝臣人麻呂歌三首）</h2>
<p><a href="0503.html">玉衣のさゐさゐしづみ家の妹に物言はず来にて思ひかねつも</a></p>
<h2>柿本朝臣人麻呂妻歌一首</h2>
<p><a href="0504.html">君が家に我が住坂の家道をも我れは忘れじ命死なずは</a></p>
<h2>安倍女郎歌二首</h2>
<p><a href="0505.html">今さらに何をか思はむうち靡き心は君に寄りにしものを</a></p>
<h2>（安倍女郎歌二首）</h2>
<p><a href="0506.html">我が背子は物な思ひそ事しあらば火にも水にも我れなけなくに</a></p>
<h2>駿河Ｆ女歌一首</h2>
<p><a href="0507.html">敷栲の枕ゆくくる涙にぞ浮寝をしける恋の繁きに</a></p>
<h2>三方沙弥歌一首</h2>
<p><a href="0508.html">衣手の別かる今夜ゆ妹も我れもいたく恋ひむな逢ふよしをなみ</a></p>
<h2>丹比真人笠麻呂下筑紫國時作歌一首[并短歌]</h2>
<p><a href="0509.html">臣の女の 櫛笥に乗れる 鏡なす 御津の浜辺に さ丹つらふ 紐解き放けず 我妹子に 恋ひつつ居れば 明け暮れの 朝霧隠り 鳴く鶴の 音のみし泣かゆ 我が恋ふる 千重の一重も 慰もる 心もありやと 家のあたり 我が立ち見れば 青旗の 葛城山に たなびける 白雲隠る 天さがる 鄙の国辺に 直向ふ 淡路を過ぎ 粟島を そがひに見つつ 朝なぎに 水手の声呼び 夕なぎに 楫の音しつつ 波の上を い行きさぐくみ 岩の間を い行き廻り 稲日都麻 浦廻を過ぎて 鳥じもの なづさひ行けば 家の島 荒磯の上に うち靡き 繁に生ひたる なのりそが などかも妹に 告らず来にけむ</a></p>
<h2>（丹比真人笠麻呂下筑紫國時作歌一首[并短歌]）反歌</h2>
<p><a href="0510.html">白栲の袖解き交へて帰り来む月日を数みて行きて来ましを</a></p>
<h2>幸伊勢國時當麻麻呂大夫妻作歌一首</h2>
<p><a href="0511.html">我が背子はいづく行くらむ沖つ藻の名張の山を今日か越ゆらむ</a></p>
<h2>草嬢歌一首</h2>
<p><a href="0512.html">秋の田の穂田の刈りばかか寄りあはばそこもか人の我を言成さむ</a></p>
<h2>志貴皇子御歌一首</h2>
<p><a href="0513.html">大原のこのいち柴のいつしかと我が思ふ妹に今夜逢へるかも</a></p>
<h2>阿倍女郎歌一首</h2>
<p><a href="0514.html">我が背子が着せる衣の針目おちず入りにけらしも我が心さへ</a></p>
<h2>中臣朝臣東人贈阿倍女郎歌一首</h2>
<p><a href="0515.html">ひとり寝て絶えにし紐をゆゆしみと為むすべ知らに音のみしぞ泣く</a></p>
<h2>阿倍女郎答歌一首</h2>
<p><a href="0516.html">我が持てる三相に搓れる糸もちて付けてましもの今ぞ悔しき</a></p>
<h2>大納言兼大将軍大伴卿歌一首</h2>
<p><a href="0517.html">神木にも手は触るといふをうつたへに人妻といへば触れぬものかも</a></p>
<h2>石川郎女歌一首  [即佐保大伴大家也]</h2>
<p><a href="0518.html">春日野の山辺の道をよそりなく通ひし君が見えぬころかも</a></p>
<h2>大伴女郎歌一首  [今城王之母也今城王後賜大原真人氏也]</h2>
<p><a href="0519.html">雨障み常する君はひさかたの昨夜の夜の雨に懲りにけむかも</a></p>
<h2>（大伴女郎歌一首  [今城王之母也今城王後賜大原真人氏也]）後人追同歌一首</h2>
<p><a href="0520.html">ひさかたの雨も降らぬか雨障み君にたぐひてこの日暮らさむ</a></p>
<h2>藤原宇合大夫遷任上京時常陸娘子贈歌一首</h2>
<p><a href="0521.html">庭に立つ麻手刈り干し布曝す東女を忘れたまふな</a></p>
<h2>京職藤原大夫贈大伴郎女歌三首  [卿諱曰麻呂也]</h2>
<p><a href="0522.html">娘子らが玉櫛笥なる玉櫛の神さびけむも妹に逢はずあれば</a></p>
<h2>（京職藤原大夫贈大伴郎女歌三首  [卿諱曰麻呂也]）</h2>
<p><a href="0523.html">よく渡る人は年にもありといふをいつの間にぞも我が恋ひにける</a></p>
<h2>（京職藤原大夫贈大伴郎女歌三首  [卿諱曰麻呂也]）</h2>
<p><a href="0524.html">むし衾なごやが下に伏せれども妹とし寝ねば肌し寒しも</a></p>
<h2>（京職藤原大夫贈大伴郎女歌三首  [卿諱曰麻呂也]）大伴郎女和歌四首</h2>
<p><a href="0525.html">佐保川の小石踏み渡りぬばたまの黒馬来る夜は年にもあらぬか</a></p>
<h2>（（京職藤原大夫贈大伴郎女歌三首  [卿諱曰麻呂也]）大伴郎女和歌四首）</h2>
<p><a href="0526.html">千鳥鳴く佐保の川瀬のさざれ波やむ時もなし我が恋ふらくは</a></p>
<h2>（（京職藤原大夫贈大伴郎女歌三首  [卿諱曰麻呂也]）大伴郎女和歌四首）</h2>
<p><a href="0527.html">来むと言ふも来ぬ時あるを来じと言ふを来むとは待たじ来じと言ふものを</a></p>
<h2>（（京職藤原大夫贈大伴郎女歌三首  [卿諱曰麻呂也]）大伴郎女和歌四首）</h2>
<p><a href="0528.html">千鳥鳴く佐保の川門の瀬を広み打橋渡す汝が来と思へば</a></p>
<h2>又大伴坂上郎女歌一首</h2>
<p><a href="0529.html">佐保川の岸のつかさの柴な刈りそねありつつも春し来たらば立ち隠るがね</a></p>
<h2>天皇賜海上女王御歌一首  [寧樂宮即位天皇也]</h2>
<p><a href="0530.html">赤駒の越ゆる馬柵の標結ひし妹が心は疑ひもなし</a></p>
<h2>（天皇賜海上女王御歌一首  [寧樂宮即位天皇也]）海上&lt;王&gt;奉和歌一首  [志貴皇子之女也]</h2>
<p><a href="0531.html">梓弓爪引く夜音の遠音にも君が御幸を聞かくしよしも</a></p>
<h2>大伴宿奈麻呂宿祢歌二首  [佐保大納言&lt;卿&gt;之第三子也]</h2>
<p><a href="0532.html">うちひさす宮に行く子をま悲しみ留むれば苦し遣ればすべなし</a></p>
<h2>（大伴宿奈麻呂宿祢歌二首  [佐保大納言&lt;卿&gt;之第三子也]）</h2>
<p><a href="0533.html">難波潟潮干のなごり飽くまでに人の見る子を我れし羨しも</a></p>
<h2>安貴王歌一首[并短歌]</h2>
<p><a href="0534.html">遠妻の ここにしあらねば 玉桙の 道をた遠み 思ふそら 安けなくに 嘆くそら 苦しきものを み空行く 雲にもがも 高飛ぶ 鳥にもがも 明日行きて 妹に言どひ 我がために 妹も事なく 妹がため 我れも事なく 今も見るごと たぐひてもがも</a></p>
<h2>（安貴王歌一首[并短歌]）反歌</h2>
<p><a href="0535.html">敷栲の手枕まかず間置きて年ぞ経にける逢はなく思へば</a></p>
<h2>門部王戀歌一首</h2>
<p><a href="0536.html">意宇の海の潮干の潟の片思に思ひや行かむ道の長手を</a></p>
<h2>高田女王贈今城王歌六首</h2>
<p><a href="0537.html">言清くいたもな言ひそ一日だに君いしなくはあへかたきかも</a></p>
<h2>（高田女王贈今城王歌六首）</h2>
<p><a href="0538.html">人言を繁み言痛み逢はずありき心あるごとな思ひ我が背子</a></p>
<h2>（高田女王贈今城王歌六首）</h2>
<p><a href="0539.html">我が背子し遂げむと言はば人言は繁くありとも出でて逢はましを</a></p>
<h2>（高田女王贈今城王歌六首）</h2>
<p><a href="0540.html">我が背子にまたは逢はじかと思へばか今朝の別れのすべなかりつる</a></p>
<h2>（高田女王贈今城王歌六首）</h2>
<p><a href="0541.html">この世には人言繁し来む世にも逢はむ我が背子今ならずとも</a></p>
<h2>（高田女王贈今城王歌六首）</h2>
<p><a href="0542.html">常やまず通ひし君が使ひ来ず今は逢はじとたゆたひぬらし</a></p>
<h2>神龜元年甲子冬十月幸紀伊國之時為贈従駕人所誂娘子&lt;作歌&gt;一首[并短歌]  &lt;笠朝臣金村&gt;</h2>
<p><a href="0543.html">大君の 行幸のまにま もののふの 八十伴の男と 出で行きし 愛し夫は 天飛ぶや 軽の路より 玉たすき 畝傍を見つつ あさもよし 紀路に入り立ち 真土山 越ゆらむ君は 黄葉の 散り飛ぶ見つつ にきびにし 我れは思はず 草枕 旅をよろしと 思ひつつ 君はあらむと あそそには かつは知れども しかすがに 黙もえあらねば 我が背子が 行きのまにまに 追はむとは 千たび思へど 手弱女の 我が身にしあれば 道守の 問はむ答へを 言ひやらむ すべを知らにと 立ちてつまづく</a></p>
<h2>（神龜元年甲子冬十月幸紀伊國之時為贈従駕人所誂娘子&lt;作歌&gt;一首[并短歌]  &lt;笠朝臣金村&gt;）反歌</h2>
<p><a href="0544.html">後れ居て恋ひつつあらずは紀の国の妹背の山にあらましものを</a></p>
<h2>（（神龜元年甲子冬十月幸紀伊國之時為贈従駕人所誂娘子&lt;作歌&gt;一首[并短歌]  &lt;笠朝臣金村&gt;）反歌）</h2>
<p><a href="0545.html">我が背子が跡踏み求め追ひ行かば紀の関守い留めてむかも</a></p>
<h2>二年乙丑春三月幸三香原離宮之時得娘子&lt;作歌&gt;一首[并短歌]  &lt;笠朝臣金村&gt;</h2>
<p><a href="0546.html">三香の原 旅の宿りに 玉桙の 道の行き逢ひに 天雲の 外のみ見つつ 言問はむ よしのなければ 心のみ 咽せつつあるに 天地の 神言寄せて 敷栲の 衣手交へて 己妻と 頼める今夜 秋の夜の 百夜の長さ ありこせぬかも</a></p>
<h2>（二年乙丑春三月幸三香原離宮之時得娘子&lt;作歌&gt;一首[并短歌]  &lt;笠朝臣金村&gt;）反歌</h2>
<p><a href="0547.html">天雲の外に見しより我妹子に心も身さへ寄りにしものを</a></p>
<h2>（（二年乙丑春三月幸三香原離宮之時得娘子&lt;作歌&gt;一首[并短歌]  &lt;笠朝臣金村&gt;）反歌）</h2>
<p><a href="0548.html">今夜の早く明けなばすべをなみ秋の百夜を願ひつるかも</a></p>
<h2>五年戊辰&lt;大&gt;宰少貳石川足人朝臣遷任餞于筑前國蘆城驛家歌三首</h2>
<p><a href="0549.html">天地の神も助けよ草枕旅行く君が家にいたるまで</a></p>
<h2>（五年戊辰&lt;大&gt;宰少貳石川足人朝臣遷任餞于筑前國蘆城驛家歌三首）</h2>
<p><a href="0550.html">大船の思ひ頼みし君が去なば我れは恋ひむな直に逢ふまでに</a></p>
<h2>（五年戊辰&lt;大&gt;宰少貳石川足人朝臣遷任餞于筑前國蘆城驛家歌三首）</h2>
<p><a href="0551.html">大和道の島の浦廻に寄する波間もなけむ我が恋ひまくは</a></p>
<h2>大伴宿祢三依歌一首</h2>
<p><a href="0552.html">我が君はわけをば死ねと思へかも逢ふ夜逢はぬ夜二走るらむ</a></p>
<h2>丹生女王贈&lt;大&gt;宰帥大伴卿歌二首</h2>
<p><a href="0553.html">天雲のそくへの極み遠けども心し行けば恋ふるものかも</a></p>
<h2>（丹生女王贈&lt;大&gt;宰帥大伴卿歌二首）</h2>
<p><a href="0554.html">古人のたまへしめたる吉備の酒病めばすべなし貫簀賜らむ</a></p>
<h2>&lt;大&gt;宰帥大伴卿贈大貳丹比縣守卿遷任民部卿歌一首</h2>
<p><a href="0555.html">君がため醸みし待酒安の野にひとりや飲まむ友なしにして</a></p>
<h2>賀茂女王贈大伴宿祢三依歌一首  [故左大臣長屋王之女也]</h2>
<p><a href="0556.html">筑紫船いまだも来ねばあらかじめ荒ぶる君を見るが悲しさ</a></p>
<h2>土師宿祢水&lt;道&gt;従筑紫上京海路作歌二首</h2>
<p><a href="0557.html">大船を漕ぎの進みに岩に触れ覆らば覆れ妹によりては</a></p>
<h2>（土師宿祢水&lt;道&gt;従筑紫上京海路作歌二首）</h2>
<p><a href="0558.html">ちはやぶる神の社に我が懸けし幣は賜らむ妹に逢はなくに</a></p>
<h2>&lt;大&gt;宰大監大伴宿祢百代戀歌四首</h2>
<p><a href="0559.html">事もなく生き来しものを老いなみにかかる恋にも我れは逢へるかも</a></p>
<h2>（&lt;大&gt;宰大監大伴宿祢百代戀歌四首）</h2>
<p><a href="0560.html">恋ひ死なむ後は何せむ生ける日のためこそ妹を見まく欲りすれ</a></p>
<h2>（&lt;大&gt;宰大監大伴宿祢百代戀歌四首）</h2>
<p><a href="0561.html">思はぬを思ふと言はば大野なる御笠の杜の神し知らさむ</a></p>
<h2>（&lt;大&gt;宰大監大伴宿祢百代戀歌四首）</h2>
<p><a href="0562.html">暇なく人の眉根をいたづらに掻かしめつつも逢はぬ妹かも</a></p>
<h2>大伴坂上郎女歌二首</h2>
<p><a href="0563.html">黒髪に白髪交り老ゆるまでかかる恋にはいまだ逢はなくに</a></p>
<h2>（大伴坂上郎女歌二首）</h2>
<p><a href="0564.html">山菅の実ならぬことを我れに寄せ言はれし君は誰れとか寝らむ</a></p>
<h2>賀茂女王歌一首</h2>
<p><a href="0565.html">大伴の見つとは言はじあかねさし照れる月夜に直に逢へりとも</a></p>
<h2>&lt;大&gt;宰大監大伴宿祢百代等贈驛使歌二首</h2>
<p><a href="0566.html">草枕旅行く君を愛しみたぐひてぞ来し志賀の浜辺を</a></p>
<h2>（&lt;大&gt;宰大監大伴宿祢百代等贈驛使歌二首）</h2>
<p><a href="0567.html">周防なる磐国山を越えむ日は手向けよくせよ荒しその道</a></p>
<h2>&lt;大&gt;宰帥大伴卿被任大納言臨入京之時府官人等餞卿筑前國蘆城驛家歌四首</h2>
<p><a href="0568.html">み崎廻の荒磯に寄する五百重波立ちても居ても我が思へる君</a></p>
<h2>（&lt;大&gt;宰帥大伴卿被任大納言臨入京之時府官人等餞卿筑前國蘆城驛家歌四首）</h2>
<p><a href="0569.html">韓人の衣染むといふ紫の心に染みて思ほゆるかも</a></p>
<h2>（&lt;大&gt;宰帥大伴卿被任大納言臨入京之時府官人等餞卿筑前國蘆城驛家歌四首）</h2>
<p><a href="0570.html">大和へに君が発つ日の近づけば野に立つ鹿も響めてぞ鳴く</a></p>
<h2>（&lt;大&gt;宰帥大伴卿被任大納言臨入京之時府官人等餞卿筑前國蘆城驛家歌四首）</h2>
<p><a href="0571.html">月夜よし川の音清しいざここに行くも行かぬも遊びて行かむ</a></p>
<h2>&lt;大&gt;宰帥大伴卿上京之後沙弥満誓贈卿歌二首</h2>
<p><a href="0572.html">まそ鏡見飽かぬ君に後れてや朝夕にさびつつ居らむ</a></p>
<h2>（&lt;大&gt;宰帥大伴卿上京之後沙弥満誓贈卿歌二首）</h2>
<p><a href="0573.html">ぬばたまの黒髪変り白けても痛き恋には逢ふ時ありけり</a></p>
<h2>大納言大伴卿和歌二首</h2>
<p><a href="0574.html">ここにありて筑紫やいづち白雲のたなびく山の方にしあるらし</a></p>
<h2>（大納言大伴卿和歌二首）</h2>
<p><a href="0575.html">草香江の入江にあさる葦鶴のあなたづたづし友なしにして</a></p>
<h2>&lt;大&gt;宰帥大伴卿上京之後筑後守葛井連大成悲嘆作歌一首</h2>
<p><a href="0576.html">今よりは城の山道は寂しけむ我が通はむと思ひしものを</a></p>
<h2>大納言大伴卿新袍贈攝津大夫高安王歌一首</h2>
<p><a href="0577.html">我が衣人にな着せそ網引する難波壮士の手には触るとも</a></p>
<h2>大伴宿祢三依悲別歌一首</h2>
<p><a href="0578.html">天地とともに久しく住まはむと思ひてありし家の庭はも</a></p>
<h2>&lt;余&gt;明軍與大伴宿祢家持歌二首  [明軍者大納言卿之資人也]</h2>
<p><a href="0579.html">見まつりていまだ時だに変らねば年月のごと思ほゆる君</a></p>
<h2>（&lt;余&gt;明軍與大伴宿祢家持歌二首  [明軍者大納言卿之資人也]）</h2>
<p><a href="0580.html">あしひきの山に生ひたる菅の根のねもころ見まく欲しき君かも</a></p>
<h2>大伴坂上家之大娘報&lt;贈&gt;大伴宿祢家持歌四首</h2>
<p><a href="0581.html">生きてあらば見まくも知らず何しかも死なむよ妹と夢に見えつる</a></p>
<h2>（大伴坂上家之大娘報&lt;贈&gt;大伴宿祢家持歌四首）</h2>
<p><a href="0582.html">ますらをもかく恋ひけるをたわやめの恋ふる心にたぐひあらめやも</a></p>
<h2>（大伴坂上家之大娘報&lt;贈&gt;大伴宿祢家持歌四首）</h2>
<p><a href="0583.html">月草のうつろひやすく思へかも我が思ふ人の言も告げ来ぬ</a></p>
<h2>（大伴坂上家之大娘報&lt;贈&gt;大伴宿祢家持歌四首）</h2>
<p><a href="0584.html">春日山朝立つ雲の居ぬ日なく見まくの欲しき君にもあるかも</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="0585.html">出でていなむ時しはあらむをことさらに妻恋しつつ立ちていぬべしや</a></p>
<h2>大伴宿祢稲公贈田村大嬢歌一首  [大伴&lt;宿&gt;奈麻呂卿&lt;之&gt;女也]</h2>
<p><a href="0586.html">相見ずは恋ひずあらましを妹を見てもとなかくのみ恋ひばいかにせむ</a></p>
<h2>笠女郎贈大伴宿祢家持歌廿四首</h2>
<p><a href="0587.html">我が形見見つつ偲はせあらたまの年の緒長く我れも偲はむ</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0588.html">白鳥の飛羽山松の待ちつつぞ我が恋ひわたるこの月ごろを</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0589.html">衣手を打廻の里にある我れを知らにぞ人は待てど来ずける</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0590.html">あらたまの年の経ぬれば今しはとゆめよ我が背子我が名告らすな</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0591.html">我が思ひを人に知るれか玉櫛笥開きあけつと夢にし見ゆる</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0592.html">闇の夜に鳴くなる鶴の外のみに聞きつつかあらむ逢ふとはなしに</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0593.html">君に恋ひいたもすべなみ奈良山の小松が下に立ち嘆くかも</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0594.html">我がやどの夕蔭草の白露の消ぬがにもとな思ほゆるかも</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0595.html">我が命の全けむ限り忘れめやいや日に異には思ひ増すとも</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0596.html">八百日行く浜の真砂も我が恋にあにまさらじか沖つ島守</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0597.html">うつせみの人目を繁み石橋の間近き君に恋ひわたるかも</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0598.html">恋にもぞ人は死にする水無瀬川下ゆ我れ痩す月に日に異に</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0599.html">朝霧のおほに相見し人故に命死ぬべく恋ひわたるかも</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0600.html">伊勢の海の礒もとどろに寄する波畏き人に恋ひわたるかも</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0601.html">心ゆも我は思はずき山川も隔たらなくにかく恋ひむとは</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0602.html">夕されば物思ひまさる見し人の言とふ姿面影にして</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0603.html">思ふにし死にするものにあらませば千たびぞ我れは死にかへらまし</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0604.html">剣大刀身に取り添ふと夢に見つ何のさがぞも君に逢はむため</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0605.html">天地の神の理なくはこそ我が思ふ君に逢はず死にせめ</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0606.html">我れも思ふ人もな忘れおほなわに浦吹く風のやむ時もなし</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0607.html">皆人を寝よとの鐘は打つなれど君をし思へば寐ねかてぬかも</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0608.html">相思はぬ人を思ふは大寺の餓鬼の後方に額つくごとし</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0609.html">心ゆも我は思はずきまたさらに我が故郷に帰り来むとは</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）</h2>
<p><a href="0610.html">近くあれば見ねどもあるをいや遠く君がいまさば有りかつましじ</a></p>
<h2>（笠女郎贈大伴宿祢家持歌廿四首）大伴宿祢家持和&lt;歌&gt;二首</h2>
<p><a href="0611.html">今さらに妹に逢はめやと思へかもここだ我が胸いぶせくあるらむ</a></p>
<h2>（（笠女郎贈大伴宿祢家持歌廿四首）大伴宿祢家持和&lt;歌&gt;二首）</h2>
<p><a href="0612.html">なかなかに黙もあらましを何すとか相見そめけむ遂げざらまくに</a></p>
<h2>山口女王贈大伴宿祢家持歌五首</h2>
<p><a href="0613.html">もの思ふと人に見えじとなまじひに常に思へりありぞかねつる</a></p>
<h2>（山口女王贈大伴宿祢家持歌五首）</h2>
<p><a href="0614.html">相思はぬ人をやもとな白栲の袖漬つまでに音のみし泣くも</a></p>
<h2>（山口女王贈大伴宿祢家持歌五首）</h2>
<p><a href="0615.html">我が背子は相思はずとも敷栲の君が枕は夢に見えこそ</a></p>
<h2>（山口女王贈大伴宿祢家持歌五首）</h2>
<p><a href="0616.html">剣太刀名の惜しけくも我れはなし君に逢はずて年の経ぬれば</a></p>
<h2>（山口女王贈大伴宿祢家持歌五首）</h2>
<p><a href="0617.html">葦辺より満ち来る潮のいや増しに思へか君が忘れかねつる</a></p>
<h2>大神女郎贈大伴宿祢家持歌一首</h2>
<p><a href="0618.html">さ夜中に友呼ぶ千鳥物思ふとわびをる時に鳴きつつもとな</a></p>
<h2>大伴坂上郎女怨恨歌一首[并短歌]</h2>
<p><a href="0619.html">おしてる 難波の菅の ねもころに 君が聞こして 年深く 長くし言へば まそ鏡 磨ぎし心を ゆるしてし その日の極み 波の共 靡く玉藻の かにかくに 心は持たず 大船の 頼める時に ちはやぶる 神か離くらむ うつせみの 人か障ふらむ 通はしし 君も来まさず 玉梓の 使も見えず なりぬれば いたもすべなみ ぬばたまの 夜はすがらに 赤らひく 日も暮るるまで 嘆けども 験をなみ 思へども たづきを知らに たわや女と 言はくもしるく たわらはの 音のみ泣きつつ た廻り 君が使を 待ちやかねてむ</a></p>
<h2>（大伴坂上郎女怨恨歌一首[并短歌]）反歌</h2>
<p><a href="0620.html">初めより長く言ひつつ頼めずはかかる思ひに逢はましものか</a></p>
<h2>西海道節度使判官佐伯宿祢東人妻贈夫君歌一首</h2>
<p><a href="0621.html">間なく恋ふれにかあらむ草枕旅なる君が夢にし見ゆる</a></p>
<h2>（西海道節度使判官佐伯宿祢東人妻贈夫君歌一首）佐伯宿祢東人和歌一首</h2>
<p><a href="0622.html">草枕旅に久しくなりぬれば汝をこそ思へな恋ひそ我妹</a></p>
<h2>池邊王宴誦歌一首</h2>
<p><a href="0623.html">松の葉に月はゆつりぬ黄葉の過ぐれや君が逢はぬ夜ぞ多き</a></p>
<h2>天皇思酒人女王御製歌一首  [女王者穂積皇子之孫女也]</h2>
<p><a href="0624.html">道に逢ひて笑まししからに降る雪の消なば消ぬがに恋ふといふ我妹</a></p>
<h2>高安王Ｌ鮒贈娘子歌一首  [高安王者後賜姓大原真人氏]</h2>
<p><a href="0625.html">沖辺行き辺を行き今や妹がため我が漁れる藻臥束鮒</a></p>
<h2>八代女王獻天皇歌一首</h2>
<p><a href="0626.html">君により言の繁きを故郷の明日香の川にみそぎしに行く [一尾云龍田越え御津の浜辺にみそぎしに行く]</a></p>
<h2>娘子報贈佐伯宿祢赤麻呂歌一首</h2>
<p><a href="0627.html">我がたもとまかむと思はむ大夫は変若水求め白髪生ひにけり</a></p>
<h2>（娘子報贈佐伯宿祢赤麻呂歌一首）佐伯宿祢赤麻呂和歌一首</h2>
<p><a href="0628.html">白髪生ふることは思はず変若水はかにもかくにも求めて行かむ</a></p>
<h2>大伴四綱宴席歌一首</h2>
<p><a href="0629.html">何すとか使の来つる君をこそかにもかくにも待ちかてにすれ</a></p>
<h2>佐伯宿祢赤麻呂歌一首</h2>
<p><a href="0630.html">初花の散るべきものを人言の繁きによりてよどむころかも</a></p>
<h2>湯原王贈娘子歌二首  [志貴皇子之子也]</h2>
<p><a href="0631.html">うはへなきものかも人はしかばかり遠き家路を帰さく思へば</a></p>
<h2>（湯原王贈娘子歌二首  [志貴皇子之子也]）</h2>
<p><a href="0632.html">目には見て手には取らえぬ月の内の楓のごとき妹をいかにせむ</a></p>
<h2>（湯原王贈娘子歌二首  [志貴皇子之子也]）娘子報贈歌二首</h2>
<p><a href="0633.html">ここだくも思ひけめかも敷栲の枕片さる夢に見え来し</a></p>
<h2>（（湯原王贈娘子歌二首  [志貴皇子之子也]）娘子報贈歌二首）</h2>
<p><a href="0634.html">家にして見れど飽かぬを草枕旅にも妻とあるが羨しさ</a></p>
<h2>湯原王亦贈歌二首</h2>
<p><a href="0635.html">草枕旅には妻は率たれども櫛笥のうちの玉をこそ思へ</a></p>
<h2>（湯原王亦贈歌二首）</h2>
<p><a href="0636.html">我が衣形見に奉る敷栲の枕を放けずまきてさ寝ませ</a></p>
<h2>娘子復報贈歌一首</h2>
<p><a href="0637.html">我が背子が形見の衣妻どひに我が身は離けじ言とはずとも</a></p>
<h2>湯原王亦贈歌一首</h2>
<p><a href="0638.html">ただ一夜隔てしからにあらたまの月か経ぬると心惑ひぬ</a></p>
<h2>娘子復報贈歌一首</h2>
<p><a href="0639.html">我が背子がかく恋ふれこそぬばたまの夢に見えつつ寐ねらえずけれ</a></p>
<h2>湯原王亦贈歌一首</h2>
<p><a href="0640.html">はしけやし間近き里を雲居にや恋ひつつ居らむ月も経なくに</a></p>
<h2>娘子復報贈&lt;歌&gt;一首</h2>
<p><a href="0641.html">絶ゆと言はばわびしみせむと焼大刀のへつかふことは幸くや我が君</a></p>
<h2>湯原王歌一首</h2>
<p><a href="0642.html">我妹子に恋ひて乱ればくるべきに懸けて寄せむと我が恋ひそめし</a></p>
<h2>紀郎女怨恨歌三首  [鹿人大夫之女名曰小鹿也安貴王之妻也]</h2>
<p><a href="0643.html">世の中の女にしあらば我が渡る痛背の川を渡りかねめや</a></p>
<h2>（紀郎女怨恨歌三首  [鹿人大夫之女名曰小鹿也安貴王之妻也]）</h2>
<p><a href="0644.html">今は我はわびぞしにける息の緒に思ひし君をゆるさく思へば</a></p>
<h2>（紀郎女怨恨歌三首  [鹿人大夫之女名曰小鹿也安貴王之妻也]）</h2>
<p><a href="0645.html">白栲の袖別るべき日を近み心にむせひ音のみし泣かゆ</a></p>
<h2>大伴宿祢駿河麻呂歌一首</h2>
<p><a href="0646.html">ますらをの思ひわびつつたびまねく嘆く嘆きを負はぬものかも</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="0647.html">心には忘るる日なく思へども人の言こそ繁き君にあれ</a></p>
<h2>大伴宿祢駿河麻呂歌一首</h2>
<p><a href="0648.html">相見ずて日長くなりぬこの頃はいかに幸くやいふかし我妹</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="0649.html">夏葛の絶えぬ使のよどめれば事しもあるごと思ひつるかも</a></p>
<h2>大伴宿祢三依離復相歡歌一首</h2>
<p><a href="0650.html">我妹子は常世の国に住みけらし昔見しより変若ましにけり</a></p>
<h2>大伴坂上郎女歌二首</h2>
<p><a href="0651.html">ひさかたの天の露霜置きにけり家なる人も待ち恋ひぬらむ</a></p>
<h2>（大伴坂上郎女歌二首）</h2>
<p><a href="0652.html">玉守に玉は授けてかつがつも枕と我れはいざふたり寝む</a></p>
<h2>大伴宿祢駿河麻呂歌三首</h2>
<p><a href="0653.html">心には忘れぬものをたまさかに見ぬ日さまねく月ぞ経にける</a></p>
<h2>（大伴宿祢駿河麻呂歌三首）</h2>
<p><a href="0654.html">相見ては月も経なくに恋ふと言はばをそろと我れを思ほさむかも</a></p>
<h2>（大伴宿祢駿河麻呂歌三首）</h2>
<p><a href="0655.html">思はぬを思ふと言はば天地の神も知らさむ邑礼左変</a></p>
<h2>大伴坂上郎女歌六首</h2>
<p><a href="0656.html">我れのみぞ君には恋ふる我が背子が恋ふといふことは言のなぐさぞ</a></p>
<h2>（大伴坂上郎女歌六首）</h2>
<p><a href="0657.html">思はじと言ひてしものをはねず色のうつろひやすき我が心かも</a></p>
<h2>（大伴坂上郎女歌六首）</h2>
<p><a href="0658.html">思へども験もなしと知るものを何かここだく我が恋ひわたる</a></p>
<h2>（大伴坂上郎女歌六首）</h2>
<p><a href="0659.html">あらかじめ人言繁しかくしあらばしゑや我が背子奥もいかにあらめ</a></p>
<h2>（大伴坂上郎女歌六首）</h2>
<p><a href="0660.html">汝をと我を人ぞ離くなるいで我が君人の中言聞きこすなゆめ</a></p>
<h2>（大伴坂上郎女歌六首）</h2>
<p><a href="0661.html">恋ひ恋ひて逢へる時だにうるはしき言尽してよ長くと思はば</a></p>
<h2>市原王歌一首</h2>
<p><a href="0662.html">網児の山五百重隠せる佐堤の崎さで延へし子が夢にし見ゆる</a></p>
<h2>安&lt;都&gt;宿祢年足歌一首</h2>
<p><a href="0663.html">佐保渡り我家の上に鳴く鳥の声なつかしきはしき妻の子</a></p>
<h2>大伴宿祢像見歌一首</h2>
<p><a href="0664.html">石上降るとも雨につつまめや妹に逢はむと言ひてしものを</a></p>
<h2>安倍朝臣蟲麻呂歌一首</h2>
<p><a href="0665.html">向ひ居て見れども飽かぬ我妹子に立ち別れ行かむたづき知らずも</a></p>
<h2>大伴坂上郎女歌二首</h2>
<p><a href="0666.html">相見ぬは幾久さにもあらなくにここだく我れは恋ひつつもあるか</a></p>
<h2>（大伴坂上郎女歌二首）</h2>
<p><a href="0667.html">恋ひ恋ひて逢ひたるものを月しあれば夜は隠るらむしましはあり待て</a></p>
<h2>厚見王歌一首</h2>
<p><a href="0668.html">朝に日に色づく山の白雲の思ひ過ぐべき君にあらなくに</a></p>
<h2>春日王歌一首  [志貴皇子之子母曰多紀皇女也]</h2>
<p><a href="0669.html">あしひきの山橘の色に出でよ語らひ継ぎて逢ふこともあらむ</a></p>
<h2>湯原王歌一首</h2>
<p><a href="0670.html">月読の光りに来ませあしひきの山きへなりて遠からなくに</a></p>
<h2>（湯原王歌一首）和歌一首  [不審作者]</h2>
<p><a href="0671.html">月読の光りは清く照らせれど惑へる心思ひあへなくに</a></p>
<h2>安倍朝臣蟲麻呂歌一首</h2>
<p><a href="0672.html">しつたまき数にもあらぬ命もて何かここだく我が恋ひわたる</a></p>
<h2>大伴坂上郎女歌二首</h2>
<p><a href="0673.html">まそ鏡磨ぎし心をゆるしてば後に言ふとも験あらめやも</a></p>
<h2>（大伴坂上郎女歌二首）</h2>
<p><a href="0674.html">真玉つくをちこち兼ねて言は言へど逢ひて後こそ悔にはありといへ</a></p>
<h2>中臣女郎贈大伴宿祢家持歌五首</h2>
<p><a href="0675.html">をみなへし佐紀沢に生ふる花かつみかつても知らぬ恋もするかも</a></p>
<h2>（中臣女郎贈大伴宿祢家持歌五首）</h2>
<p><a href="0676.html">海の底奥を深めて我が思へる君には逢はむ年は経ぬとも</a></p>
<h2>（中臣女郎贈大伴宿祢家持歌五首）</h2>
<p><a href="0677.html">春日山朝居る雲のおほほしく知らぬ人にも恋ふるものかも</a></p>
<h2>（中臣女郎贈大伴宿祢家持歌五首）</h2>
<p><a href="0678.html">直に逢ひて見てばのみこそたまきはる命に向ふ我が恋やまめ</a></p>
<h2>（中臣女郎贈大伴宿祢家持歌五首）</h2>
<p><a href="0679.html">いなと言はば強ひめや我が背菅の根の思ひ乱れて恋ひつつもあらむ</a></p>
<h2>大伴宿祢家持与交遊別歌三首</h2>
<p><a href="0680.html">けだしくも人の中言聞かせかもここだく待てど君が来まさぬ</a></p>
<h2>（大伴宿祢家持与交遊別歌三首）</h2>
<p><a href="0681.html">なかなかに絶ゆとし言はばかくばかり息の緒にして我れ恋ひめやも</a></p>
<h2>（大伴宿祢家持与交遊別歌三首）</h2>
<p><a href="0682.html">思ふらむ人にあらなくにねもころに心尽して恋ふる我れかも</a></p>
<h2>大伴坂上郎女歌七首</h2>
<p><a href="0683.html">言ふ言の畏き国ぞ紅の色にな出でそ思ひ死ぬとも</a></p>
<h2>（大伴坂上郎女歌七首）</h2>
<p><a href="0684.html">今は我は死なむよ我が背生けりとも我れに依るべしと言ふといはなくに</a></p>
<h2>（大伴坂上郎女歌七首）</h2>
<p><a href="0685.html">人言を繁みか君が二鞘の家を隔てて恋ひつつまさむ</a></p>
<h2>（大伴坂上郎女歌七首）</h2>
<p><a href="0686.html">このころは千年や行きも過ぎぬると我れやしか思ふ見まく欲りかも</a></p>
<h2>（大伴坂上郎女歌七首）</h2>
<p><a href="0687.html">うるはしと我が思ふ心速川の塞きに塞くともなほや崩えなむ</a></p>
<h2>（大伴坂上郎女歌七首）</h2>
<p><a href="0688.html">青山を横ぎる雲のいちしろく我れと笑まして人に知らゆな</a></p>
<h2>（大伴坂上郎女歌七首）</h2>
<p><a href="0689.html">海山も隔たらなくに何しかも目言をだにもここだ乏しき</a></p>
<h2>大伴宿祢三依悲別歌一首</h2>
<p><a href="0690.html">照る月を闇に見なして泣く涙衣濡らしつ干す人なしに</a></p>
<h2>大伴宿祢家持贈娘子歌二首</h2>
<p><a href="0691.html">ももしきの大宮人は多かれど心に乗りて思ほゆる妹</a></p>
<h2>（大伴宿祢家持贈娘子歌二首）</h2>
<p><a href="0692.html">うはへなき妹にもあるかもかくばかり人の心を尽さく思へば</a></p>
<h2>大伴宿祢千室歌一首  [未詳]</h2>
<p><a href="0693.html">かくのみし恋ひやわたらむ秋津野にたなびく雲の過ぐとはなしに</a></p>
<h2>廣河女王歌二首  [穂積皇子之孫女上道王之女也]</h2>
<p><a href="0694.html">恋草を力車に七車積みて恋ふらく我が心から</a></p>
<h2>（廣河女王歌二首  [穂積皇子之孫女上道王之女也]）</h2>
<p><a href="0695.html">恋は今はあらじと我れは思へるをいづくの恋ぞつかみかかれる</a></p>
<h2>石川朝臣廣成歌一首  [後賜&lt;姓&gt;高圓朝臣氏也]</h2>
<p><a href="0696.html">家人に恋過ぎめやもかはづ鳴く泉の里に年の経ぬれば</a></p>
<h2>大伴宿祢像見歌三首</h2>
<p><a href="0697.html">我が聞きに懸けてな言ひそ刈り薦の乱れて思ふ君が直香ぞ</a></p>
<h2>（大伴宿祢像見歌三首）</h2>
<p><a href="0698.html">春日野に朝居る雲のしくしくに我れは恋ひ増す月に日に異に</a></p>
<h2>（大伴宿祢像見歌三首）</h2>
<p><a href="0699.html">一瀬には千たび障らひ行く水の後にも逢はむ今にあらずとも</a></p>
<h2>大伴宿祢家持到娘子之門作歌一首</h2>
<p><a href="0700.html">かくしてやなほや罷らむ近からぬ道の間をなづみ参ゐ来て</a></p>
<h2>河内百枝娘子贈大伴宿祢家持歌二首</h2>
<p><a href="0701.html">はつはつに人を相見ていかにあらむいづれの日にかまた外に見む</a></p>
<h2>（河内百枝娘子贈大伴宿祢家持歌二首）</h2>
<p><a href="0702.html">ぬばたまのその夜の月夜今日までに我れは忘れず間なくし思へば</a></p>
<h2>巫部麻蘇娘子歌二首</h2>
<p><a href="0703.html">我が背子を相見しその日今日までに我が衣手は干る時もなし</a></p>
<h2>（巫部麻蘇娘子歌二首）</h2>
<p><a href="0704.html">栲縄の長き命を欲りしくは絶えずて人を見まく欲りこそ</a></p>
<h2>大伴宿祢家持贈童女歌一首</h2>
<p><a href="0705.html">はねかづら今する妹を夢に見て心のうちに恋ひわたるかも</a></p>
<h2>童女来報歌一首</h2>
<p><a href="0706.html">はねかづら今する妹はなかりしをいづれの妹ぞここだ恋ひたる</a></p>
<h2>粟田&lt;女&gt;娘子贈大伴宿祢家持歌二首</h2>
<p><a href="0707.html">思ひ遣るすべの知らねば片もひの底にぞ我れは恋ひ成りにける <[注土ｈ之中]></a></p>
<h2>（粟田&lt;女&gt;娘子贈大伴宿祢家持歌二首）</h2>
<p><a href="0708.html">またも逢はむよしもあらぬか白栲の我が衣手にいはひ留めむ</a></p>
<h2>豊前國娘子大宅女の歌一首  [未審姓氏]</h2>
<p><a href="0709.html">夕闇は道たづたづし月待ちて行ませ我が背子その間にも見む</a></p>
<h2>安都扉娘子歌一首</h2>
<p><a href="0710.html">み空行く月の光にただ一目相見し人の夢にし見ゆる</a></p>
<h2>丹波大女娘子歌三首</h2>
<p><a href="0711.html">鴨鳥の遊ぶこの池に木の葉落ちて浮きたる心我が思はなくに</a></p>
<h2>（丹波大女娘子歌三首）</h2>
<p><a href="0712.html">味酒を三輪の祝がいはふ杉手触れし罪か君に逢ひかたき</a></p>
<h2>（丹波大女娘子歌三首）</h2>
<p><a href="0713.html">垣ほなす人言聞きて我が背子が心たゆたひ逢はぬこのころ</a></p>
<h2>大伴宿祢家持贈娘子歌七首</h2>
<p><a href="0714.html">心には思ひわたれどよしをなみ外のみにして嘆きぞ我がする</a></p>
<h2>（大伴宿祢家持贈娘子歌七首）</h2>
<p><a href="0715.html">千鳥鳴く佐保の川門の清き瀬を馬うち渡しいつか通はむ</a></p>
<h2>（大伴宿祢家持贈娘子歌七首）</h2>
<p><a href="0716.html">夜昼といふ別き知らず我が恋ふる心はけだし夢に見えきや</a></p>
<h2>（大伴宿祢家持贈娘子歌七首）</h2>
<p><a href="0717.html">つれもなくあるらむ人を片思に我れは思へばわびしくもあるか</a></p>
<h2>（大伴宿祢家持贈娘子歌七首）</h2>
<p><a href="0718.html">思はぬに妹が笑ひを夢に見て心のうちに燃えつつぞ居る</a></p>
<h2>（大伴宿祢家持贈娘子歌七首）</h2>
<p><a href="0719.html">ますらをと思へる我れをかくばかりみつれにみつれ片思をせむ</a></p>
<h2>（大伴宿祢家持贈娘子歌七首）</h2>
<p><a href="0720.html">むらきもの心砕けてかくばかり我が恋ふらくを知らずかあるらむ</a></p>
<h2>獻天皇歌一首  [大伴坂上郎女在佐保宅作也]</h2>
<p><a href="0721.html">あしひきの山にしをれば風流なみ我がするわざをとがめたまふな</a></p>
<h2>大伴宿祢家持歌一首</h2>
<p><a href="0722.html">かくばかり恋ひつつあらずは石木にもならましものを物思はずして</a></p>
<h2>大伴坂上郎女従跡見庄&lt;賜&gt;留宅女子大嬢歌一首[并短歌]</h2>
<p><a href="0723.html">常世にと 我が行かなくに 小金門に もの悲しらに 思へりし 我が子の刀自を ぬばたまの 夜昼といはず 思ふにし 我が身は痩せぬ 嘆くにし 袖さへ濡れぬ かくばかり もとなし恋ひば 故郷に この月ごろも 有りかつましじ</a></p>
<h2>（大伴坂上郎女従跡見庄&lt;賜&gt;留宅女子大嬢歌一首[并短歌]）反歌</h2>
<p><a href="0724.html">朝髪の思ひ乱れてかくばかり汝姉が恋ふれぞ夢に見えける</a></p>
<h2>獻天皇歌二首  [大伴坂上郎女在春日里作也]</h2>
<p><a href="0725.html">にほ鳥の潜く池水心あらば君に我が恋ふる心示さね</a></p>
<h2>（獻天皇歌二首  [大伴坂上郎女在春日里作也]）</h2>
<p><a href="0726.html">外に居て恋ひつつあらずは君が家の池に住むといふ鴨にあらましを</a></p>
<h2>大伴宿祢家持贈坂上家大嬢歌二首  [&lt;離&gt;絶數年復會相聞徃来]</h2>
<p><a href="0727.html">忘れ草我が下紐に付けたれど醜の醜草言にしありけり</a></p>
<h2>（大伴宿祢家持贈坂上家大嬢歌二首  [&lt;離&gt;絶數年復會相聞徃来]）</h2>
<p><a href="0728.html">人もなき国もあらぬか我妹子とたづさはり行きて副ひて居らむ</a></p>
<h2>大伴坂上大嬢贈大伴宿祢家持歌三首</h2>
<p><a href="0729.html">玉ならば手にも巻かむをうつせみの世の人なれば手に巻きかたし</a></p>
<h2>（大伴坂上大嬢贈大伴宿祢家持歌三首）</h2>
<p><a href="0730.html">逢はむ夜はいつもあらむを何すとかその宵逢ひて言の繁きも</a></p>
<h2>（大伴坂上大嬢贈大伴宿祢家持歌三首）</h2>
<p><a href="0731.html">我が名はも千名の五百名に立ちぬとも君が名立たば惜しみこそ泣け</a></p>
<h2>又大伴宿祢家持和歌三首</h2>
<p><a href="0732.html">今しはし名の惜しけくも我れはなし妹によりては千たび立つとも</a></p>
<h2>（又大伴宿祢家持和歌三首）</h2>
<p><a href="0733.html">うつせみの世やも二行く何すとか妹に逢はずて我がひとり寝む</a></p>
<h2>（又大伴宿祢家持和歌三首）</h2>
<p><a href="0734.html">我が思ひかくてあらずは玉にもがまことも妹が手に巻かれなむ</a></p>
<h2>同坂上大嬢贈家持歌一首</h2>
<p><a href="0735.html">春日山霞たなびき心ぐく照れる月夜にひとりかも寝む</a></p>
<h2>又家持和坂上大嬢歌一首</h2>
<p><a href="0736.html">月夜には門に出で立ち夕占問ひ足占をぞせし行かまくを欲り</a></p>
<h2>同大嬢贈家持歌二首</h2>
<p><a href="0737.html">かにかくに人は言ふとも若狭道の後瀬の山の後も逢はむ君</a></p>
<h2>（同大嬢贈家持歌二首）</h2>
<p><a href="0738.html">世の中の苦しきものにありけらし恋にあへずて死ぬべき思へば</a></p>
<h2>又家持和坂上大嬢歌二首</h2>
<p><a href="0739.html">後瀬山後も逢はむと思へこそ死ぬべきものを今日までも生けれ</a></p>
<h2>（又家持和坂上大嬢歌二首）</h2>
<p><a href="0740.html">言のみを後も逢はむとねもころに我れを頼めて逢はざらむかも</a></p>
<h2>更大伴宿祢家持贈坂上大嬢歌十五首</h2>
<p><a href="0741.html">夢の逢ひは苦しかりけりおどろきて掻き探れども手にも触れねば</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0742.html">一重のみ妹が結ばむ帯をすら三重結ぶべく我が身はなりぬ</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0743.html">我が恋は千引の石を七ばかり首に懸けむも神のまにまに</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0744.html">夕さらば屋戸開け設けて我れ待たむ夢に相見に来むといふ人を</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0745.html">朝夕に見む時さへや我妹子が見れど見ぬごとなほ恋しけむ</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0746.html">生ける世に我はいまだ見ず言絶えてかくおもしろく縫へる袋は</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0747.html">我妹子が形見の衣下に着て直に逢ふまでは我れ脱かめやも</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0748.html">恋ひ死なむそこも同じぞ何せむに人目人言言痛み我がせむ</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0749.html">夢にだに見えばこそあらめかくばかり見えずしあるは恋ひて死ねとか</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0750.html">思ひ絶えわびにしものを中々に何か苦しく相見そめけむ</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0751.html">相見ては幾日も経ぬをここだくもくるひにくるひ思ほゆるかも</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0752.html">かくばかり面影にのみ思ほえばいかにかもせむ人目繁くて</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0753.html">相見てはしましも恋はなぎむかと思へどいよよ恋ひまさりけり</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0754.html">夜のほどろ我が出でて来れば我妹子が思へりしくし面影に見ゆ</a></p>
<h2>（更大伴宿祢家持贈坂上大嬢歌十五首）</h2>
<p><a href="0755.html">夜のほどろ出でつつ来らくたび数多くなれば我が胸断ち焼くごとし</a></p>
<h2>大伴田村家之大嬢贈妹坂上大嬢歌四首</h2>
<p><a href="0756.html">外に居て恋ふれば苦し我妹子を継ぎて相見む事計りせよ</a></p>
<h2>（大伴田村家之大嬢贈妹坂上大嬢歌四首）</h2>
<p><a href="0757.html">遠くあらばわびてもあらむを里近くありと聞きつつ見ぬがすべなさ</a></p>
<h2>（大伴田村家之大嬢贈妹坂上大嬢歌四首）</h2>
<p><a href="0758.html">白雲のたなびく山の高々に我が思ふ妹を見むよしもがも</a></p>
<h2>（大伴田村家之大嬢贈妹坂上大嬢歌四首）</h2>
<p><a href="0759.html">いかならむ時にか妹を葎生の汚なきやどに入りいませてむ</a></p>
<h2>大伴坂上郎女従竹田庄&lt;贈&gt;女子大嬢歌二首</h2>
<p><a href="0760.html">うち渡す武田の原に鳴く鶴の間なく時なし我が恋ふらくは</a></p>
<h2>（大伴坂上郎女従竹田庄&lt;贈&gt;女子大嬢歌二首）</h2>
<p><a href="0761.html">早川の瀬に居る鳥のよしをなみ思ひてありし我が子はもあはれ</a></p>
<h2>紀女郎贈大伴宿祢家持歌二首  [女郎名曰小鹿也]</h2>
<p><a href="0762.html">神さぶといなにはあらずはたやはたかくして後に寂しけむかも</a></p>
<h2>（紀女郎贈大伴宿祢家持歌二首  [女郎名曰小鹿也]）</h2>
<p><a href="0763.html">玉の緒を沫緒に搓りて結べらばありて後にも逢はざらめやも</a></p>
<h2>（紀女郎贈大伴宿祢家持歌二首  [女郎名曰小鹿也]）大伴宿祢家持和歌一首</h2>
<p><a href="0764.html">百年に老舌出でてよよむとも我れはいとはじ恋ひは増すとも</a></p>
<h2>在久邇京思留寧樂宅坂上大嬢大伴宿祢家持作歌一首</h2>
<p><a href="0765.html">一重山へなれるものを月夜よみ門に出で立ち妹か待つらむ</a></p>
<h2>（在久邇京思留寧樂宅坂上大嬢大伴宿祢家持作歌一首）藤原郎女聞之即和歌一首</h2>
<p><a href="0766.html">道遠み来じとは知れるものからにしかぞ待つらむ君が目を欲り</a></p>
<h2>大伴宿祢家持更贈大嬢歌二首</h2>
<p><a href="0767.html">都路を遠みか妹がこのころはうけひて寝れど夢に見え来ぬ</a></p>
<h2>（大伴宿祢家持更贈大嬢歌二首）</h2>
<p><a href="0768.html">今知らす久迩の都に妹に逢はず久しくなりぬ行きて早見な</a></p>
<h2>大伴宿祢家持報贈紀女郎歌一首</h2>
<p><a href="0769.html">ひさかたの雨の降る日をただ独り山辺に居ればいぶせかりけり</a></p>
<h2>大伴宿祢家持従久邇京贈坂上大嬢歌五首</h2>
<p><a href="0770.html">人目多み逢はなくのみぞ心さへ妹を忘れて我が思はなくに</a></p>
<h2>（大伴宿祢家持従久邇京贈坂上大嬢歌五首）</h2>
<p><a href="0771.html">偽りも似つきてぞするうつしくもまこと我妹子我れに恋ひめや</a></p>
<h2>（大伴宿祢家持従久邇京贈坂上大嬢歌五首）</h2>
<p><a href="0772.html">夢にだに見えむと我れはほどけども相し思はねばうべ見えずあらむ</a></p>
<h2>（大伴宿祢家持従久邇京贈坂上大嬢歌五首）</h2>
<p><a href="0773.html">言とはぬ木すらあじさゐ諸弟らが練りのむらとにあざむかえけり</a></p>
<h2>（大伴宿祢家持従久邇京贈坂上大嬢歌五首）</h2>
<p><a href="0774.html">百千たび恋ふと言ふとも諸弟らが練りのことばは我れは頼まじ</a></p>
<h2>大伴宿祢家持贈紀女郎歌一首</h2>
<p><a href="0775.html">鶉鳴く古りにし里ゆ思へども何ぞも妹に逢ふよしもなき</a></p>
<h2>紀女郎報贈家持歌一首</h2>
<p><a href="0776.html">言出しは誰が言にあるか小山田の苗代水の中淀にして</a></p>
<h2>大伴宿祢家持更贈紀女郎歌五首</h2>
<p><a href="0777.html">我妹子がやどの籬を見に行かばけだし門より帰してむかも</a></p>
<h2>（大伴宿祢家持更贈紀女郎歌五首）</h2>
<p><a href="0778.html">うつたへに籬の姿見まく欲り行かむと言へや君を見にこそ</a></p>
<h2>（大伴宿祢家持更贈紀女郎歌五首）</h2>
<p><a href="0779.html">板葺の黒木の屋根は山近し明日の日取りて持ちて参ゐ来む</a></p>
<h2>（大伴宿祢家持更贈紀女郎歌五首）</h2>
<p><a href="0780.html">黒木取り草も刈りつつ仕へめどいそしきわけとほめむともあらず [一云仕ふとも]</a></p>
<h2>（大伴宿祢家持更贈紀女郎歌五首）</h2>
<p><a href="0781.html">ぬばたまの昨夜は帰しつ今夜さへ我れを帰すな道の長手を</a></p>
<h2>紀女郎Ｌ物贈友歌一首  [女郎名曰小鹿也]</h2>
<p><a href="0782.html">風高く辺には吹けども妹がため袖さへ濡れて刈れる玉藻ぞ</a></p>
<h2>大伴宿祢家持贈娘子歌三首</h2>
<p><a href="0783.html">をととしの先つ年より今年まで恋ふれどなぞも妹に逢ひかたき</a></p>
<h2>（大伴宿祢家持贈娘子歌三首）</h2>
<p><a href="0784.html">うつつにはさらにもえ言はず夢にだに妹が手本を卷き寝とし見ば</a></p>
<h2>（大伴宿祢家持贈娘子歌三首）</h2>
<p><a href="0785.html">我がやどの草の上白く置く露の身も惜しからず妹に逢はずあれば</a></p>
<h2>大伴宿祢家持報贈藤原朝臣久須麻呂歌三首</h2>
<p><a href="0786.html">春の雨はいやしき降るに梅の花いまだ咲かなくいと若みかも</a></p>
<h2>（大伴宿祢家持報贈藤原朝臣久須麻呂歌三首）</h2>
<p><a href="0787.html">夢のごと思ほゆるかもはしきやし君が使の数多く通へば</a></p>
<h2>（大伴宿祢家持報贈藤原朝臣久須麻呂歌三首）</h2>
<p><a href="0788.html">うら若み花咲きかたき梅を植ゑて人の言繁み思ひぞ我がする</a></p>
<h2>又家持贈藤原朝臣久須麻呂歌二首</h2>
<p><a href="0789.html">心ぐく思ほゆるかも春霞たなびく時に言の通へば</a></p>
<h2>（又家持贈藤原朝臣久須麻呂歌二首）</h2>
<p><a href="0790.html">春風の音にし出なばありさりて今ならずとも君がまにまに</a></p>
<h2>藤原朝臣久須麻呂来報歌二首</h2>
<p><a href="0791.html">奥山の岩蔭に生ふる菅の根のねもころ我れも相思はざれや</a></p>
<h2>（藤原朝臣久須麻呂来報歌二首）</h2>
<p><a href="0792.html">春雨を待つとにしあらし我がやどの若木の梅もいまだふふめり</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
