#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第八巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第八巻）</h1>

 <h2>春雜歌 / 志貴皇子懽御歌一首</h2>
<p><a href="1418.html">石走る垂水の上のさわらびの萌え出づる春になりにけるかも</a></p>
<h2>鏡王女歌一首</h2>
<p><a href="1419.html">神なびの石瀬の社の呼子鳥いたくな鳴きそ我が恋まさる</a></p>
<h2>駿河釆女歌一首</h2>
<p><a href="1420.html">沫雪かはだれに降ると見るまでに流らへ散るは何の花ぞも</a></p>
<h2>尾張連歌二首  [名闕]</h2>
<p><a href="1421.html">春山の咲きのををりに春菜摘む妹が白紐見らくしよしも</a></p>
<h2>（尾張連歌二首  [名闕]）</h2>
<p><a href="1422.html">うち靡く春来るらし山の際の遠き木末の咲きゆく見れば</a></p>
<h2>中納言阿倍廣庭卿歌一首</h2>
<p><a href="1423.html">去年の春いこじて植ゑし我がやどの若木の梅は花咲きにけり</a></p>
<h2>山部宿祢赤人歌四首</h2>
<p><a href="1424.html">春の野にすみれ摘みにと来し我れぞ野をなつかしみ一夜寝にける</a></p>
<h2>（山部宿祢赤人歌四首）</h2>
<p><a href="1425.html">あしひきの山桜花日並べてかく咲きたらばいたく恋ひめやも</a></p>
<h2>（山部宿祢赤人歌四首）</h2>
<p><a href="1426.html">我が背子に見せむと思ひし梅の花それとも見えず雪の降れれば</a></p>
<h2>（山部宿祢赤人歌四首）</h2>
<p><a href="1427.html">明日よりは春菜摘まむと標めし野に昨日も今日も雪は降りつつ</a></p>
<h2>草香山歌一首</h2>
<p><a href="1428.html">おしてる 難波を過ぎて うち靡く 草香の山を 夕暮れに 我が越え来れば 山も狭に 咲ける馬酔木の 悪しからぬ 君をいつしか 行きて早見む</a></p>
<h2>櫻花歌一首[并短歌]</h2>
<p><a href="1429.html">娘子らが かざしのために 風流士の かづらのためと 敷きませる 国のはたてに 咲きにける 桜の花の にほひはもあなに</a></p>
<h2>（櫻花歌一首[并短歌]）反歌</h2>
<p><a href="1430.html">去年の春逢へりし君に恋ひにてし桜の花は迎へけらしも</a></p>
<h2>山部宿祢赤人歌一首</h2>
<p><a href="1431.html">百済野の萩の古枝に春待つと居りし鴬鳴きにけむかも</a></p>
<h2>大伴坂上郎女柳歌二首</h2>
<p><a href="1432.html">我が背子が見らむ佐保道の青柳を手折りてだにも見むよしもがも</a></p>
<h2>（大伴坂上郎女柳歌二首）</h2>
<p><a href="1433.html">うち上る佐保の川原の青柳は今は春へとなりにけるかも</a></p>
<h2>大伴宿祢三林梅歌一首</h2>
<p><a href="1434.html">霜雪もいまだ過ぎねば思はぬに春日の里に梅の花見つ</a></p>
<h2>厚見王歌一首</h2>
<p><a href="1435.html">かはづ鳴く神奈備川に影見えて今か咲くらむ山吹の花</a></p>
<h2>大伴宿祢村上梅歌二首</h2>
<p><a href="1436.html">含めりと言ひし梅が枝今朝降りし沫雪にあひて咲きぬらむかも</a></p>
<h2>（大伴宿祢村上梅歌二首）</h2>
<p><a href="1437.html">霞立つ春日の里の梅の花山のあらしに散りこすなゆめ</a></p>
<h2>大伴宿祢駿河丸歌一首</h2>
<p><a href="1438.html">霞立つ春日の里の梅の花花に問はむと我が思はなくに</a></p>
<h2>中臣朝臣武良自歌一首</h2>
<p><a href="1439.html">時は今は春になりぬとみ雪降る遠山の辺に霞たなびく</a></p>
<h2>河邊朝臣東人歌一首</h2>
<p><a href="1440.html">春雨のしくしく降るに高円の山の桜はいかにかあるらむ</a></p>
<h2>大伴宿祢家持鴬歌一首</h2>
<p><a href="1441.html">うち霧らひ雪は降りつつしかすがに我家の苑に鴬鳴くも</a></p>
<h2>大蔵少輔丹比屋主真人歌一首</h2>
<p><a href="1442.html">難波辺に人の行ければ後れ居て春菜摘む子を見るが悲しさ</a></p>
<h2>丹比真人乙麻呂歌一首  [屋主真人之第二子也]</h2>
<p><a href="1443.html">霞立つ野の上の方に行きしかば鴬鳴きつ春になるらし</a></p>
<h2>高田女王歌一首  [高安之女也]</h2>
<p><a href="1444.html">山吹の咲きたる野辺のつほすみれこの春の雨に盛りなりけり</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="1445.html">風交り雪は降るとも実にならぬ我家の梅を花に散らすな</a></p>
<h2>大伴宿祢家持&lt;春&gt;雉歌一首</h2>
<p><a href="1446.html">春の野にあさる雉の妻恋ひにおのがあたりを人に知れつつ</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="1447.html">世の常に聞けば苦しき呼子鳥声なつかしき時にはなりぬ</a></p>
<h2>春相聞 / 大伴宿祢家持贈坂上家之大嬢歌一首</h2>
<p><a href="1448.html">我がやどに蒔きしなでしこいつしかも花に咲きなむなそへつつ見む</a></p>
<h2>大伴田村家&lt;之&gt;大嬢與妹坂上大嬢歌一首</h2>
<p><a href="1449.html">茅花抜く浅茅が原のつほすみれ今盛りなり我が恋ふらくは</a></p>
<h2>大伴宿祢坂上郎女歌一首</h2>
<p><a href="1450.html">心ぐきものにぞありける春霞たなびく時に恋の繁きは</a></p>
<h2>笠女郎贈大伴家持歌一首</h2>
<p><a href="1451.html">水鳥の鴨の羽色の春山のおほつかなくも思ほゆるかも</a></p>
<h2>紀女郎歌一首  [名曰小鹿也]</h2>
<p><a href="1452.html">闇ならばうべも来まさじ梅の花咲ける月夜に出でまさじとや</a></p>
<h2>天平五年癸酉春閏三月笠朝臣金村贈入唐使歌一首[并短歌]</h2>
<p><a href="1453.html">玉たすき 懸けぬ時なく 息の緒に 我が思ふ君は うつせみの 世の人なれば 大君の 命畏み 夕されば 鶴が妻呼ぶ 難波潟 御津の崎より 大船に 真楫しじ貫き 白波の 高き荒海を 島伝ひ い別れ行かば 留まれる 我れは幣引き 斎ひつつ 君をば待たむ 早帰りませ</a></p>
<h2>（天平五年癸酉春閏三月笠朝臣金村贈入唐使歌一首[并短歌]）反歌</h2>
<p><a href="1454.html">波の上ゆ見ゆる小島の雲隠りあな息づかし相別れなば</a></p>
<h2>（（天平五年癸酉春閏三月笠朝臣金村贈入唐使歌一首[并短歌]）反歌）</h2>
<p><a href="1455.html">たまきはる命に向ひ恋ひむゆは君が御船の楫柄にもが</a></p>
<h2>藤原朝臣廣嗣櫻花贈娘子歌一首</h2>
<p><a href="1456.html">この花の一節のうちに百種の言ぞ隠れるおほろかにすな</a></p>
<h2>娘子和歌一首</h2>
<p><a href="1457.html">この花の一節のうちは百種の言待ちかねて折らえけらずや</a></p>
<h2>厚見王贈久米女郎歌一首</h2>
<p><a href="1458.html">やどにある桜の花は今もかも松風早み地に散るらむ</a></p>
<h2>久米女郎報贈歌一首</h2>
<p><a href="1459.html">世間も常にしあらねばやどにある桜の花の散れるころかも</a></p>
<h2>紀女郎贈大伴宿祢家持歌二首</h2>
<p><a href="1460.html">戯奴 [變云 わけ] がため我が手もすまに春の野に抜ける茅花ぞ食して肥えませ</a></p>
<h2>（紀女郎贈大伴宿祢家持歌二首）</h2>
<p><a href="1461.html">昼は咲き夜は恋ひ寝る合歓木の花君のみ見めや戯奴さへに見よ</a></p>
<h2>大伴家持贈和歌二首</h2>
<p><a href="1462.html">我が君に戯奴は恋ふらし賜りたる茅花を食めどいや痩せに痩す</a></p>
<h2>（大伴家持贈和歌二首）</h2>
<p><a href="1463.html">我妹子が形見の合歓木は花のみに咲きてけだしく実にならじかも</a></p>
<h2>大伴家持贈坂上大嬢歌一首</h2>
<p><a href="1464.html">春霞たなびく山のへなれれば妹に逢はずて月ぞ経にける</a></p>
<h2>夏雜歌 / 藤原夫人歌&lt;一首&gt; [明日香清御原&lt;宮&gt;御宇天皇之夫人也  字曰大原大刀自  即新田部皇子之母也]</h2>
<p><a href="1465.html">霍公鳥いたくな鳴きそ汝が声を五月の玉にあへ貫くまでに</a></p>
<h2>志貴皇子御歌一首</h2>
<p><a href="1466.html">神奈備の石瀬の社の霍公鳥毛無の岡にいつか来鳴かむ</a></p>
<h2>弓削皇子御歌一首</h2>
<p><a href="1467.html">霍公鳥なかる国にも行きてしかその鳴く声を聞けば苦しも</a></p>
<h2>小治田廣瀬王霍公鳥歌一首</h2>
<p><a href="1468.html">霍公鳥声聞く小野の秋風に萩咲きぬれや声の乏しき</a></p>
<h2>沙弥霍公鳥歌一首</h2>
<p><a href="1469.html">あしひきの山霍公鳥汝が鳴けば家なる妹し常に偲はゆ</a></p>
<h2>刀理宣令歌一首</h2>
<p><a href="1470.html">もののふの石瀬の社の霍公鳥今も鳴かぬか山の常蔭に</a></p>
<h2>山部宿祢赤人歌一首</h2>
<p><a href="1471.html">恋しけば形見にせむと我がやどに植ゑし藤波今咲きにけり</a></p>
<h2>式部大輔石上堅魚朝臣歌一首</h2>
<p><a href="1472.html">霍公鳥来鳴き響もす卯の花の伴にや来しと問はましものを</a></p>
<h2>&lt;大&gt;宰帥大伴卿和歌一首</h2>
<p><a href="1473.html">橘の花散る里の霍公鳥片恋しつつ鳴く日しぞ多き</a></p>
<h2>大伴坂上郎女思筑紫大城山歌一首</h2>
<p><a href="1474.html">今もかも大城の山に霍公鳥鳴き響むらむ我れなけれども</a></p>
<h2>大伴坂上郎女霍公鳥歌一首</h2>
<p><a href="1475.html">何しかもここだく恋ふる霍公鳥鳴く声聞けば恋こそまされ</a></p>
<h2>小治田朝臣廣耳歌一首</h2>
<p><a href="1476.html">ひとり居て物思ふ宵に霍公鳥こゆ鳴き渡る心しあるらし</a></p>
<h2>大伴家持霍公鳥歌一首</h2>
<p><a href="1477.html">卯の花もいまだ咲かねば霍公鳥佐保の山辺に来鳴き響もす</a></p>
<h2>大伴家持橘歌一首</h2>
<p><a href="1478.html">我が宿の花橘のいつしかも玉に貫くべくその実なりなむ</a></p>
<h2>大伴家持晩蝉歌一首</h2>
<p><a href="1479.html">隠りのみ居ればいぶせみ慰むと出で立ち聞けば来鳴くひぐらし</a></p>
<h2>大伴書持歌二首</h2>
<p><a href="1480.html">我が宿に月おし照れり霍公鳥心あれ今夜来鳴き響もせ</a></p>
<h2>（大伴書持歌二首）</h2>
<p><a href="1481.html">我が宿の花橘に霍公鳥今こそ鳴かめ友に逢へる時</a></p>
<h2>大伴清縄歌一首</h2>
<p><a href="1482.html">皆人の待ちし卯の花散りぬとも鳴く霍公鳥我れ忘れめや</a></p>
<h2>奄君諸立歌一首</h2>
<p><a href="1483.html">我が背子が宿の橘花をよみ鳴く霍公鳥見にぞ我が来し</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="1484.html">霍公鳥いたくな鳴きそひとり居て寐の寝らえぬに聞けば苦しも</a></p>
<h2>大伴家持唐棣花歌一首</h2>
<p><a href="1485.html">夏まけて咲きたるはねずひさかたの雨うち降らば移ろひなむか</a></p>
<h2>大伴家持恨霍公鳥晩喧歌二首</h2>
<p><a href="1486.html">我が宿の花橘を霍公鳥来鳴かず地に散らしてむとか</a></p>
<h2>（大伴家持恨霍公鳥晩喧歌二首）</h2>
<p><a href="1487.html">霍公鳥思はずありき木の暗のかくなるまでに何か来鳴かぬ</a></p>
<h2>大伴家持懽霍公鳥歌一首</h2>
<p><a href="1488.html">いづくには鳴きもしにけむ霍公鳥我家の里に今日のみぞ鳴く</a></p>
<h2>大伴家持惜橘花歌一首</h2>
<p><a href="1489.html">我が宿の花橘は散り過ぎて玉に貫くべく実になりにけり</a></p>
<h2>大伴家持霍公鳥歌一首</h2>
<p><a href="1490.html">霍公鳥待てど来鳴かず菖蒲草玉に貫く日をいまだ遠みか</a></p>
<h2>大伴家持雨日聞霍公鳥喧歌一首</h2>
<p><a href="1491.html">卯の花の過ぎば惜しみか霍公鳥雨間も置かずこゆ鳴き渡る</a></p>
<h2>橘歌一首  [遊行女婦]</h2>
<p><a href="1492.html">君が家の花橘はなりにけり花のある時に逢はましものを</a></p>
<h2>大伴村上橘歌一首</h2>
<p><a href="1493.html">我が宿の花橘を霍公鳥来鳴き響めて本に散らしつ</a></p>
<h2>大伴家持霍公鳥歌二首</h2>
<p><a href="1494.html">夏山の木末の茂に霍公鳥鳴き響むなる声の遥けさ</a></p>
<h2>（大伴家持霍公鳥歌二首）</h2>
<p><a href="1495.html">あしひきの木の間立ち潜く霍公鳥かく聞きそめて後恋ひむかも</a></p>
<h2>大伴家持石竹花歌一首</h2>
<p><a href="1496.html">我が宿のなでしこの花盛りなり手折りて一目見せむ子もがも</a></p>
<h2>惜不登筑波山歌一首</h2>
<p><a href="1497.html">筑波嶺に我が行けりせば霍公鳥山彦響め鳴かましやそれ</a></p>
<h2>夏相聞 / 大伴坂上郎女歌一首</h2>
<p><a href="1498.html">暇なみ来まさぬ君に霍公鳥我れかく恋ふと行きて告げこそ</a></p>
<h2>大伴四縄宴吟歌一首</h2>
<p><a href="1499.html">言繁み君は来まさず霍公鳥汝れだに来鳴け朝戸開かむ</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="1500.html">夏の野の茂みに咲ける姫百合の知らえぬ恋は苦しきものぞ</a></p>
<h2>小治田朝臣廣耳歌一首</h2>
<p><a href="1501.html">霍公鳥鳴く峰の上の卯の花の憂きことあれや君が来まさぬ</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="1502.html">五月の花橘を君がため玉にこそ貫け散らまく惜しみ</a></p>
<h2>紀朝臣豊河歌一首</h2>
<p><a href="1503.html">我妹子が家の垣内のさ百合花ゆりと言へるはいなと言ふに似る</a></p>
<h2>高安歌一首</h2>
<p><a href="1504.html">暇なみ五月をすらに我妹子が花橘を見ずか過ぎなむ</a></p>
<h2>大神女郎贈大伴家持歌一首</h2>
<p><a href="1505.html">霍公鳥鳴きしすなはち君が家に行けと追ひしは至りけむかも</a></p>
<h2>大伴田村大嬢与妹坂上大嬢歌一首</h2>
<p><a href="1506.html">故郷の奈良思の岡の霍公鳥言告げ遣りしいかに告げきや</a></p>
<h2>大伴家持&lt;攀&gt;橘花贈坂上大嬢歌一首[并短歌]</h2>
<p><a href="1507.html">いかといかと ある我が宿に 百枝さし 生ふる橘 玉に貫く 五月を近み あえぬがに 花咲きにけり 朝に日に 出で見るごとに 息の緒に 我が思ふ妹に まそ鏡 清き月夜に ただ一目 見するまでには 散りこすな ゆめと言ひつつ ここだくも 我が守るものを うれたきや 醜霍公鳥 暁の うら悲しきに 追へど追へど なほし来鳴きて いたづらに 地に散らせば すべをなみ 攀ぢて手折りつ 見ませ我妹子</a></p>
<h2>（大伴家持&lt;攀&gt;橘花贈坂上大嬢歌一首[并短歌]）反歌</h2>
<p><a href="1508.html">望ぐたち清き月夜に我妹子に見せむと思ひしやどの橘</a></p>
<h2>（（大伴家持&lt;攀&gt;橘花贈坂上大嬢歌一首[并短歌]）反歌）</h2>
<p><a href="1509.html">妹が見て後も鳴かなむ霍公鳥花橘を地に散らしつ</a></p>
<h2>大伴家持贈紀女郎歌一首</h2>
<p><a href="1510.html">なでしこは咲きて散りぬと人は言へど我が標めし野の花にあらめやも</a></p>
<h2>秋雜歌 / 崗本天皇御製歌一首</h2>
<p><a href="1511.html">夕されば小倉の山に鳴く鹿は今夜は鳴かず寐ねにけらしも</a></p>
<h2>大津皇子御歌一首</h2>
<p><a href="1512.html">経もなく緯も定めず娘子らが織る黄葉に霜な降りそね</a></p>
<h2>穂積皇子御歌二首</h2>
<p><a href="1513.html">今朝の朝明雁が音聞きつ春日山もみちにけらし我が心痛し</a></p>
<h2>（穂積皇子御歌二首）</h2>
<p><a href="1514.html">秋萩は咲くべくあらし我がやどの浅茅が花の散りゆく見れば</a></p>
<h2>但馬皇女御歌一首  [一書云子部王作]</h2>
<p><a href="1515.html">言繁き里に住まずは今朝鳴きし雁にたぐひて行かましものを [一云 国にあらずは]</a></p>
<h2>山部王惜秋葉歌一首</h2>
<p><a href="1516.html">秋山にもみつ木の葉のうつりなばさらにや秋を見まく欲りせむ</a></p>
<h2>長屋王歌一首</h2>
<p><a href="1517.html">味酒三輪のはふりの山照らす秋の黄葉の散らまく惜しも</a></p>
<h2>山上&lt;臣&gt;憶良七夕歌十二首</h2>
<p><a href="1518.html">天の川相向き立ちて我が恋ひし君来ますなり紐解き設けな [一云 川に向ひて]</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1519.html">久方の天の川瀬に舟浮けて今夜か君が我がり来まさむ</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1520.html">彦星は 織女と 天地の 別れし時ゆ いなうしろ 川に向き立ち 思ふそら 安けなくに 嘆くそら 安けなくに 青波に 望みは絶えぬ 白雲に 涙は尽きぬ かくのみや 息づき居らむ かくのみや 恋ひつつあらむ さ丹塗りの 小舟もがも 玉巻きの 真櫂もがも [一云 小棹もがも] 朝なぎに い掻き渡り 夕潮に [一云 夕にも] い漕ぎ渡り 久方の 天の川原に 天飛ぶや 領巾片敷き 真玉手の 玉手さし交へ あまた夜も 寐ねてしかも [一云 寐もさ寝てしか] 秋にあらずとも [一云 秋待たずとも]</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）反歌</h2>
<p><a href="1521.html">風雲は二つの岸に通へども我が遠妻の [一云 愛し妻の] 言ぞ通はぬ</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1522.html">たぶてにも投げ越しつべき天の川隔てればかもあまたすべなき</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1523.html">秋風の吹きにし日よりいつしかと我が待ち恋ひし君ぞ来ませる</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1524.html">天の川いと川波は立たねどもさもらひかたし近きこの瀬を</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1525.html">袖振らば見も交しつべく近けども渡るすべなし秋にしあらねば</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1526.html">玉かぎるほのかに見えて別れなばもとなや恋ひむ逢ふ時までは</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1527.html">彦星の妻迎へ舟漕ぎ出らし天の川原に霧の立てるは</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1528.html">霞立つ天の川原に君待つとい行き帰るに裳の裾濡れぬ</a></p>
<h2>（山上&lt;臣&gt;憶良七夕歌十二首）</h2>
<p><a href="1529.html">天の川浮津の波音騒くなり我が待つ君し舟出すらしも</a></p>
<h2>大宰諸卿大夫并官人等宴筑前國蘆城驛家歌二首</h2>
<p><a href="1530.html">をみなへし秋萩交る蘆城の野今日を始めて万世に見む</a></p>
<h2>（大宰諸卿大夫并官人等宴筑前國蘆城驛家歌二首）</h2>
<p><a href="1531.html">玉櫛笥蘆城の川を今日見ては万代までに忘らえめやも</a></p>
<h2>笠朝臣金村伊香山作歌二首</h2>
<p><a href="1532.html">草枕旅行く人も行き触ればにほひぬべくも咲ける萩かも</a></p>
<h2>（笠朝臣金村伊香山作歌二首）</h2>
<p><a href="1533.html">伊香山野辺に咲きたる萩見れば君が家なる尾花し思ほゆ</a></p>
<h2>石川朝臣老夫歌一首</h2>
<p><a href="1534.html">をみなへし秋萩折れれ玉桙の道行きづとと乞はむ子がため</a></p>
<h2>藤原宇合卿歌一首</h2>
<p><a href="1535.html">我が背子をいつぞ今かと待つなへに面やは見えむ秋の風吹く</a></p>
<h2>縁達帥歌一首</h2>
<p><a href="1536.html">宵に逢ひて朝面なみ名張野の萩は散りにき黄葉早継げ</a></p>
<h2>山上&lt;臣&gt;憶良詠秋野花&lt;歌&gt;二首</h2>
<p><a href="1537.html">秋の野に咲きたる花を指折りかき数ふれば七種の花 [其一]</a></p>
<h2>（山上&lt;臣&gt;憶良詠秋野花&lt;歌&gt;二首）</h2>
<p><a href="1538.html">萩の花尾花葛花なでしこの花をみなへしまた藤袴朝顔の花 [其二]</a></p>
<h2>天皇御製歌二首</h2>
<p><a href="1539.html">秋の田の穂田を雁がね暗けくに夜のほどろにも鳴き渡るかも</a></p>
<h2>（天皇御製歌二首）</h2>
<p><a href="1540.html">今朝の朝明雁が音寒く聞きしなへ野辺の浅茅ぞ色づきにける</a></p>
<h2>大宰帥大伴卿歌二首</h2>
<p><a href="1541.html">我が岡にさを鹿来鳴く初萩の花妻どひに来鳴くさを鹿</a></p>
<h2>（大宰帥大伴卿歌二首）</h2>
<p><a href="1542.html">我が岡の秋萩の花風をいたみ散るべくなりぬ見む人もがも</a></p>
<h2>三原王歌一首</h2>
<p><a href="1543.html">秋の露は移しにありけり水鳥の青葉の山の色づく見れば</a></p>
<h2>湯原王七夕歌二首</h2>
<p><a href="1544.html">彦星の思ひますらむ心より見る我れ苦し夜の更けゆけば</a></p>
<h2>（湯原王七夕歌二首）</h2>
<p><a href="1545.html">織女の袖継ぐ宵の暁は川瀬の鶴は鳴かずともよし</a></p>
<h2>市原王七夕歌一首</h2>
<p><a href="1546.html">妹がりと我が行く道の川しあればつくめ結ぶと夜ぞ更けにける</a></p>
<h2>藤原朝臣八束歌一首</h2>
<p><a href="1547.html">さを鹿の萩に貫き置ける露の白玉あふさわに誰れの人かも手に巻かむちふ</a></p>
<h2>大伴坂上郎女晩芽子歌一首</h2>
<p><a href="1548.html">咲く花もをそろはいとはしおくてなる長き心になほしかずけり</a></p>
<h2>典鑄正紀朝臣鹿人至衛門大尉大伴宿祢稲公跡見庄作歌一首</h2>
<p><a href="1549.html">射目立てて跡見の岡辺のなでしこの花ふさ手折り我れは持ちて行く奈良人のため</a></p>
<h2>湯原王鳴鹿歌一首</h2>
<p><a href="1550.html">秋萩の散りの乱ひに呼びたてて鳴くなる鹿の声の遥けさ</a></p>
<h2>市原王歌一首</h2>
<p><a href="1551.html">時待ちて降れるしぐれの雨やみぬ明けむ朝か山のもみたむ</a></p>
<h2>湯原王蟋蟀歌一首</h2>
<p><a href="1552.html">夕月夜心もしのに白露の置くこの庭にこほろぎ鳴くも</a></p>
<h2>衛門大尉大伴宿祢稲公歌一首</h2>
<p><a href="1553.html">時雨の雨間なくし降れば御笠山木末あまねく色づきにけり</a></p>
<h2>大伴家持和歌一首</h2>
<p><a href="1554.html">大君の御笠の山の黄葉は今日の時雨に散りか過ぎなむ</a></p>
<h2>安貴王歌一首</h2>
<p><a href="1555.html">秋立ちて幾日もあらねばこの寝ぬる朝明の風は手本寒しも</a></p>
<h2>忌部首黒麻呂歌一首</h2>
<p><a href="1556.html">秋田刈る仮廬もいまだ壊たねば雁が音寒し霜も置きぬがに</a></p>
<h2>故郷豊浦寺之尼私房宴歌三首</h2>
<p><a href="1557.html">明日香川行き廻る岡の秋萩は今日降る雨に散りか過ぎなむ</a></p>
<h2>（故郷豊浦寺之尼私房宴歌三首）</h2>
<p><a href="1558.html">鶉鳴く古りにし里の秋萩を思ふ人どち相見つるかも</a></p>
<h2>（故郷豊浦寺之尼私房宴歌三首）</h2>
<p><a href="1559.html">秋萩は盛り過ぐるをいたづらにかざしに挿さず帰りなむとや</a></p>
<h2>大伴坂上郎女跡見田庄作歌二首</h2>
<p><a href="1560.html">妹が目を始見の崎の秋萩はこの月ごろは散りこすなゆめ</a></p>
<h2>（大伴坂上郎女跡見田庄作歌二首）</h2>
<p><a href="1561.html">吉隠の猪養の山に伏す鹿の妻呼ぶ声を聞くが羨しさ</a></p>
<h2>巫部麻蘇娘子鴈歌一首</h2>
<p><a href="1562.html">誰れ聞きつこゆ鳴き渡る雁がねの妻呼ぶ声の羨しくもあるか</a></p>
<h2>大伴家持和歌一首</h2>
<p><a href="1563.html">聞きつやと妹が問はせる雁が音はまことも遠く雲隠るなり</a></p>
<h2>&lt;日&gt;置長枝娘子歌一首</h2>
<p><a href="1564.html">秋づけば尾花が上に置く露の消ぬべくも我は思ほゆるかも</a></p>
<h2>大伴家持和歌一首</h2>
<p><a href="1565.html">我が宿の一群萩を思ふ子に見せずほとほと散らしつるかも</a></p>
<h2>大伴家持秋歌四首</h2>
<p><a href="1566.html">久方の雨間も置かず雲隠り鳴きぞ行くなる早稲田雁がね</a></p>
<h2>（大伴家持秋歌四首）</h2>
<p><a href="1567.html">雲隠り鳴くなる雁の行きて居む秋田の穂立繁くし思ほゆ</a></p>
<h2>（大伴家持秋歌四首）</h2>
<p><a href="1568.html">雨隠り心いぶせみ出で見れば春日の山は色づきにけり</a></p>
<h2>（大伴家持秋歌四首）</h2>
<p><a href="1569.html">雨晴れて清く照りたるこの月夜またさらにして雲なたなびき</a></p>
<h2>藤原朝臣八束歌二首</h2>
<p><a href="1570.html">ここにありて春日やいづち雨障み出でて行かねば恋ひつつぞ居る</a></p>
<h2>（藤原朝臣八束歌二首）</h2>
<p><a href="1571.html">春日野に時雨降る見ゆ明日よりは黄葉かざさむ高円の山</a></p>
<h2>大伴家持白露歌一首</h2>
<p><a href="1572.html">我が宿の尾花が上の白露を消たずて玉に貫くものにもが</a></p>
<h2>大伴利上歌一首</h2>
<p><a href="1573.html">秋の雨に濡れつつ居ればいやしけど我妹が宿し思ほゆるかも</a></p>
<h2>右大臣橘家宴歌七首</h2>
<p><a href="1574.html">雲の上に鳴くなる雁の遠けども君に逢はむとた廻り来つ</a></p>
<h2>（右大臣橘家宴歌七首）</h2>
<p><a href="1575.html">雲の上に鳴きつる雁の寒きなへ萩の下葉はもみちぬるかも</a></p>
<h2>（右大臣橘家宴歌七首）</h2>
<p><a href="1576.html">この岡に小鹿踏み起しうかねらひかもかもすらく君故にこそ</a></p>
<h2>（右大臣橘家宴歌七首）</h2>
<p><a href="1577.html">秋の野の尾花が末を押しなべて来しくもしるく逢へる君かも</a></p>
<h2>（右大臣橘家宴歌七首）</h2>
<p><a href="1578.html">今朝鳴きて行きし雁が音寒みかもこの野の浅茅色づきにける</a></p>
<h2>（右大臣橘家宴歌七首）</h2>
<p><a href="1579.html">朝戸開けて物思ふ時に白露の置ける秋萩見えつつもとな</a></p>
<h2>（右大臣橘家宴歌七首）</h2>
<p><a href="1580.html">さを鹿の来立ち鳴く野の秋萩は露霜負ひて散りにしものを</a></p>
<h2>橘朝臣奈良麻呂結集宴歌十一首</h2>
<p><a href="1581.html">手折らずて散りなば惜しと我が思ひし秋の黄葉をかざしつるかも</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1582.html">めづらしき人に見せむと黄葉を手折りぞ我が来し雨の降らくに</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1583.html">黄葉を散らす時雨に濡れて来て君が黄葉をかざしつるかも</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1584.html">めづらしと我が思ふ君は秋山の初黄葉に似てこそありけれ</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1585.html">奈良山の嶺の黄葉取れば散る時雨の雨し間なく降るらし</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1586.html">黄葉を散らまく惜しみ手折り来て今夜かざしつ何か思はむ</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1587.html">あしひきの山の黄葉今夜もか浮かび行くらむ山川の瀬に</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1588.html">奈良山をにほはす黄葉手折り来て今夜かざしつ散らば散るとも</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1589.html">露霜にあへる黄葉を手折り来て妹とかざしつ後は散るとも</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1590.html">十月時雨にあへる黄葉の吹かば散りなむ風のまにまに</a></p>
<h2>（橘朝臣奈良麻呂結集宴歌十一首）</h2>
<p><a href="1591.html">黄葉の過ぎまく惜しみ思ふどち遊ぶ今夜は明けずもあらぬか</a></p>
<h2>大伴坂上郎女竹田庄作歌二首</h2>
<p><a href="1592.html">しかとあらぬ五百代小田を刈り乱り田廬に居れば都し思ほゆ</a></p>
<h2>（大伴坂上郎女竹田庄作歌二首）</h2>
<p><a href="1593.html">隠口の泊瀬の山は色づきぬ時雨の雨は降りにけらしも</a></p>
<h2>佛前唱歌一首</h2>
<p><a href="1594.html">時雨の雨間なくな降りそ紅ににほへる山の散らまく惜しも</a></p>
<h2>大伴宿祢像見歌一首</h2>
<p><a href="1595.html">秋萩の枝もとををに置く露の消なば消ぬとも色に出でめやも</a></p>
<h2>大伴宿祢家持到娘子門作歌一首</h2>
<p><a href="1596.html">妹が家の門田を見むとうち出で来し心もしるく照る月夜かも</a></p>
<h2>大伴宿祢家持秋歌三首</h2>
<p><a href="1597.html">秋の野に咲ける秋萩秋風に靡ける上に秋の露置けり</a></p>
<h2>（大伴宿祢家持秋歌三首）</h2>
<p><a href="1598.html">さを鹿の朝立つ野辺の秋萩に玉と見るまで置ける白露</a></p>
<h2>（大伴宿祢家持秋歌三首）</h2>
<p><a href="1599.html">さを鹿の胸別けにかも秋萩の散り過ぎにける盛りかも去ぬる</a></p>
<h2>内舎人石川朝臣廣成歌二首</h2>
<p><a href="1600.html">妻恋ひに鹿鳴く山辺の秋萩は露霜寒み盛り過ぎゆく</a></p>
<h2>（内舎人石川朝臣廣成歌二首）</h2>
<p><a href="1601.html">めづらしき君が家なる花すすき穂に出づる秋の過ぐらく惜しも</a></p>
<h2>大伴宿祢家持鹿鳴歌二首</h2>
<p><a href="1602.html">山彦の相響むまで妻恋ひに鹿鳴く山辺に独りのみして</a></p>
<h2>（大伴宿祢家持鹿鳴歌二首）</h2>
<p><a href="1603.html">このころの朝明に聞けばあしひきの山呼び響めさを鹿鳴くも</a></p>
<h2>大原真人今城傷惜寧樂故郷歌一首</h2>
<p><a href="1604.html">秋されば春日の山の黄葉見る奈良の都の荒るらく惜しも</a></p>
<h2>大伴宿祢家持歌一首</h2>
<p><a href="1605.html">高円の野辺の秋萩このころの暁露に咲きにけむかも</a></p>
<h2>秋相聞 / 額田王思近江天皇作歌一首</h2>
<p><a href="1606.html">君待つと我が恋ひをれば我が宿の簾動かし秋の風吹く</a></p>
<h2>鏡王女作歌一首</h2>
<p><a href="1607.html">風をだに恋ふるは羨し風をだに来むとし待たば何か嘆かむ</a></p>
<h2>弓削皇子御歌一首</h2>
<p><a href="1608.html">秋萩の上に置きたる白露の消かもしなまし恋ひつつあらずは</a></p>
<h2>丹比真人歌一首  [名闕]</h2>
<p><a href="1609.html">宇陀の野の秋萩しのぎ鳴く鹿も妻に恋ふらく我れにはまさじ</a></p>
<h2>丹生女王贈大宰帥大伴卿歌一首</h2>
<p><a href="1610.html">高円の秋野の上のなでしこの花うら若み人のかざししなでしこの花</a></p>
<h2>笠縫女王歌一首  [六人部王之女母曰田形皇女也]</h2>
<p><a href="1611.html">あしひきの山下響め鳴く鹿の言ともしかも我が心夫</a></p>
<h2>石川賀係女郎歌一首</h2>
<p><a href="1612.html">神さぶといなにはあらず秋草の結びし紐を解くは悲しも</a></p>
<h2>賀茂女王歌一首  [長屋王之女母曰阿倍朝臣也]</h2>
<p><a href="1613.html">秋の野を朝行く鹿の跡もなく思ひし君に逢へる今夜か</a></p>
<h2>遠江守櫻井王奉天皇歌一首</h2>
<p><a href="1614.html">九月のその初雁の使にも思ふ心は聞こえ来ぬかも</a></p>
<h2>天皇賜報和御歌一首</h2>
<p><a href="1615.html">大の浦のその長浜に寄する波ゆたけく君を思ふこのころ [大浦者遠江國之海濱名也]</a></p>
<h2>笠女郎&lt;贈&gt;大伴宿祢家持歌一首</h2>
<p><a href="1616.html">朝ごとに我が見る宿のなでしこの花にも君はありこせぬかも</a></p>
<h2>山口女王&lt;贈&gt;大伴宿祢家持歌一首</h2>
<p><a href="1617.html">秋萩に置きたる露の風吹きて落つる涙は留めかねつも</a></p>
<h2>湯原王&lt;贈&gt;娘子歌一首</h2>
<p><a href="1618.html">玉に貫き消たず賜らむ秋萩の末わくらばに置ける白露</a></p>
<h2>大伴家持至姑坂上郎女竹田庄作歌一首</h2>
<p><a href="1619.html">玉桙の道は遠けどはしきやし妹を相見に出でてぞ我が来し</a></p>
<h2>大伴坂上郎女和歌一首</h2>
<p><a href="1620.html">あらたまの月立つまでに来まさねば夢にし見つつ思ひぞ我がせし</a></p>
<h2>巫部麻蘇娘子歌一首</h2>
<p><a href="1621.html">我が宿の萩花咲けり見に来ませいま二日だみあらば散りなむ</a></p>
<h2>大伴田村大嬢与&lt;妹&gt;坂上大嬢歌二首</h2>
<p><a href="1622.html">我が宿の秋の萩咲く夕影に今も見てしか妹が姿を</a></p>
<h2>（大伴田村大嬢与&lt;妹&gt;坂上大嬢歌二首）</h2>
<p><a href="1623.html">我が宿にもみつ蝦手見るごとに妹を懸けつつ恋ひぬ日はなし</a></p>
<h2>坂上大娘秋稲蘰贈大伴宿祢家持歌一首</h2>
<p><a href="1624.html">我が蒔ける早稲田の穂立作りたるかづらぞ見つつ偲はせ我が背</a></p>
<h2>大伴宿祢家持報贈歌一首</h2>
<p><a href="1625.html">我妹子が業と作れる秋の田の早稲穂のかづら見れど飽かぬかも</a></p>
<h2>&lt;又&gt;報脱著身衣贈家持歌一首</h2>
<p><a href="1626.html">秋風の寒きこのころ下に着む妹が形見とかつも偲はむ</a></p>
<h2>大伴宿祢家持&lt;攀&gt;非時藤花并芽子黄葉二物贈坂上大嬢歌二首</h2>
<p><a href="1627.html">我が宿の時じき藤のめづらしく今も見てしか妹が笑まひを</a></p>
<h2>（大伴宿祢家持&lt;攀&gt;非時藤花并芽子黄葉二物贈坂上大嬢歌二首）</h2>
<p><a href="1628.html">我が宿の萩の下葉は秋風もいまだ吹かねばかくぞもみてる</a></p>
<h2>大伴宿祢家持贈坂上大嬢歌一首[并短歌]</h2>
<p><a href="1629.html">ねもころに 物を思へば 言はむすべ 為むすべもなし 妹と我れと 手携さはりて 朝には 庭に出で立ち 夕には 床うち掃ひ 白栲の 袖さし交へて さ寝し夜や 常にありける あしひきの 山鳥こそば 峰向ひに 妻問ひすといへ うつせみの 人なる我れや 何すとか 一日一夜も 離り居て 嘆き恋ふらむ ここ思へば 胸こそ痛き そこ故に 心なぐやと 高円の 山にも野にも うち行きて 遊び歩けど 花のみ にほひてあれば 見るごとに まして偲はゆ いかにして 忘れむものぞ 恋といふものを</a></p>
<h2>（大伴宿祢家持贈坂上大嬢歌一首[并短歌]）反歌</h2>
<p><a href="1630.html">高円の野辺のかほ花面影に見えつつ妹は忘れかねつも</a></p>
<h2>大伴宿祢家持贈安倍女郎歌一首</h2>
<p><a href="1631.html">今造る久迩の都に秋の夜の長きにひとり寝るが苦しさ</a></p>
<h2>大伴宿祢家持従久邇京贈留寧樂宅坂上大娘歌一首</h2>
<p><a href="1632.html">あしひきの山辺に居りて秋風の日に異に吹けば妹をしぞ思ふ</a></p>
<h2>或者贈尼歌二首</h2>
<p><a href="1633.html">手もすまに植ゑし萩にやかへりては見れども飽かず心尽さむ</a></p>
<h2>（或者贈尼歌二首）</h2>
<p><a href="1634.html">衣手に水渋付くまで植ゑし田を引板我が延へまもれる苦し</a></p>
<h2>尼作頭句并大伴宿祢家持所誂尼續末句等和歌一首</h2>
<p><a href="1635.html">佐保川の水を堰き上げて植ゑし田を [尼作] 刈れる初飯はひとりなるべし [家持續]</a></p>
<h2>冬雜歌 / 舎人娘子雪歌一首</h2>
<p><a href="1636.html">大口の真神の原に降る雪はいたくな降りそ家もあらなくに</a></p>
<h2>太上天皇御製歌一首</h2>
<p><a href="1637.html">はだすすき尾花逆葺き黒木もち造れる室は万代までに</a></p>
<h2>天皇御製歌一首</h2>
<p><a href="1638.html">あをによし奈良の山なる黒木もち造れる室は座せど飽かぬかも</a></p>
<h2>&lt;大&gt;宰帥大伴卿冬日見雪憶京歌一首</h2>
<p><a href="1639.html">沫雪のほどろほどろに降りしけば奈良の都し思ほゆるかも</a></p>
<h2>&lt;大&gt;宰帥大伴卿梅歌一首</h2>
<p><a href="1640.html">我が岡に盛りに咲ける梅の花残れる雪をまがへつるかも</a></p>
<h2>角朝臣廣辨雪梅歌&lt;一首&gt;</h2>
<p><a href="1641.html">沫雪に降らえて咲ける梅の花君がり遣らばよそへてむかも</a></p>
<h2>安倍朝臣奥道雪歌一首</h2>
<p><a href="1642.html">たな霧らひ雪も降らぬか梅の花咲かぬが代にそへてだに見む</a></p>
<h2>若櫻部朝臣君足雪歌一首</h2>
<p><a href="1643.html">天霧らし雪も降らぬかいちしろくこのいつ柴に降らまくを見む</a></p>
<h2>三野連石守梅歌一首</h2>
<p><a href="1644.html">引き攀ぢて折らば散るべみ梅の花袖に扱入れつ染まば染むとも</a></p>
<h2>巨勢朝臣宿奈麻呂雪歌一首</h2>
<p><a href="1645.html">我が宿の冬木の上に降る雪を梅の花かとうち見つるかも</a></p>
<h2>小治田朝臣東麻呂雪歌一首</h2>
<p><a href="1646.html">ぬばたまの今夜の雪にいざ濡れな明けむ朝に消なば惜しけむ</a></p>
<h2>忌部首黒麻呂雪歌一首</h2>
<p><a href="1647.html">梅の花枝にか散ると見るまでに風に乱れて雪ぞ降り来る</a></p>
<h2>紀少鹿女郎梅歌一首</h2>
<p><a href="1648.html">十二月には沫雪降ると知らねかも梅の花咲くふふめらずして</a></p>
<h2>大伴宿祢家持雪梅歌一首</h2>
<p><a href="1649.html">今日降りし雪に競ひて我が宿の冬木の梅は花咲きにけり</a></p>
<h2>御在西池邊肆宴歌一首</h2>
<p><a href="1650.html">池の辺の松の末葉に降る雪は五百重降りしけ明日さへも見む</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="1651.html">沫雪のこのころ継ぎてかく降らば梅の初花散りか過ぎなむ</a></p>
<h2>他田廣津娘子梅歌一首</h2>
<p><a href="1652.html">梅の花折りも折らずも見つれども今夜の花になほしかずけり</a></p>
<h2>縣犬養娘子依梅發思歌一首</h2>
<p><a href="1653.html">今のごと心を常に思へらばまづ咲く花の地に落ちめやも</a></p>
<h2>大伴坂上郎女雪歌一首</h2>
<p><a href="1654.html">松蔭の浅茅の上の白雪を消たずて置かむことはかもなき</a></p>
<h2>冬相聞 / 三國真人人足歌一首</h2>
<p><a href="1655.html">高山の菅の葉しのぎ降る雪の消ぬと言ふべくも恋の繁けく</a></p>
<h2>大伴坂上郎女歌一首</h2>
<p><a href="1656.html">酒杯に梅の花浮かべ思ふどち飲みての後は散りぬともよし</a></p>
<h2>和歌一首</h2>
<p><a href="1657.html">官にも許したまへり今夜のみ飲まむ酒かも散りこすなゆめ</a></p>
<h2>藤&lt;皇&gt;后奉天皇御歌一首</h2>
<p><a href="1658.html">我が背子とふたり見ませばいくばくかこの降る雪の嬉しくあらまし</a></p>
<h2>他田廣津娘子歌一首</h2>
<p><a href="1659.html">真木の上に降り置ける雪のしくしくも思ほゆるかもさ夜問へ我が背</a></p>
<h2>大伴宿祢駿河麻呂歌一首</h2>
<p><a href="1660.html">梅の花散らすあらしの音のみに聞きし我妹を見らくしよしも</a></p>
<h2>紀少鹿女郎歌一首</h2>
<p><a href="1661.html">久方の月夜を清み梅の花心開けて我が思へる君</a></p>
<h2>大伴田村大娘与妹坂上大娘歌一首</h2>
<p><a href="1662.html">沫雪の消ぬべきものを今までに流らへぬるは妹に逢はむとぞ</a></p>
<h2>大伴宿祢家持歌一首</h2>
<p><a href="1663.html">沫雪の庭に降り敷き寒き夜を手枕まかずひとりかも寝む</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
