#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第十二巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第十二巻）</h1>

 <h2>正述心緒</h2>
<p><a href="2841.html">我が背子が朝明の姿よく見ずて今日の間を恋ひ暮らすかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2842.html">我が心ともしみ思ふ新夜の一夜もおちず夢に見えこそ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2843.html">愛しと我が思ふ妹を人皆の行くごと見めや手にまかずして</a></p>
<h2>（正述心緒）</h2>
<p><a href="2844.html">このころの寐の寝らえぬは敷栲の手枕まきて寝まく欲りこそ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2845.html">忘るやと物語りして心遣り過ぐせど過ぎずなほ恋ひにけり</a></p>
<h2>（正述心緒）</h2>
<p><a href="2846.html">夜も寝ず安くもあらず白栲の衣は脱かじ直に逢ふまでに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2847.html">後も逢はむ我にな恋ひそと妹は言へど恋ふる間に年は経につつ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2848.html">直に会はずあるはうべなり夢にだに何しか人の言の繁けむ [或本歌曰 うつつにはうべも逢はなく夢にさへ] </a></p>
<h2>（正述心緒）</h2>
<p><a href="2849.html">ぬばたまのその夢にだに見え継ぐや袖干る日なく我れは恋ふるを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2850.html">うつつには直には逢はず夢にだに逢ふと見えこそ我が恋ふらくに</a></p>
<h2>寄物陳思</h2>
<p><a href="2851.html">人の見る上は結びて人の見ぬ下紐開けて恋ふる日ぞ多き</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2852.html">人言の繁き時には我妹子し衣にありせば下に着ましを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2853.html">真玉つくをちをし兼ねて思へこそ一重の衣ひとり着て寝れ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2854.html">白栲の我が紐の緒の絶えぬ間に恋結びせむ逢はむ日までに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2855.html">新治の今作る道さやかにも聞きてけるかも妹が上のことを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2856.html">山背の石田の社に心おそく手向けしたれや妹に逢ひかたき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2857.html">菅の根のねもころごろに照る日にも干めや我が袖妹に逢はずして</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2858.html">妹に恋ひ寐ねぬ朝明に吹く風は妹にし触れば我れさへに触れ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2859.html">明日香川高川避かし越ゑ来しをまこと今夜は明けずも行かぬか</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2860.html">八釣川水底絶えず行く水の継ぎてぞ恋ふるこの年ころを [或本歌曰 水脈も絶えせず] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2861.html">礒の上に生ふる小松の名を惜しみ人に知らえず恋ひわたるかも</a></p>
<h2>（寄物陳思）或本歌曰</h2>
<p><a href="2861S.html">岩の上に立てる小松の名を惜しみ人には言はず恋ひわたるかも </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2862.html">山川の水陰に生ふる山菅のやまずも妹は思ほゆるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2863.html">浅葉野に立ち神さぶる菅の根のねもころ誰がゆゑ我が恋ひなくに [或本歌曰 誰が葉野に立ちしなひたる] </a></p>
<h2>正述心緒</h2>
<p><a href="2864.html">我が背子を今か今かと待ち居るに夜の更けゆけば嘆きつるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2865.html">玉釧まき寝る妹もあらばこそ夜の長けくも嬉しくあるべき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2866.html">人妻に言ふは誰が言さ衣のこの紐解けと言ふは誰が言</a></p>
<h2>（正述心緒）</h2>
<p><a href="2867.html">かくばかり恋ひむものぞと知らませばその夜はゆたにあらましものを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2868.html">恋ひつつも後も逢はむと思へこそおのが命を長く欲りすれ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2869.html">今は我は死なむよ我妹逢はずして思ひわたれば安けくもなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2870.html">我が背子が来むと語りし夜は過ぎぬしゑやさらさらしこり来めやも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2871.html">人言の讒しを聞きて玉桙の道にも逢はじと言へりし我妹</a></p>
<h2>（正述心緒）</h2>
<p><a href="2872.html">逢はなくも憂しと思へばいや増しに人言繁く聞こえ来るかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2873.html">里人も語り継ぐがねよしゑやし恋ひても死なむ誰が名ならめや</a></p>
<h2>（正述心緒）</h2>
<p><a href="2874.html">確かなる使をなみと心をぞ使に遣りし夢に見えきや</a></p>
<h2>（正述心緒）</h2>
<p><a href="2875.html">天地に少し至らぬ大夫と思ひし我れや雄心もなき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2876.html">里近く家や居るべきこの我が目の人目をしつつ恋の繁けく</a></p>
<h2>（正述心緒）</h2>
<p><a href="2877.html">いつはなも恋ひずありとはあらねどもうたてこのころ恋し繁しも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2878.html">ぬばたまの寐ねてし宵の物思ひに裂けにし胸はやむ時もなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2879.html">み空行く名の惜しけくも我れはなし逢はぬ日まねく年の経ぬれば</a></p>
<h2>（正述心緒）</h2>
<p><a href="2880.html">うつつにも今も見てしか夢のみに手本まき寝と見るは苦しも [或本歌發<句>曰 我妹子を] </a></p>
<h2>（正述心緒）</h2>
<p><a href="2881.html">立ちて居てすべのたどきも今はなし妹に逢はずて月の経ぬれば [或本歌曰 君が目見ずて月の経ぬれば] </a></p>
<h2>（正述心緒）</h2>
<p><a href="2882.html">逢はずして恋ひわたるとも忘れめやいや日に異には思ひ増すとも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2883.html">外目にも君が姿を見てばこそ我が恋やまめ命死なずは [一云 命に向ふ我が恋やまめ] </a></p>
<h2>（正述心緒）</h2>
<p><a href="2884.html">恋ひつつも今日はあらめど玉櫛笥明けなむ明日をいかに暮らさむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2885.html">さ夜更けて妹を思ひ出で敷栲の枕もそよに嘆きつるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2886.html">人言はまこと言痛くなりぬともそこに障らむ我れにあらなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2887.html">立ちて居てたどきも知らず我が心天つ空なり地は踏めども</a></p>
<h2>（正述心緒）</h2>
<p><a href="2888.html">世の中の人のことばと思ほすなまことぞ恋ひし逢はぬ日を多み</a></p>
<h2>（正述心緒）</h2>
<p><a href="2889.html">いで如何に我がここだ恋ふる我妹子が逢はじと言へることもあらなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2890.html">ぬばたまの夜を長みかも我が背子が夢に夢にし見えかへるらむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2891.html">あらたまの年の緒長くかく恋ひばまこと我が命全くあらめやも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2892.html">思ひ遣るすべのたどきも我れはなし逢はずてまねく月の経ぬれば</a></p>
<h2>（正述心緒）</h2>
<p><a href="2893.html">朝去にて夕は来ます君ゆゑにゆゆしくも我は嘆きつるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2894.html">聞きしより物を思へば我が胸は破れて砕けて利心もなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2895.html">人言を繁み言痛み我妹子に去にし月よりいまだ逢はぬかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2896.html">うたがたも言ひつつもあるか我れならば地には落ちず空に消なまし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2897.html">いかならむ日の時にかも我妹子が裳引きの姿朝に日に見む</a></p>
<h2>（正述心緒）</h2>
<p><a href="2898.html">ひとり居て恋ふるは苦し玉たすき懸けず忘れむ事計りもが</a></p>
<h2>（正述心緒）</h2>
<p><a href="2899.html">なかなかに黙もあらましをあづきなく相見そめても我れは恋ふるか</a></p>
<h2>（正述心緒）</h2>
<p><a href="2900.html">我妹子が笑まひ眉引き面影にかかりてもとな思ほゆるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2901.html">あかねさす日の暮れゆけばすべをなみ千たび嘆きて恋ひつつぞ居る</a></p>
<h2>（正述心緒）</h2>
<p><a href="2902.html">我が恋は夜昼わかず百重なす心し思へばいたもすべなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2903.html">いとのきて薄き眉根をいたづらに掻かしめつつも逢はぬ人かも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2904.html">恋ひ恋ひて後も逢はむと慰もる心しなくは生きてあらめやも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2905.html">いくばくも生けらじ命を恋ひつつぞ我れは息づく人に知らえず</a></p>
<h2>（正述心緒）</h2>
<p><a href="2906.html">他国によばひに行きて大刀が緒もいまだ解かねばさ夜ぞ明けにける</a></p>
<h2>（正述心緒）</h2>
<p><a href="2907.html">ますらをの聡き心も今はなし恋の奴に我れは死ぬべし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2908.html">常かくし恋ふれば苦ししましくも心休めむ事計りせよ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2909.html">おほろかに我れし思はば人妻にありといふ妹に恋ひつつあらめや</a></p>
<h2>（正述心緒）</h2>
<p><a href="2910.html">心には千重に百重に思へれど人目を多み妹に逢はぬかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2911.html">人目多み目こそ忍ぶれすくなくも心のうちに我が思はなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2912.html">人の見て言とがめせぬ夢に我れ今夜至らむ宿閉すなゆめ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2913.html">いつまでに生かむ命ぞおほかたは恋ひつつあらずは死なましものを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2914.html">愛しと思ふ我妹を夢に見て起きて探るになきが寂しさ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2915.html">妹と言はばなめし畏ししかすがに懸けまく欲しき言にあるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2916.html">玉かつま逢はむと言ふは誰れなるか逢へる時さへ面隠しする</a></p>
<h2>（正述心緒）</h2>
<p><a href="2917.html">うつつにか妹が来ませる夢にかも我れか惑へる恋の繁きに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2918.html">おほかたは何かも恋ひむ言挙げせず妹に寄り寝む年は近きを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2919.html">ふたりして結びし紐をひとりして我れは解きみじ直に逢ふまでは</a></p>
<h2>（正述心緒）</h2>
<p><a href="2920.html">終へむ命ここは思はずただしくも妹に逢はざることをしぞ思ふ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2921.html">たわや女は同じ心にしましくもやむ時もなく見てむとぞ思ふ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2922.html">夕さらば君に逢はむと思へこそ日の暮るらくも嬉しくありけれ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2923.html">ただ今日も君には逢はめど人言を繁み逢はずて恋ひわたるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2924.html">世の中に恋繁けむと思はねば君が手本をまかぬ夜もありき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2925.html">みどり子のためこそ乳母は求むと言へ乳飲めや君が乳母求むらむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2926.html">悔しくも老いにけるかも我が背子が求むる乳母に行かましものを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2927.html">うらぶれて離れにし袖をまたまかば過ぎにし恋い乱れ来むかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2928.html">おのがじし人死にすらし妹に恋ひ日に異に痩せぬ人に知らえず</a></p>
<h2>（正述心緒）</h2>
<p><a href="2929.html">宵々に我が立ち待つにけだしくも君来まさずは苦しかるべし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2930.html">生ける世に恋といふものを相見ねば恋のうちにも我れぞ苦しき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2931.html">思ひつつ居れば苦しもぬばたまの夜に至らば我れこそ行かめ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2932.html">心には燃えて思へどうつせみの人目を繁み妹に逢はぬかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2933.html">相思はず君はまさめど片恋に我れはぞ恋ふる君が姿に</a></p>
<h2>（正述心緒）</h2>
<p><a href="2934.html">あぢさはふ目は飽かざらねたづさはり言とはなくも苦しくありけり</a></p>
<h2>（正述心緒）</h2>
<p><a href="2935.html">あらたまの年の緒長くいつまでか我が恋ひ居らむ命知らずて</a></p>
<h2>（正述心緒）</h2>
<p><a href="2936.html">今は我は死なむよ我が背恋すれば一夜一日も安けくもなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2937.html">白栲の袖折り返し恋ふればか妹が姿の夢にし見ゆる</a></p>
<h2>（正述心緒）</h2>
<p><a href="2938.html">人言を繁み言痛み我が背子を目には見れども逢ふよしもなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2939.html">恋と言へば薄きことなりしかれども我れは忘れじ恋ひは死ぬとも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2940.html">なかなかに死なば安けむ出づる日の入る別知らぬ我れし苦しも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2941.html">思ひ遣るたどきも我れは今はなし妹に逢はずて年の経ぬれば</a></p>
<h2>（正述心緒）</h2>
<p><a href="2942.html">我が背子に恋ふとにしあらしみどり子の夜泣きをしつつ寐ねかてなくは</a></p>
<h2>（正述心緒）</h2>
<p><a href="2943.html">我が命の長く欲しけく偽りをよくする人を捕ふばかりを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2944.html">人言を繁みと妹に逢はずして心のうちに恋ふるこのころ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2945.html">玉梓の君が使を待ちし夜のなごりぞ今も寐ねぬ夜の多き</a></p>
<h2>（正述心緒）</h2>
<p><a href="2946.html">玉桙の道に行き逢ひて外目にも見ればよき子をいつとか待たむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2947.html">思ひにしあまりにしかばすべをなみ我れは言ひてき忌むべきものを</a></p>
<h2>（正述心緒）或本歌曰</h2>
<p><a href="2947S1.html">門に出でて我が臥い伏すを人見けむかも [一云 すべをなみ出でてぞ行きし家のあたり見に]</a></p>
<h2>（正述心緒）柿本朝臣人麻呂歌集云</h2>
<p><a href="2947S2.html">にほ鳥のなづさひ来しを人見けむかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2948.html">明日の日はその門行かむ出でて見よ恋ひたる姿あまたしるけむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2949.html">うたて異に心いぶせし事計りよくせ我が背子逢へる時だに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2950.html">我妹子が夜戸出の姿見てしより心空なり地は踏めども</a></p>
<h2>（正述心緒）</h2>
<p><a href="2951.html">海石榴市の八十の街に立ち平し結びし紐を解かまく惜しも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2952.html">我が命の衰へぬれば白栲の袖のなれにし君をしぞ思ふ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2953.html">君に恋ひ我が泣く涙白栲の袖さへ漬ちてせむすべもなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2954.html">今よりは逢はじとすれや白栲の我が衣手の干る時もなき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2955.html">夢かと心惑ひぬ月まねく離れにし君が言の通へば</a></p>
<h2>（正述心緒）</h2>
<p><a href="2956.html">あらたまの年月かねてぬばたまの夢に見えけり君が姿は</a></p>
<h2>（正述心緒）</h2>
<p><a href="2957.html">今よりは恋ふとも妹に逢はめやも床の辺去らず夢に見えこそ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2958.html">人の見て言とがめせぬ夢にだにやまず見えこそ我が恋やまむ</a></p>
<h2>（正述心緒）或本歌頭云</h2>
<p><a href="2958S.html">人目多み直には逢はず </a></p>
<h2>（正述心緒）</h2>
<p><a href="2959.html">うつつには言も絶えたり夢にだに継ぎて見えこそ直に逢ふまでに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2960.html">うつせみの現し心も我れはなし妹を相見ずて年の経ぬれば</a></p>
<h2>（正述心緒）</h2>
<p><a href="2961.html">うつせみの常のことばと思へども継ぎてし聞けば心惑ひぬ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2962.html">白栲の袖離れて寝るぬばたまの今夜は早も明けば明けなむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2963.html">白栲の手本ゆたけく人の寝る味寐は寝ずや恋ひわたりなむ</a></p>
<h2>寄物陳思</h2>
<p><a href="2964.html">かくのみにありける君を衣にあらば下にも着むと我が思へりける</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2965.html">橡の袷の衣裏にせば我れ強ひめやも君が来まさぬ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2966.html">紅の薄染め衣浅らかに相見し人に恋ふるころかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2967.html">年の経ば見つつ偲へと妹が言ひし衣の縫目見れば悲しも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2968.html">橡の一重の衣うらもなくあるらむ子ゆゑ恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2969.html">解き衣の思ひ乱れて恋ふれども何のゆゑぞと問ふ人もなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2970.html">桃染めの浅らの衣浅らかに思ひて妹に逢はむものかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2971.html">大君の塩焼く海人の藤衣なれはすれどもいやめづらしも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2972.html">赤絹の純裏の衣長く欲り我が思ふ君が見えぬころかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2973.html">真玉つくをちこち兼ねて結びつる我が下紐の解くる日あらめや</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2974.html">紫の帯の結びも解きもみずもとなや妹に恋ひわたりなむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2975.html">高麗錦紐の結びも解き放けず斎ひて待てど験なきかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2976.html">紫の我が下紐の色に出でず恋ひかも痩せむ逢ふよしをなみ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2977.html">何ゆゑか思はずあらむ紐の緒の心に入りて恋しきものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2978.html">まそ鏡見ませ我が背子我が形見待てらむ時に逢はざらめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2979.html">まそ鏡直目に君を見てばこそ命に向ふ我が恋やまめ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2980.html">まそ鏡見飽かぬ妹に逢はずして月の経ゆけば生けりともなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2981.html">祝部らが斎くみもろのまそ鏡懸けて偲ひつ逢ふ人ごとに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2982.html">針はあれど妹しなければ付けめやと我れを悩まし絶ゆる紐の緒</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2983.html">高麗剣我が心から外のみに見つつや君を恋ひわたりなむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2984.html">剣大刀名の惜しけくも我れはなしこのころの間の恋の繁きに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2985.html">梓弓末はし知らずしかれどもまさかは君に寄りにしものを</a></p>
<h2>（寄物陳思）一本歌曰</h2>
<p><a href="2985S.html">梓弓末のたづきは知らねども心は君に寄りにしものを </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2986.html">梓弓引きみ緩へみ思ひみてすでに心は寄りにしものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2987.html">梓弓引きて緩へぬ大夫や恋といふものを忍びかねてむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2988.html">梓弓末の中ごろ淀めりし君には逢ひぬ嘆きはやめむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2989.html">今さらに何をか思はむ梓弓引きみ緩へみ寄りにしものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2990.html">娘子らが績み麻のたたり打ち麻懸けうむ時なしに恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2991.html">たらちねの母が飼ふ蚕の繭隠りいぶせくもあるか妹に逢はずして</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2992.html">玉たすき懸けねば苦し懸けたれば継ぎて見まくの欲しき君かも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2993.html">紫のまだらのかづら花やかに今日見し人に後恋ひむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2994.html">玉葛懸けぬ時なく恋ふれども何しか妹に逢ふ時もなき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2995.html">逢ふよしの出でくるまでは畳薦隔て編む数夢にし見えむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2996.html">しらかつく木綿は花もの言こそばいつのまえだも常忘らえね</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2997.html">石上布留の高橋高々に妹が待つらむ夜ぞ更けにける</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2998.html">港入りの葦別け小舟障り多み今来む我れを淀むと思ふな</a></p>
<h2>（寄物陳思）或本歌曰</h2>
<p><a href="2998S.html">港入りに葦別け小舟障り多み君に逢はずて年ぞ経にける </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2999.html">水を多み上田に種蒔き稗を多み選らえし業ぞ我がひとり寝る</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3000.html">魂合へば相寝るものを小山田の鹿猪田守るごと母し守らすも [一云 母が守らしし] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="3001.html">春日野に照れる夕日の外のみに君を相見て今ぞ悔しき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3002.html">あしひきの山より出づる月待つと人には言ひて妹待つ我れを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3003.html">夕月夜暁闇のおほほしく見し人ゆゑに恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3004.html">久方の天つみ空に照る月の失せなむ日こそ我が恋止まめ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3005.html">十五日に出でにし月の高々に君をいませて何をか思はむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3006.html">月夜よみ門に出で立ち足占して行く時さへや妹に逢はずあらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3007.html">ぬばたまの夜渡る月のさやけくはよく見てましを君が姿を</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3008.html">あしひきの山を木高み夕月をいつかと君を待つが苦しさ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3009.html">橡の衣解き洗ひ真土山本つ人にはなほしかずけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3010.html">佐保川の川波立たず静けくも君にたぐひて明日さへもがも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3011.html">我妹子に衣春日の宜寸川よしもあらぬか妹が目を見む</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3012.html">との曇り雨布留川のさざれ波間なくも君は思ほゆるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3013.html">我妹子や我を忘らすな石上袖布留川の絶えむと思へや</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3014.html">三輪山の山下響み行く水の水脈し絶えずは後も我が妻</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3015.html">神のごと聞こゆる瀧の白波の面知る君が見えぬこのころ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3016.html">山川の瀧にまされる恋すとぞ人知りにける間なくし思へば</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3017.html">あしひきの山川水の音に出でず人の子ゆゑに恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3018.html">高湍なる能登瀬の川の後も逢はむ妹には我れは今にあらずとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3019.html">洗ひ衣取替川の川淀の淀まむ心思ひかねつも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3020.html">斑鳩の因可の池のよろしくも君を言はねば思ひぞ我がする</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3021.html">隠り沼の下ゆは恋ひむいちしろく人の知るべく嘆きせめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3022.html">ゆくへなみ隠れる小沼の下思に我れぞ物思ふこのころの間</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3023.html">隠り沼の下ゆ恋ひあまり白波のいちしろく出でぬ人の知るべく</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3024.html">妹が目を見まく堀江のさざれ波しきて恋ひつつありと告げこそ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3025.html">石走る垂水の水のはしきやし君に恋ふらく我が心から</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3026.html">君は来ず我れは故なみ立つ波のしくしくわびしかくて来じとや</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3027.html">近江の海辺は人知る沖つ波君をおきては知る人もなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3028.html">大海の底を深めて結びてし妹が心はうたがひもなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3029.html">佐太の浦に寄する白波間なく思ふを何か妹に逢ひかたき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3030.html">思ひ出でてすべなき時は天雲の奥処も知らず恋ひつつぞ居る</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3031.html">天雲のたゆたひやすき心あらば我れをな頼めそ待たば苦しも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3032.html">君があたり見つつも居らむ生駒山雲なたなびき雨は降るとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3033.html">なかなかに何か知りけむ我が山に燃ゆる煙の外に見ましを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3034.html">我妹子に恋ひすべながり胸を熱み朝戸開くれば見ゆる霧かも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3035.html">暁の朝霧隠りかへらばに何しか恋の色に出でにける</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3036.html">思ひ出づる時はすべなみ佐保山に立つ雨霧の消ぬべく思ほゆ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3037.html">殺目山行き返り道の朝霞ほのかにだにや妹に逢はざらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3038.html">かく恋ひむものと知りせば夕置きて朝は消ぬる露ならましを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3039.html">夕置きて朝は消ぬる白露の消ぬべき恋も我れはするかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3040.html">後つひに妹は逢はむと朝露の命は生けり恋は繁けど</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3041.html">朝な朝な草の上白く置く露の消なばともにと言ひし君はも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3042.html">朝日さす春日の小野に置く露の消ぬべき我が身惜しけくもなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3043.html">露霜の消やすき我が身老いぬともまたをちかへり君をし待たむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3044.html">君待つと庭のみ居ればうち靡く我が黒髪に霜ぞ置きにける</a></p>
<h2>（寄物陳思）或本歌尾句云</h2>
<p><a href="3044S.html">白栲の我が衣手に露ぞ置きにける </a></p>
<h2>（寄物陳思）</h2>
<p><a href="3045.html">朝霜の消ぬべくのみや時なしに思ひわたらむ息の緒にして</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3046.html">楽浪の波越すあざに降る小雨間も置きて我が思はなくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3047.html">神さびて巌に生ふる松が根の君が心は忘れかねつも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3048.html">み狩りする雁羽の小野の櫟柴のなれはまさらず恋こそまされ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3049.html">桜麻の麻生の下草早く生ひば妹が下紐解かずあらましを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3050.html">春日野に浅茅標結ひ絶えめやと我が思ふ人はいや遠長に</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3051.html">あしひきの山菅の根のねもころに我れはぞ恋ふる君が姿を</a></p>
<h2>（寄物陳思）或本歌曰</h2>
<p><a href="3051S.html">我が思ふ人を見むよしもがも </a></p>
<h2>（寄物陳思）</h2>
<p><a href="3052.html">かきつはた佐紀沢に生ふる菅の根の絶ゆとや君が見えぬこのころ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3053.html">あしひきの山菅の根のねもころにやまず思はば妹に逢はむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3054.html">相思はずあるものをかも菅の根のねもころごろに我が思へるらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3055.html">山菅のやまずて君を思へかも我が心どのこの頃はなき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3056.html">妹が門行き過ぎかねて草結ぶ風吹き解くなまたかへり見む [一云 直に逢ふまでに] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="3057.html">浅茅原茅生に足踏み心ぐみ我が思ふ子らが家のあたり見つ [一云 妹が家のあたり見つ] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="3058.html">うちひさす宮にはあれど月草のうつろふ心我が思はなくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3059.html">百に千に人は言ふとも月草のうつろふ心我れ持ためやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3060.html">忘れ草我が紐に付く時となく思ひわたれば生けりともなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3061.html">暁の目覚まし草とこれをだに見つついまして我れと偲はせ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3062.html">忘れ草垣もしみみに植ゑたれど醜の醜草なほ恋ひにけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3063.html">浅茅原小野に標結ふ空言も逢はむと聞こせ恋のなぐさに</a></p>
<h2>（寄物陳思）或本歌曰</h2>
<p><a href="3063S.html">来むと知らせし君をし待たむ </a></p>
<h2>（寄物陳思）</h2>
<p><a href="3064.html">人皆の笠に縫ふといふ有間菅ありて後にも逢はむとぞ思ふ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3065.html">み吉野の秋津の小野に刈る草の思ひ乱れて寝る夜しぞ多き</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3066.html">妹待つと御笠の山の山菅の止まずや恋ひむ命死なずは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3067.html">谷狭み嶺辺に延へる玉葛延へてしあらば年に来ずとも [一云 岩つなの延へてしあらば]</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3068.html">水茎の岡の葛葉を吹きかへし面知る子らが見えぬころかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3069.html">赤駒のい行きはばかる真葛原何の伝て言直にしよけむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3070.html">木綿畳田上山のさな葛ありさりてしも今ならずとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3071.html">丹波道の大江の山のさな葛絶えむの心我が思はなくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3072.html">大崎の荒礒の渡り延ふ葛のゆくへもなくや恋ひわたりなむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3073.html">木綿包み [一云 畳] 白月山のさな葛後もかならず逢はむとぞ思ふ [或本歌曰 絶えむと妹を我が思はなくに] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="3074.html">はねず色のうつろひやすき心あれば年をぞ来経る言は絶えずて</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3075.html">かくしてぞ人は死ぬといふ藤波のただ一目のみ見し人ゆゑに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3076.html">住吉の敷津の浦のなのりその名は告りてしを逢はなくも怪し</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3077.html">みさご居る荒礒に生ふるなのりそのよし名は告らじ親は知るとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3078.html">波の共靡く玉藻の片思に我が思ふ人の言の繁けく</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3079.html">わたつみの沖つ玉藻の靡き寝む早来ませ君待たば苦しも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3080.html">わたつみの沖に生ひたる縄海苔の名はかつて告らじ恋ひは死ぬとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3081.html">玉の緒を片緒に縒りて緒を弱み乱るる時に恋ひずあらめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3082.html">君に逢はず久しくなりぬ玉の緒の長き命の惜しけくもなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3083.html">恋ふることまされる今は玉の緒の絶えて乱れて死ぬべく思ほゆ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3084.html">海人娘子潜き採るといふ忘れ貝世にも忘れじ妹が姿は</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3085.html">朝影に我が身はなりぬ玉かぎるほのかに見えて去にし子ゆゑに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3086.html">なかなかに人とあらずは桑子にもならましものを玉の緒ばかり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3087.html">ま菅よし宗我の川原に鳴く千鳥間なし我が背子我が恋ふらくは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3088.html">恋衣着奈良の山に鳴く鳥の間なく時なし我が恋ふらくは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3089.html">遠つ人狩道の池に住む鳥の立ちても居ても君をしぞ思ふ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3090.html">葦辺行く鴨の羽音の音のみに聞きつつもとな恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3091.html">鴨すらもおのが妻どちあさりして後るる間に恋ふといふものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3092.html">白真弓斐太の細江の菅鳥の妹に恋ふれか寐を寝かねつる</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3093.html">小竹の上に来居て鳴く鳥目を安み人妻ゆゑに我れ恋ひにけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3094.html">物思ふと寐ねず起きたる朝明にはわびて鳴くなり庭つ鳥さへ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3095.html">朝烏早くな鳴きそ我が背子が朝明の姿見れば悲しも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3096.html">馬柵越しに麦食む駒の罵らゆれど猶し恋しく思ひかねつも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3097.html">さ桧隈桧隈川に馬留め馬に水飼へ我れ外に見む</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3098.html">おのれゆゑ罵らえて居れば青馬の面高夫駄に乗りて来べしや</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3099.html">紫草を草と別く別く伏す鹿の野は異にして心は同じ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="3100.html">思はぬを思ふと言はば真鳥住む雲梯の杜の神し知らさむ</a></p>
<h2>問答歌</h2>
<p><a href="3101.html">紫は灰さすものぞ海石榴市の八十の街に逢へる子や誰れ</a></p>
<h2>（問答歌）</h2>
<p><a href="3102.html">たらちねの母が呼ぶ名を申さめど道行く人を誰れと知りてか</a></p>
<h2>（問答歌）</h2>
<p><a href="3103.html">逢はなくはしかもありなむ玉梓の使をだにも待ちやかねてむ</a></p>
<h2>（問答歌）</h2>
<p><a href="3104.html">逢はむとは千度思へどあり通ふ人目を多み恋つつぞ居る</a></p>
<h2>（問答歌）</h2>
<p><a href="3105.html">人目多み直に逢はずてけだしくも我が恋ひ死なば誰が名ならむも</a></p>
<h2>（問答歌）</h2>
<p><a href="3106.html">相見まく欲しきがためは君よりも我れぞまさりていふかしみする</a></p>
<h2>（問答歌）</h2>
<p><a href="3107.html">うつせみの人目を繁み逢はずして年の経ぬれば生けりともなし</a></p>
<h2>（問答歌）</h2>
<p><a href="3108.html">うつせみの人目繁くはぬばたまの夜の夢にを継ぎて見えこそ</a></p>
<h2>（問答歌）</h2>
<p><a href="3109.html">ねもころに思ふ我妹を人言の繁きによりて淀むころかも</a></p>
<h2>（問答歌）</h2>
<p><a href="3110.html">人言の繁くしあらば君も我れも絶えむと言ひて逢ひしものかも</a></p>
<h2>（問答歌）</h2>
<p><a href="3111.html">すべもなき片恋をすとこの頃に我が死ぬべきは夢に見えきや</a></p>
<h2>（問答歌）</h2>
<p><a href="3112.html">夢に見て衣を取り着装ふ間に妹が使ぞ先立ちにける</a></p>
<h2>（問答歌）</h2>
<p><a href="3113.html">ありありて後も逢はむと言のみを堅く言ひつつ逢ふとはなしに</a></p>
<h2>（問答歌）</h2>
<p><a href="3114.html">きはまりて我れも逢はむと思へども人の言こそ繁き君にあれ</a></p>
<h2>（問答歌）</h2>
<p><a href="3115.html">息の緒に我が息づきし妹すらを人妻なりと聞けば悲しも</a></p>
<h2>（問答歌）</h2>
<p><a href="3116.html">我がゆゑにいたくなわびそ後つひに逢はじと言ひしこともあらなくに</a></p>
<h2>（問答歌）</h2>
<p><a href="3117.html">門立てて戸も閉したるをいづくゆか妹が入り来て夢に見えつる</a></p>
<h2>（問答歌）</h2>
<p><a href="3118.html">門立てて戸は閉したれど盗人の穿れる穴より入りて見えけむ</a></p>
<h2>（問答歌）</h2>
<p><a href="3119.html">明日よりは恋ひつつ行かむ今夜だに早く宵より紐解け我妹</a></p>
<h2>（問答歌）</h2>
<p><a href="3120.html">今さらに寝めや我が背子新夜の一夜もおちず夢に見えこそ</a></p>
<h2>（問答歌）</h2>
<p><a href="3121.html">我が背子が使を待つと笠も着ず出でつつぞ見し雨の降らくに</a></p>
<h2>（問答歌）</h2>
<p><a href="3122.html">心なき雨にもあるか人目守り乏しき妹に今日だに逢はむを</a></p>
<h2>（問答歌）</h2>
<p><a href="3123.html">ただひとり寝れど寝かねて白栲の袖を笠に着濡れつつぞ来し</a></p>
<h2>（問答歌）</h2>
<p><a href="3124.html">雨も降り夜も更けにけり今さらに君去なめやも紐解き設けな</a></p>
<h2>（問答歌）</h2>
<p><a href="3125.html">ひさかたの雨の降る日を我が門に蓑笠着ずて来る人や誰れ</a></p>
<h2>（問答歌）</h2>
<p><a href="3126.html">巻向の穴師の山に雲居つつ雨は降れども濡れつつぞ来し</a></p>
<h2>羇旅發思</h2>
<p><a href="3127.html">度会の大川の辺の若久木我が久ならば妹恋ひむかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3128.html">我妹子を夢に見え来と大和道の渡り瀬ごとに手向けぞ我がする</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3129.html">桜花咲きかも散ると見るまでに誰れかもここに見えて散り行く</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3130.html">豊国の企救の浜松ねもころに何しか妹に相言ひそめけむ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3131.html">月変へて君をば見むと思へかも日も変へずして恋の繁けむ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3132.html">な行きそと帰りも来やとかへり見に行けど帰らず道の長手を</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3133.html">旅にして妹を思ひ出でいちしろく人の知るべく嘆きせむかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3134.html">里離り遠くあらなくに草枕旅とし思へばなほ恋ひにけり</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3135.html">近くあれば名のみも聞きて慰めつ今夜ゆ恋のいやまさりなむ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3136.html">旅にありて恋ふれば苦しいつしかも都に行きて君が目を見む</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3137.html">遠くあれば姿は見えず常のごと妹が笑まひは面影にして</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3138.html">年も経ず帰り来なむと朝影に待つらむ妹し面影に見ゆ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3139.html">玉桙の道に出で立ち別れ来し日より思ふに忘る時なし</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3140.html">はしきやししかある恋にもありしかも君に後れて恋しき思へば</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3141.html">草枕旅の悲しくあるなへに妹を相見て後恋ひむかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3142.html">国遠み直には逢はず夢にだに我れに見えこそ逢はむ日までに</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3143.html">かく恋ひむものと知りせば我妹子に言問はましを今し悔しも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3144.html">旅の夜の久しくなればさ丹つらふ紐解き放けず恋ふるこのころ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3145.html">我妹子し我を偲ふらし草枕旅のまろ寝に下紐解けぬ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3146.html">草枕旅の衣の紐解けて思ほゆるかもこの年ころは</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3147.html">草枕旅の紐解く家の妹し我を待ちかねて嘆かふらしも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3148.html">玉釧まき寝し妹を月も経ず置きてや越えむこの山の崎</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3149.html">梓弓末は知らねど愛しみ君にたぐひて山道越え来ぬ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3150.html">霞立つ春の長日を奥処なく知らぬ山道を恋ひつつか来む</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3151.html">外のみに君を相見て木綿畳手向けの山を明日か越え去なむ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3152.html">玉かつま安倍島山の夕露に旅寝えせめや長きこの夜を</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3153.html">み雪降る越の大山行き過ぎていづれの日にか我が里を見む</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3154.html">いで我が駒早く行きこそ真土山待つらむ妹を行きて早見む</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3155.html">悪木山木末ことごと明日よりは靡きてありこそ妹があたり見む</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3156.html">鈴鹿川八十瀬渡りて誰がゆゑか夜越えに越えむ妻もあらなくに</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3157.html">我妹子にまたも近江の安の川安寐も寝ずに恋ひわたるかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3158.html">旅にありてものをぞ思ふ白波の辺にも沖にも寄るとはなしに</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3159.html">港廻に満ち来る潮のいや増しに恋はまされど忘らえぬかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3160.html">沖つ波辺波の来寄る佐太の浦のこのさだ過ぎて後恋ひむかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3161.html">在千潟あり慰めて行かめども家なる妹いいふかしみせむ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3162.html">みをつくし心尽して思へかもここにももとな夢にし見ゆる</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3163.html">我妹子に触るとはなしに荒礒廻に我が衣手は濡れにけるかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3164.html">室の浦の瀬戸の崎なる鳴島の磯越す波に濡れにけるかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3165.html">霍公鳥飛幡の浦にしく波のしくしく君を見むよしもがも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3166.html">我妹子を外のみや見む越の海の子難の海の島ならなくに</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3167.html">波の間ゆ雲居に見ゆる粟島の逢はぬものゆゑ我に寄そる子ら</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3168.html">衣手の真若の浦の真砂地間なく時なし我が恋ふらくは</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3169.html">能登の海に釣する海人の漁り火の光りにいませ月待ちがてり</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3170.html">志賀の海人の釣りし燭せる漁り火のほのかに妹を見むよしもがも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3171.html">難波潟漕ぎ出る舟のはろはろに別れ来ぬれど忘れかねつも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3172.html">浦廻漕ぐ熊野舟つきめづらしく懸けて思はぬ月も日もなし</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3173.html">松浦舟騒く堀江の水脈早み楫取る間なく思ほゆるかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3174.html">漁りする海人の楫音ゆくらかに妹は心に乗りにけるかも</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3175.html">和歌の浦に袖さへ濡れて忘れ貝拾へど妹は忘らえなくに</a></p>
<h2>（羇旅發思）[或本歌末句云]</h2>
<p><a href="3175S.html">[忘れかねつも] </a></p>
<h2>（羇旅發思）</h2>
<p><a href="3176.html">草枕旅にし居れば刈り薦の乱れて妹に恋ひぬ日はなし</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3177.html">志賀の海人の礒に刈り干すなのりその名は告りてしを何か逢ひかたき</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3178.html">国遠み思ひなわびそ風の共雲の行くごと言は通はむ</a></p>
<h2>（羇旅發思）</h2>
<p><a href="3179.html">留まりにし人を思ふに秋津野に居る白雲のやむ時もなし</a></p>
<h2>悲別歌</h2>
<p><a href="3180.html">うらもなく去にし君ゆゑ朝な朝なもとなぞ恋ふる逢ふとはなけど</a></p>
<h2>（悲別歌）</h2>
<p><a href="3181.html">白栲の君が下紐我れさへに今日結びてな逢はむ日のため</a></p>
<h2>（悲別歌）</h2>
<p><a href="3182.html">白栲の袖の別れは惜しけども思ひ乱れて許しつるかも</a></p>
<h2>（悲別歌）</h2>
<p><a href="3183.html">都辺に君は去にしを誰が解けか我が紐の緒の結ふ手たゆきも</a></p>
<h2>（悲別歌）</h2>
<p><a href="3184.html">草枕旅行く君を人目多み袖振らずしてあまた悔しも</a></p>
<h2>（悲別歌）</h2>
<p><a href="3185.html">まそ鏡手に取り持ちて見れど飽かぬ君に後れて生けりともなし</a></p>
<h2>（悲別歌）</h2>
<p><a href="3186.html">曇り夜のたどきも知らぬ山越えています君をばいつとか待たむ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3187.html">たたなづく青垣山の隔なりなばしばしば君を言問はじかも</a></p>
<h2>（悲別歌）</h2>
<p><a href="3188.html">朝霞たなびく山を越えて去なば我れは恋ひむな逢はむ日までに</a></p>
<h2>（悲別歌）</h2>
<p><a href="3189.html">あしひきの山は百重に隠すとも妹は忘れじ直に逢ふまでに [一云 隠せども君を思はくやむ時もなし] </a></p>
<h2>（悲別歌）</h2>
<p><a href="3190.html">雲居なる海山越えてい行きなば我れは恋ひむな後は逢ひぬとも</a></p>
<h2>（悲別歌）</h2>
<p><a href="3191.html">よしゑやし恋ひじとすれど木綿間山越えにし君が思ほゆらくに</a></p>
<h2>（悲別歌）</h2>
<p><a href="3192.html">草蔭の荒藺の崎の笠島を見つつか君が山道越ゆらむ [一云 み坂越ゆらむ] </a></p>
<h2>（悲別歌）</h2>
<p><a href="3193.html">玉かつま島熊山の夕暮れにひとりか君が山道越ゆらむ [一云 夕霧に長恋しつつ寐ねかてぬかも] </a></p>
<h2>（悲別歌）</h2>
<p><a href="3194.html">息の緒に我が思ふ君は鶏が鳴く東の坂を今日か越ゆらむ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3195.html">磐城山直越え来ませ礒崎の許奴美の浜に我れ立ち待たむ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3196.html">春日野の浅茅が原に遅れ居て時ぞともなし我が恋ふらくは</a></p>
<h2>（悲別歌）</h2>
<p><a href="3197.html">住吉の岸に向へる淡路島あはれと君を言はぬ日はなし</a></p>
<h2>（悲別歌）</h2>
<p><a href="3198.html">明日よりはいなむの川の出でて去なば留まれる我れは恋ひつつやあらむ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3199.html">海の底沖は畏し礒廻より漕ぎ廻みいませ月は経ぬとも</a></p>
<h2>（悲別歌）</h2>
<p><a href="3200.html">飼飯の浦に寄する白波しくしくに妹が姿は思ほゆるかも</a></p>
<h2>（悲別歌）</h2>
<p><a href="3201.html">時つ風吹飯の浜に出で居つつ贖ふ命は妹がためこそ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3202.html">熟田津に舟乗りせむと聞きしなへ何ぞも君が見え来ずあるらむ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3203.html">みさご居る洲に居る舟の漕ぎ出なばうら恋しけむ後は逢ひぬとも</a></p>
<h2>（悲別歌）</h2>
<p><a href="3204.html">玉葛幸くいまさね山菅の思ひ乱れて恋ひつつ待たむ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3205.html">後れ居て恋ひつつあらずは田子の浦の海人ならましを玉藻刈る刈る</a></p>
<h2>（悲別歌）</h2>
<p><a href="3206.html">筑紫道の荒礒の玉藻刈るとかも君が久しく待てど来まさぬ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3207.html">あらたまの年の緒長く照る月の飽かざる君や明日別れなむ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3208.html">久にあらむ君を思ふにひさかたの清き月夜も闇の夜に見ゆ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3209.html">春日なる御笠の山に居る雲を出で見るごとに君をしぞ思ふ</a></p>
<h2>（悲別歌）</h2>
<p><a href="3210.html">あしひきの片山雉立ち行かむ君に後れてうつしけめやも</a></p>
<h2>問答&lt;歌&gt;</h2>
<p><a href="3211.html">玉の緒の現し心や八十楫懸け漕ぎ出む船に後れて居らむ</a></p>
<h2>（問答歌）</h2>
<p><a href="3212.html">八十楫懸け島隠りなば我妹子が留まれと振らむ袖見えじかも</a></p>
<h2>（問答歌）</h2>
<p><a href="3213.html">十月しぐれの雨に濡れつつか君が行くらむ宿か借るらむ</a></p>
<h2>（問答歌）</h2>
<p><a href="3214.html">十月雨間も置かず降りにせばいづれの里の宿か借らまし</a></p>
<h2>（問答歌）</h2>
<p><a href="3215.html">白栲の袖の別れを難みして荒津の浜に宿りするかも</a></p>
<h2>（問答歌）</h2>
<p><a href="3216.html">草枕旅行く君を荒津まで送りぞ来ぬる飽き足らねこそ</a></p>
<h2>（問答歌）</h2>
<p><a href="3217.html">荒津の海我れ幣奉り斎ひてむ早帰りませ面変りせず</a></p>
<h2>（問答歌）</h2>
<p><a href="3218.html">朝な朝な筑紫の方を出で見つつ音のみぞ我が泣くいたもすべなみ</a></p>
<h2>（問答歌）</h2>
<p><a href="3219.html">豊国の企救の長浜行き暮らし日の暮れゆけば妹をしぞ思ふ</a></p>
<h2>（問答歌）</h2>
<p><a href="3220.html">豊国の企救の高浜高々に君待つ夜らはさ夜更けにけり</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
