#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第十巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第十巻）</h1>

 <h2>春雜歌</h2>
<p><a href="1812.html">ひさかたの天の香具山この夕霞たなびく春立つらしも</a></p>
<h2></h2>
<p><a href="1813.html">巻向の桧原に立てる春霞おほにし思はばなづみ来めやも</a></p>
<h2></h2>
<p><a href="1814.html">いにしへの人の植ゑけむ杉が枝に霞たなびく春は来ぬらし</a></p>
<h2></h2>
<p><a href="1815.html">子らが手を巻向山に春されば木の葉しのぎて霞たなびく</a></p>
<h2></h2>
<p><a href="1816.html">玉かぎる夕さり来ればさつ人の弓月が岳に霞たなびく</a></p>
<h2></h2>
<p><a href="1817.html">今朝行きて明日には来なむと云子鹿丹朝妻山に霞たなびく</a></p>
<h2></h2>
<p><a href="1818.html">子らが名に懸けのよろしき朝妻の片山崖に霞たなびく</a></p>
<h2>詠鳥</h2>
<p><a href="1819.html">うち靡く春立ちぬらし我が門の柳の末に鴬鳴きつ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1820.html">梅の花咲ける岡辺に家居れば乏しくもあらず鴬の声</a></p>
<h2>（詠鳥）</h2>
<p><a href="1821.html">春霞流るるなへに青柳の枝くひ持ちて鴬鳴くも</a></p>
<h2>（詠鳥）</h2>
<p><a href="1822.html">我が背子を莫越の山の呼子鳥君呼び返せ夜の更けぬとに</a></p>
<h2>（詠鳥）</h2>
<p><a href="1823.html">朝ゐでに来鳴く貌鳥汝れだにも君に恋ふれや時終へず鳴く</a></p>
<h2>（詠鳥）</h2>
<p><a href="1824.html">冬こもり春さり来ればあしひきの山にも野にも鴬鳴くも</a></p>
<h2>（詠鳥）</h2>
<p><a href="1825.html">紫草の根延ふ横野の春野には君を懸けつつ鴬鳴くも</a></p>
<h2>（詠鳥）</h2>
<p><a href="1826.html">春されば妻を求むと鴬の木末を伝ひ鳴きつつもとな</a></p>
<h2>（詠鳥）</h2>
<p><a href="1827.html">春日なる羽がひの山ゆ佐保の内へ鳴き行くなるは誰れ呼子鳥</a></p>
<h2>（詠鳥）</h2>
<p><a href="1828.html">答へぬにな呼び響めそ呼子鳥佐保の山辺を上り下りに</a></p>
<h2>（詠鳥）</h2>
<p><a href="1829.html">梓弓春山近く家居れば継ぎて聞くらむ鴬の声</a></p>
<h2>（詠鳥）</h2>
<p><a href="1830.html">うち靡く春さり来れば小竹の末に尾羽打ち触れて鴬鳴くも</a></p>
<h2>（詠鳥）</h2>
<p><a href="1831.html">朝霧にしののに濡れて呼子鳥三船の山ゆ鳴き渡る見ゆ</a></p>
<h2>&lt;詠雪&gt;</h2>
<p><a href="1832.html">うち靡く春さり来ればしかすがに天雲霧らひ雪は降りつつ</a></p>
<h2>（詠雪）</h2>
<p><a href="1833.html">梅の花降り覆ふ雪を包み持ち君に見せむと取れば消につつ</a></p>
<h2>（詠雪）</h2>
<p><a href="1834.html">梅の花咲き散り過ぎぬしかすがに白雪庭に降りしきりつつ</a></p>
<h2>（詠雪）</h2>
<p><a href="1835.html">今さらに雪降らめやもかぎろひの燃ゆる春へとなりにしものを</a></p>
<h2>（詠雪）</h2>
<p><a href="1836.html">風交り雪は降りつつしかすがに霞たなびき春さりにけり</a></p>
<h2>（詠雪）</h2>
<p><a href="1837.html">山の際に鴬鳴きてうち靡く春と思へど雪降りしきぬ</a></p>
<h2>（詠雪）</h2>
<p><a href="1838.html">峰の上に降り置ける雪し風の共ここに散るらし春にはあれども</a></p>
<h2>（詠雪）</h2>
<p><a href="1839.html">君がため山田の沢にゑぐ摘むと雪消の水に裳の裾濡れぬ</a></p>
<h2>（詠雪）</h2>
<p><a href="1840.html">梅が枝に鳴きて移ろふ鴬の羽白妙に沫雪ぞ降る</a></p>
<h2>（詠雪）</h2>
<p><a href="1841.html">山高み降り来る雪を梅の花散りかも来ると思ひつるかも [一云 梅の花咲きかも散ると] </a></p>
<h2>（詠雪）</h2>
<p><a href="1842.html">雪をおきて梅をな恋ひそあしひきの山片付きて家居せる君</a></p>
<h2>詠霞</h2>
<p><a href="1843.html">昨日こそ年は果てしか春霞春日の山に早立ちにけり</a></p>
<h2>（詠霞）</h2>
<p><a href="1844.html">冬過ぎて春来るらし朝日さす春日の山に霞たなびく</a></p>
<h2>（詠霞）</h2>
<p><a href="1845.html">鴬の春になるらし春日山霞たなびく夜目に見れども</a></p>
<h2>詠柳</h2>
<p><a href="1846.html">霜枯れの冬の柳は見る人のかづらにすべく萌えにけるかも</a></p>
<h2>（詠柳）</h2>
<p><a href="1847.html">浅緑染め懸けたりと見るまでに春の柳は萌えにけるかも</a></p>
<h2>（詠柳）</h2>
<p><a href="1848.html">山の際に雪は降りつつしかすがにこの川楊は萌えにけるかも</a></p>
<h2>（詠柳）</h2>
<p><a href="1849.html">山の際の雪は消ずあるをみなぎらふ川の沿ひには萌えにけるかも</a></p>
<h2>（詠柳）</h2>
<p><a href="1850.html">朝な朝な我が見る柳鴬の来居て鳴くべく森に早なれ</a></p>
<h2>（詠柳）</h2>
<p><a href="1851.html">青柳の糸のくはしさ春風に乱れぬい間に見せむ子もがも</a></p>
<h2>（詠柳）</h2>
<p><a href="1852.html">ももしきの大宮人のかづらけるしだり柳は見れど飽かぬかも</a></p>
<h2>（詠柳）</h2>
<p><a href="1853.html">梅の花取り持ち見れば我が宿の柳の眉し思ほゆるかも</a></p>
<h2>詠花</h2>
<p><a href="1854.html">鴬の木伝ふ梅のうつろへば桜の花の時かたまけぬ</a></p>
<h2>（詠花）</h2>
<p><a href="1855.html">桜花時は過ぎねど見る人の恋ふる盛りと今し散るらむ</a></p>
<h2>（詠花）</h2>
<p><a href="1856.html">我がかざす柳の糸を吹き乱る風にか妹が梅の散るらむ</a></p>
<h2>（詠花）</h2>
<p><a href="1857.html">年のはに梅は咲けどもうつせみの世の人我れし春なかりけり</a></p>
<h2>（詠花）</h2>
<p><a href="1858.html">うつたへに鳥は食まねど縄延へて守らまく欲しき梅の花かも</a></p>
<h2>（詠花）</h2>
<p><a href="1859.html">馬並めて多賀の山辺を白栲ににほはしたるは梅の花かも</a></p>
<h2>（詠花）</h2>
<p><a href="1860.html">花咲きて実はならねども長き日に思ほゆるかも山吹の花</a></p>
<h2>（詠花）</h2>
<p><a href="1861.html">能登川の水底さへに照るまでに御笠の山は咲きにけるかも</a></p>
<h2>（詠花）</h2>
<p><a href="1862.html">雪見ればいまだ冬なりしかすがに春霞立ち梅は散りつつ</a></p>
<h2>（詠花）</h2>
<p><a href="1863.html">去年咲きし久木今咲くいたづらに地にか落ちむ見る人なしに</a></p>
<h2>（詠花）</h2>
<p><a href="1864.html">あしひきの山の際照らす桜花この春雨に散りゆかむかも</a></p>
<h2>（詠花）</h2>
<p><a href="1865.html">うち靡く春さり来らし山の際の遠き木末の咲きゆく見れば</a></p>
<h2>（詠花）</h2>
<p><a href="1866.html">雉鳴く高円の辺に桜花散りて流らふ見む人もがも</a></p>
<h2>（詠花）</h2>
<p><a href="1867.html">阿保山の桜の花は今日もかも散り乱ふらむ見る人なしに</a></p>
<h2>（詠花）</h2>
<p><a href="1868.html">かはづ鳴く吉野の川の滝の上の馬酔木の花ぞはしに置くなゆめ</a></p>
<h2>（詠花）</h2>
<p><a href="1869.html">春雨に争ひかねて我が宿の桜の花は咲きそめにけり</a></p>
<h2>（詠花）</h2>
<p><a href="1870.html">春雨はいたくな降りそ桜花いまだ見なくに散らまく惜しも</a></p>
<h2>（詠花）</h2>
<p><a href="1871.html">春されば散らまく惜しき梅の花しましは咲かずふふみてもがも</a></p>
<h2>（詠花）</h2>
<p><a href="1872.html">見わたせば春日の野辺に霞立ち咲きにほへるは桜花かも</a></p>
<h2>（詠花）</h2>
<p><a href="1873.html">いつしかもこの夜の明けむ鴬の木伝ひ散らす梅の花見む</a></p>
<h2>詠月</h2>
<p><a href="1874.html">春霞たなびく今日の夕月夜清く照るらむ高松の野に</a></p>
<h2>（詠月）</h2>
<p><a href="1875.html">春されば木の木の暗の夕月夜おほつかなしも山蔭にして [一云 春されば木の暗多み夕月夜] </a></p>
<h2>（詠月）</h2>
<p><a href="1876.html">朝霞春日の暮は木の間より移ろふ月をいつとか待たむ</a></p>
<h2>詠雨</h2>
<p><a href="1877.html">春の雨にありけるものを立ち隠り妹が家道にこの日暮らしつ</a></p>
<h2>詠河</h2>
<p><a href="1878.html">今行きて聞くものにもが明日香川春雨降りてたぎつ瀬の音を</a></p>
<h2>詠煙</h2>
<p><a href="1879.html">春日野に煙立つ見ゆ娘子らし春野のうはぎ摘みて煮らしも</a></p>
<h2>野遊</h2>
<p><a href="1880.html">春日野の浅茅が上に思ふどち遊ぶ今日の日忘らえめやも</a></p>
<h2>（野遊）</h2>
<p><a href="1881.html">春霞立つ春日野を行き返り我れは相見むいや年のはに</a></p>
<h2>（野遊）</h2>
<p><a href="1882.html">春の野に心延べむと思ふどち来し今日の日は暮れずもあらぬか</a></p>
<h2>（野遊）</h2>
<p><a href="1883.html">ももしきの大宮人は暇あれや梅をかざしてここに集へる</a></p>
<h2>歎舊</h2>
<p><a href="1884.html">冬過ぎて春し来れば年月は新たなれども人は古りゆく</a></p>
<h2>（歎舊）</h2>
<p><a href="1885.html">物皆は新たしきよしただしくも人は古りにしよろしかるべし</a></p>
<h2>懽逢</h2>
<p><a href="1886.html">住吉の里行きしかば春花のいやめづらしき君に逢へるかも</a></p>
<h2>旋頭歌</h2>
<p><a href="1887.html">春日なる御笠の山に月も出でぬかも佐紀山に咲ける桜の花の見ゆべく</a></p>
<h2>（旋頭歌）</h2>
<p><a href="1888.html">白雪の常敷く冬は過ぎにけらしも春霞たなびく野辺の鴬鳴くも</a></p>
<h2>譬喩歌</h2>
<p><a href="1889.html">我が宿の毛桃の下に月夜さし下心よしうたてこのころ</a></p>
<h2>春相聞</h2>
<p><a href="1890.html">春山の友鴬の泣き別れ帰ります間も思ほせ我れを</a></p>
<h2></h2>
<p><a href="1891.html">冬こもり春咲く花を手折り持ち千たびの限り恋ひわたるかも</a></p>
<h2></h2>
<p><a href="1892.html">春山の霧に惑へる鴬も我れにまさりて物思はめやも</a></p>
<h2></h2>
<p><a href="1893.html">出でて見る向ひの岡に本茂く咲きたる花のならずはやまじ</a></p>
<h2></h2>
<p><a href="1894.html">霞立つ春の長日を恋ひ暮らし夜も更けゆくに妹も逢はぬかも</a></p>
<h2></h2>
<p><a href="1895.html">春さればまづさきくさの幸くあらば後にも逢はむな恋ひそ我妹</a></p>
<h2></h2>
<p><a href="1896.html">春さればしだり柳のとををにも妹は心に乗りにけるかも</a></p>
<h2>寄鳥</h2>
<p><a href="1897.html">春さればもずの草ぐき見えずとも我れは見やらむ君があたりをば</a></p>
<h2>（寄鳥）</h2>
<p><a href="1898.html">貌鳥の間なくしば鳴く春の野の草根の繁き恋もするかも</a></p>
<h2>寄花</h2>
<p><a href="1899.html">春されば卯の花ぐたし我が越えし妹が垣間は荒れにけるかも</a></p>
<h2>（寄花）</h2>
<p><a href="1900.html">梅の花咲き散る園に我れ行かむ君が使を片待ちがてり</a></p>
<h2>（寄花）</h2>
<p><a href="1901.html">藤波の咲く春の野に延ふ葛の下よし恋ひば久しくもあらむ</a></p>
<h2>（寄花）</h2>
<p><a href="1902.html">春の野に霞たなびき咲く花のかくなるまでに逢はぬ君かも</a></p>
<h2>（寄花）</h2>
<p><a href="1903.html">我が背子に我が恋ふらくは奥山の馬酔木の花の今盛りなり</a></p>
<h2>（寄花）</h2>
<p><a href="1904.html">梅の花しだり柳に折り交へ花に供へば君に逢はむかも</a></p>
<h2>（寄花）</h2>
<p><a href="1905.html">をみなへし佐紀野に生ふる白つつじ知らぬこともち言はえし我が背</a></p>
<h2>（寄花）</h2>
<p><a href="1906.html">梅の花我れは散らさじあをによし奈良なる人も来つつ見るがね</a></p>
<h2>（寄花）</h2>
<p><a href="1907.html">かくしあらば何か植ゑけむ山吹のやむ時もなく恋ふらく思へば</a></p>
<h2>寄霜</h2>
<p><a href="1908.html">春されば水草の上に置く霜の消につつも我れは恋ひわたるかも</a></p>
<h2>寄霞</h2>
<p><a href="1909.html">春霞山にたなびきおほほしく妹を相見て後恋ひむかも</a></p>
<h2>（寄霞）</h2>
<p><a href="1910.html">春霞立ちにし日より今日までに我が恋やまず本の繁けば [一云 片思にして] </a></p>
<h2>（寄霞）</h2>
<p><a href="1911.html">さ丹つらふ妹を思ふと霞立つ春日もくれに恋ひわたるかも</a></p>
<h2>（寄霞）</h2>
<p><a href="1912.html">たまきはる我が山の上に立つ霞立つとも居とも君がまにまに</a></p>
<h2>（寄霞）</h2>
<p><a href="1913.html">見わたせば春日の野辺に立つ霞見まくの欲しき君が姿か</a></p>
<h2>（寄霞）</h2>
<p><a href="1914.html">恋ひつつも今日は暮らしつ霞立つ明日の春日をいかに暮らさむ</a></p>
<h2>寄雨</h2>
<p><a href="1915.html">我が背子に恋ひてすべなみ春雨の降るわき知らず出でて来しかも</a></p>
<h2>（寄雨）</h2>
<p><a href="1916.html">今さらに君はい行かじ春雨の心を人の知らずあらなくに</a></p>
<h2>（寄雨）</h2>
<p><a href="1917.html">春雨に衣はいたく通らめや七日し降らば七日来じとや</a></p>
<h2>（寄雨）</h2>
<p><a href="1918.html">梅の花散らす春雨いたく降る旅にや君が廬りせるらむ</a></p>
<h2>寄草</h2>
<p><a href="1919.html">国栖らが春菜摘むらむ司馬の野のしばしば君を思ふこのころ</a></p>
<h2>（寄草）</h2>
<p><a href="1920.html">春草の繁き我が恋大海の辺に行く波の千重に積もりぬ</a></p>
<h2>（寄草）</h2>
<p><a href="1921.html">おほほしく君を相見て菅の根の長き春日を恋ひわたるかも</a></p>
<h2>寄松</h2>
<p><a href="1922.html">梅の花咲きて散りなば我妹子を来むか来じかと我が松の木ぞ</a></p>
<h2>寄雲</h2>
<p><a href="1923.html">白真弓今春山に行く雲の行きや別れむ恋しきものを</a></p>
<h2>贈蘰</h2>
<p><a href="1924.html">大夫の伏し居嘆きて作りたるしだり柳のかづらせ我妹</a></p>
<h2>&lt;悲&gt;別</h2>
<p><a href="1925.html">朝戸出の君が姿をよく見ずて長き春日を恋ひや暮らさむ</a></p>
<h2>（問答）</h2>
<p><a href="1926.html">春山の馬酔木の花の悪しからぬ君にはしゑや寄そるともよし</a></p>
<h2>（問答）</h2>
<p><a href="1927.html">石上布留の神杉神びにし我れやさらさら恋にあひにける</a></p>
<h2>（問答）</h2>
<p><a href="1928.html">さのかたは実にならずとも花のみに咲きて見えこそ恋のなぐさに</a></p>
<h2>（問答）</h2>
<p><a href="1929.html">さのかたは実になりにしを今さらに春雨降りて花咲かめやも</a></p>
<h2>（問答）</h2>
<p><a href="1930.html">梓弓引津の辺なるなのりその花咲くまでに逢はぬ君かも</a></p>
<h2>（問答）</h2>
<p><a href="1931.html">川の上のいつ藻の花のいつもいつも来ませ我が背子時じけめやも</a></p>
<h2>（問答）</h2>
<p><a href="1932.html">春雨のやまず降る降る我が恋ふる人の目すらを相見せなくに</a></p>
<h2>（問答）</h2>
<p><a href="1933.html">我妹子に恋ひつつ居れば春雨のそれも知るごとやまず降りつつ</a></p>
<h2>（問答）</h2>
<p><a href="1934.html">相思はぬ妹をやもとな菅の根の長き春日を思ひ暮らさむ</a></p>
<h2>（問答）</h2>
<p><a href="1935.html">春さればまづ鳴く鳥の鴬の言先立ちし君をし待たむ</a></p>
<h2>（問答）</h2>
<p><a href="1936.html">相思はずあるらむ子ゆゑ玉の緒の長き春日を思ひ暮らさく</a></p>
<h2>夏雜歌 / 詠鳥</h2>
<p><a href="1937.html">大夫の 出で立ち向ふ 故郷の 神なび山に 明けくれば 柘のさ枝に 夕されば 小松が末に 里人の 聞き恋ふるまで 山彦の 相響むまで 霍公鳥 妻恋ひすらし さ夜中に鳴く </a></p>
<h2>（詠鳥）反歌</h2>
<p><a href="1938.html">旅にして妻恋すらし霍公鳥神なび山にさ夜更けて鳴く</a></p>
<h2>（詠鳥）</h2>
<p><a href="1939.html">霍公鳥汝が初声は我れにもが五月の玉に交へて貫かむ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1940.html">朝霞たなびく野辺にあしひきの山霍公鳥いつか来鳴かむ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1941.html">朝霧の八重山越えて呼子鳥鳴きや汝が来る宿もあらなくに</a></p>
<h2>（詠鳥）</h2>
<p><a href="1942.html">霍公鳥鳴く声聞くや卯の花の咲き散る岡に葛引く娘女</a></p>
<h2>（詠鳥）</h2>
<p><a href="1943.html">月夜よみ鳴く霍公鳥見まく欲り我れ草取れり見む人もがも</a></p>
<h2>（詠鳥）</h2>
<p><a href="1944.html">藤波の散らまく惜しみ霍公鳥今城の岡を鳴きて越ゆなり</a></p>
<h2>（詠鳥）</h2>
<p><a href="1945.html">朝霧の八重山越えて霍公鳥卯の花辺から鳴きて越え来ぬ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1946.html">木高くはかつて木植ゑじ霍公鳥来鳴き響めて恋まさらしむ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1947.html">逢ひかたき君に逢へる夜霍公鳥他時ゆは今こそ鳴かめ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1948.html">木の暗の夕闇なるに [一云 なれば] 霍公鳥いづくを家と鳴き渡るらむ </a></p>
<h2>（詠鳥）</h2>
<p><a href="1949.html">霍公鳥今朝の朝明に鳴きつるは君聞きけむか朝寐か寝けむ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1950.html">霍公鳥花橘の枝に居て鳴き響もせば花は散りつつ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1951.html">うれたきや醜霍公鳥今こそば声の嗄るがに来鳴き響めめ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1952.html">今夜のおほつかなきに霍公鳥鳴くなる声の音の遥けさ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1953.html">五月山卯の花月夜霍公鳥聞けども飽かずまた鳴かぬかも</a></p>
<h2>（詠鳥）</h2>
<p><a href="1954.html">霍公鳥来居も鳴かぬか我がやどの花橘の地に落ちむ見む</a></p>
<h2>（詠鳥）</h2>
<p><a href="1955.html">霍公鳥いとふ時なしあやめぐさかづらにせむ日こゆ鳴き渡れ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1956.html">大和には鳴きてか来らむ霍公鳥汝が鳴くごとになき人思ほゆ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1957.html">卯の花の散らまく惜しみ霍公鳥野に出で山に入り来鳴き響もす</a></p>
<h2>（詠鳥）</h2>
<p><a href="1958.html">橘の林を植ゑむ霍公鳥常に冬まで棲みわたるがね</a></p>
<h2>（詠鳥）</h2>
<p><a href="1959.html">雨晴れの雲にたぐひて霍公鳥春日をさしてこゆ鳴き渡る</a></p>
<h2>（詠鳥）</h2>
<p><a href="1960.html">物思ふと寐ねぬ朝明に霍公鳥鳴きてさ渡るすべなきまでに</a></p>
<h2>（詠鳥）</h2>
<p><a href="1961.html">我が衣を君に着せよと霍公鳥我れをうながす袖に来居つつ</a></p>
<h2>（詠鳥）</h2>
<p><a href="1962.html">本つ人霍公鳥をやめづらしく今か汝が来る恋ひつつ居れば</a></p>
<h2>（詠鳥）</h2>
<p><a href="1963.html">かくばかり雨の降らくに霍公鳥卯の花山になほか鳴くらむ</a></p>
<h2>詠蝉</h2>
<p><a href="1964.html">黙もあらむ時も鳴かなむひぐらしの物思ふ時に鳴きつつもとな</a></p>
<h2>詠榛</h2>
<p><a href="1965.html">思ふ子が衣摺らむににほひこそ島の榛原秋立たずとも</a></p>
<h2>詠花</h2>
<p><a href="1966.html">風に散る花橘を袖に受けて君がみ跡と偲ひつるかも</a></p>
<h2>（詠花）</h2>
<p><a href="1967.html">かぐはしき花橘を玉に貫き贈らむ妹はみつれてもあるか</a></p>
<h2>（詠花）</h2>
<p><a href="1968.html">霍公鳥来鳴き響もす橘の花散る庭を見む人や誰れ</a></p>
<h2>（詠花）</h2>
<p><a href="1969.html">我が宿の花橘は散りにけり悔しき時に逢へる君かも</a></p>
<h2>（詠花）</h2>
<p><a href="1970.html">見わたせば向ひの野辺のなでしこの散らまく惜しも雨な降りそね</a></p>
<h2>（詠花）</h2>
<p><a href="1971.html">雨間明けて国見もせむを故郷の花橘は散りにけむかも</a></p>
<h2>（詠花）</h2>
<p><a href="1972.html">野辺見ればなでしこの花咲きにけり我が待つ秋は近づくらしも</a></p>
<h2>（詠花）</h2>
<p><a href="1973.html">我妹子に楝の花は散り過ぎず今咲けるごとありこせぬかも</a></p>
<h2>（詠花）</h2>
<p><a href="1974.html">春日野の藤は散りにて何をかもみ狩の人の折りてかざさむ</a></p>
<h2>（詠花）</h2>
<p><a href="1975.html">時ならず玉をぞ貫ける卯の花の五月を待たば久しくあるべみ</a></p>
<h2>問答</h2>
<p><a href="1976.html">卯の花の咲き散る岡ゆ霍公鳥鳴きてさ渡る君は聞きつや</a></p>
<h2>（問答）</h2>
<p><a href="1977.html">聞きつやと君が問はせる霍公鳥しののに濡れてこゆ鳴き渡る</a></p>
<h2>譬喩歌</h2>
<p><a href="1978.html">橘の花散る里に通ひなば山霍公鳥響もさむかも</a></p>
<h2>夏相聞 / 寄鳥</h2>
<p><a href="1979.html">春さればすがるなす野の霍公鳥ほとほと妹に逢はず来にけり</a></p>
<h2>（寄鳥）</h2>
<p><a href="1980.html">五月山花橘に霍公鳥隠らふ時に逢へる君かも</a></p>
<h2>（寄鳥）</h2>
<p><a href="1981.html">霍公鳥来鳴く五月の短夜もひとりし寝れば明かしかねつも</a></p>
<h2>寄蝉</h2>
<p><a href="1982.html">ひぐらしは時と鳴けども片恋にたわや女我れは時わかず泣く</a></p>
<h2>寄草</h2>
<p><a href="1983.html">人言は夏野の草の繁くとも妹と我れとし携はり寝ば</a></p>
<h2>（寄草）</h2>
<p><a href="1984.html">このころの恋の繁けく夏草の刈り掃へども生ひしくごとし</a></p>
<h2>（寄草）</h2>
<p><a href="1985.html">ま葛延ふ夏野の繁くかく恋ひばまこと我が命常ならめやも</a></p>
<h2>（寄草）</h2>
<p><a href="1986.html">我れのみやかく恋すらむかきつはた丹つらふ妹はいかにかあるらむ</a></p>
<h2>寄花</h2>
<p><a href="1987.html">片縒りに糸をぞ我が縒る我が背子が花橘を貫かむと思ひて</a></p>
<h2>（寄花）</h2>
<p><a href="1988.html">鴬の通ふ垣根の卯の花の憂きことあれや君が来まさぬ</a></p>
<h2>（寄花）</h2>
<p><a href="1989.html">卯の花の咲くとはなしにある人に恋ひやわたらむ片思にして</a></p>
<h2>（寄花）</h2>
<p><a href="1990.html">我れこそば憎くもあらめ我がやどの花橘を見には来じとや</a></p>
<h2>（寄花）</h2>
<p><a href="1991.html">霍公鳥来鳴き響もす岡辺なる藤波見には君は来じとや</a></p>
<h2>（寄花）</h2>
<p><a href="1992.html">隠りのみ恋ふれば苦しなでしこの花に咲き出よ朝な朝な見む</a></p>
<h2>（寄花）</h2>
<p><a href="1993.html">外のみに見つつ恋ひなむ紅の末摘花の色に出でずとも</a></p>
<h2>寄露</h2>
<p><a href="1994.html">夏草の露別け衣着けなくに我が衣手の干る時もなき</a></p>
<h2>寄日</h2>
<p><a href="1995.html">六月の地さへ裂けて照る日にも我が袖干めや君に逢はずして</a></p>
<h2>秋雜歌 / 七夕</h2>
<p><a href="1996.html">天の川水さへに照る舟泊てて舟なる人は妹と見えきや</a></p>
<h2>（七夕）</h2>
<p><a href="1997.html">久方の天の川原にぬえ鳥のうら歎げましつすべなきまでに</a></p>
<h2>（七夕）</h2>
<p><a href="1998.html">我が恋を嬬は知れるを行く舟の過ぎて来べしや言も告げなむ</a></p>
<h2>（七夕）</h2>
<p><a href="1999.html">赤らひく色ぐはし子をしば見れば人妻ゆゑに我れ恋ひぬべし</a></p>
<h2>（七夕）</h2>
<p><a href="2000.html">天の川安の渡りに舟浮けて秋立つ待つと妹に告げこそ</a></p>
<h2>（七夕）</h2>
<p><a href="2001.html">大空ゆ通ふ我れすら汝がゆゑに天の川道をなづみてぞ来し</a></p>
<h2>（七夕）</h2>
<p><a href="2002.html">八千桙の神の御代よりともし妻人知りにけり継ぎてし思へば</a></p>
<h2>（七夕）</h2>
<p><a href="2003.html">我が恋ふる丹のほの面わこよひもか天の川原に石枕まく</a></p>
<h2>（七夕）</h2>
<p><a href="2004.html">己夫にともしき子らは泊てむ津の荒礒巻きて寝む君待ちかてに</a></p>
<h2>（七夕）</h2>
<p><a href="2005.html">天地と別れし時ゆ己が妻しかぞ年にある秋待つ我れは</a></p>
<h2>（七夕）</h2>
<p><a href="2006.html">彦星は嘆かす妻に言だにも告げにぞ来つる見れば苦しみ</a></p>
<h2>（七夕）</h2>
<p><a href="2007.html">ひさかたの天つしるしと水無し川隔てて置きし神代し恨めし</a></p>
<h2>（七夕）</h2>
<p><a href="2008.html">ぬばたまの夜霧に隠り遠くとも妹が伝へは早く告げこそ</a></p>
<h2>（七夕）</h2>
<p><a href="2009.html">汝が恋ふる妹の命は飽き足らに袖振る見えつ雲隠るまで</a></p>
<h2>（七夕）</h2>
<p><a href="2010.html">夕星も通ふ天道をいつまでか仰ぎて待たむ月人壮士</a></p>
<h2>（七夕）</h2>
<p><a href="2011.html">天の川い向ひ立ちて恋しらに言だに告げむ妻と言ふまでは</a></p>
<h2>（七夕）</h2>
<p><a href="2012.html">白玉の五百つ集ひを解きもみず我は干しかてぬ逢はむ日待つに</a></p>
<h2>（七夕）</h2>
<p><a href="2013.html">天の川水蔭草の秋風に靡かふ見れば時は来にけり</a></p>
<h2>（七夕）</h2>
<p><a href="2014.html">我が待ちし秋萩咲きぬ今だにもにほひに行かな彼方人に</a></p>
<h2>（七夕）</h2>
<p><a href="2015.html">我が背子にうら恋ひ居れば天の川夜舟漕ぐなる楫の音聞こゆ</a></p>
<h2>（七夕）</h2>
<p><a href="2016.html">ま日長く恋ふる心ゆ秋風に妹が音聞こゆ紐解き行かな</a></p>
<h2>（七夕）</h2>
<p><a href="2017.html">恋ひしくは日長きものを今だにもともしむべしや逢ふべき夜だに</a></p>
<h2>（七夕）</h2>
<p><a href="2018.html">天の川去年の渡りで移ろへば川瀬を踏むに夜ぞ更けにける</a></p>
<h2>（七夕）</h2>
<p><a href="2019.html">いにしへゆあげてし服も顧みず天の川津に年ぞ経にける</a></p>
<h2>（七夕）</h2>
<p><a href="2020.html">天の川夜船を漕ぎて明けぬとも逢はむと思ふ夜袖交へずあらむ</a></p>
<h2>（七夕）</h2>
<p><a href="2021.html">遠妻と手枕交へて寝たる夜は鶏がねな鳴き明けば明けぬとも</a></p>
<h2>（七夕）</h2>
<p><a href="2022.html">相見らく飽き足らねどもいなのめの明けさりにけり舟出せむ妻</a></p>
<h2>（七夕）</h2>
<p><a href="2023.html">さ寝そめていくだもあらねば白栲の帯乞ふべしや恋も過ぎねば</a></p>
<h2>（七夕）</h2>
<p><a href="2024.html">万代にたづさはり居て相見とも思ひ過ぐべき恋にあらなくに</a></p>
<h2>（七夕）</h2>
<p><a href="2025.html">万代に照るべき月も雲隠り苦しきものぞ逢はむと思へど</a></p>
<h2>（七夕）</h2>
<p><a href="2026.html">白雲の五百重に隠り遠くとも宵さらず見む妹があたりは</a></p>
<h2>（七夕）</h2>
<p><a href="2027.html">我がためと織女のそのやどに織る白栲は織りてけむかも</a></p>
<h2>（七夕）</h2>
<p><a href="2028.html">君に逢はず久しき時ゆ織る服の白栲衣垢付くまでに</a></p>
<h2>（七夕）</h2>
<p><a href="2029.html">天の川楫の音聞こゆ彦星と織女と今夜逢ふらしも</a></p>
<h2>（七夕）</h2>
<p><a href="2030.html">秋されば川霧立てる天の川川に向き居て恋ふる夜ぞ多き</a></p>
<h2>（七夕）</h2>
<p><a href="2031.html">よしゑやし直ならずともぬえ鳥のうら嘆げ居りと告げむ子もがも</a></p>
<h2>（七夕）</h2>
<p><a href="2032.html">一年に七日の夜のみ逢ふ人の恋も過ぎねば夜は更けゆくも [一云 尽きねばさ夜ぞ明けにける] </a></p>
<h2>（七夕）</h2>
<p><a href="2033.html">天の川安の川原定而神競者磨待無</a></p>
<h2>（七夕）</h2>
<p><a href="2034.html">織女の五百機立てて織る布の秋さり衣誰れか取り見む</a></p>
<h2>（七夕）</h2>
<p><a href="2035.html">年にありて今か巻くらむぬばたまの夜霧隠れる遠妻の手を</a></p>
<h2>（七夕）</h2>
<p><a href="2036.html">我が待ちし秋は来りぬ妹と我れと何事あれぞ紐解かずあらむ</a></p>
<h2>（七夕）</h2>
<p><a href="2037.html">年の恋今夜尽して明日よりは常のごとくや我が恋ひ居らむ</a></p>
<h2>（七夕）</h2>
<p><a href="2038.html">逢はなくは日長きものを天の川隔ててまたや我が恋ひ居らむ</a></p>
<h2>（七夕）</h2>
<p><a href="2039.html">恋しけく日長きものを逢ふべくある宵だに君が来まさずあるらむ</a></p>
<h2>（七夕）</h2>
<p><a href="2040.html">彦星と織女と今夜逢ふ天の川門に波立つなゆめ</a></p>
<h2>（七夕）</h2>
<p><a href="2041.html">秋風の吹きただよはす白雲は織女の天つ領巾かも</a></p>
<h2>（七夕）</h2>
<p><a href="2042.html">しばしばも相見ぬ君を天の川舟出早せよ夜の更けぬ間に</a></p>
<h2>（七夕）</h2>
<p><a href="2043.html">秋風の清き夕に天の川舟漕ぎ渡る月人壮士</a></p>
<h2>（七夕）</h2>
<p><a href="2044.html">天の川霧立ちわたり彦星の楫の音聞こゆ夜の更けゆけば</a></p>
<h2>（七夕）</h2>
<p><a href="2045.html">君が舟今漕ぎ来らし天の川霧立ちわたるこの川の瀬に</a></p>
<h2>（七夕）</h2>
<p><a href="2046.html">秋風に川波立ちぬしましくは八十の舟津にみ舟留めよ</a></p>
<h2>（七夕）</h2>
<p><a href="2047.html">天の川川の音清し彦星の秋漕ぐ舟の波のさわきか</a></p>
<h2>（七夕）</h2>
<p><a href="2048.html">天の川川門に立ちて我が恋ひし君来ますなり紐解き待たむ [一云 天の川川に向き立ち] </a></p>
<h2>（七夕）</h2>
<p><a href="2049.html">天の川川門に居りて年月を恋ひ来し君に今夜逢へるかも</a></p>
<h2>（七夕）</h2>
<p><a href="2050.html">明日よりは我が玉床をうち掃ひ君と寐ねずてひとりかも寝む</a></p>
<h2>（七夕）</h2>
<p><a href="2051.html">天の原行きて射てむと白真弓引きて隠れる月人壮士</a></p>
<h2>（七夕）</h2>
<p><a href="2052.html">この夕降りくる雨は彦星の早漕ぐ舟の櫂の散りかも</a></p>
<h2>（七夕）</h2>
<p><a href="2053.html">天の川八十瀬霧らへり彦星の時待つ舟は今し漕ぐらし</a></p>
<h2>（七夕）</h2>
<p><a href="2054.html">風吹きて川波立ちぬ引き船に渡りも来ませ夜の更けぬ間に</a></p>
<h2>（七夕）</h2>
<p><a href="2055.html">天の川遠き渡りはなけれども君が舟出は年にこそ待て</a></p>
<h2>（七夕）</h2>
<p><a href="2056.html">天の川打橋渡せ妹が家道やまず通はむ時待たずとも</a></p>
<h2>（七夕）</h2>
<p><a href="2057.html">月重ね我が思ふ妹に逢へる夜は今し七夜を継ぎこせぬかも</a></p>
<h2>（七夕）</h2>
<p><a href="2058.html">年に装ふ我が舟漕がむ天の川風は吹くとも波立つなゆめ</a></p>
<h2>（七夕）</h2>
<p><a href="2059.html">天の川波は立つとも我が舟はいざ漕ぎ出でむ夜の更けぬ間に</a></p>
<h2>（七夕）</h2>
<p><a href="2060.html">ただ今夜逢ひたる子らに言どひもいまだせずしてさ夜ぞ明けにける</a></p>
<h2>（七夕）</h2>
<p><a href="2061.html">天の川白波高し我が恋ふる君が舟出は今しすらしも</a></p>
<h2>（七夕）</h2>
<p><a href="2062.html">機物のまね木持ち行きて天の川打橋渡す君が来むため</a></p>
<h2>（七夕）</h2>
<p><a href="2063.html">天の川霧立ち上る織女の雲の衣のかへる袖かも</a></p>
<h2>（七夕）</h2>
<p><a href="2064.html">いにしへゆ織りてし服をこの夕衣に縫ひて君待つ我れを</a></p>
<h2>（七夕）</h2>
<p><a href="2065.html">足玉も手玉もゆらに織る服を君が御衣に縫ひもあへむかも</a></p>
<h2>（七夕）</h2>
<p><a href="2066.html">月日えり逢ひてしあれば別れまく惜しくある君は明日さへもがも</a></p>
<h2>（七夕）</h2>
<p><a href="2067.html">天の川渡り瀬深み舟浮けて漕ぎ来る君が楫の音聞こゆ</a></p>
<h2>（七夕）</h2>
<p><a href="2068.html">天の原降り放け見れば天の川霧立ちわたる君は来ぬらし</a></p>
<h2>（七夕）</h2>
<p><a href="2069.html">天の川瀬ごとに幣をたてまつる心は君を幸く来ませと</a></p>
<h2>（七夕）</h2>
<p><a href="2070.html">久方の天の川津に舟浮けて君待つ夜らは明けずもあらぬか</a></p>
<h2>（七夕）</h2>
<p><a href="2071.html">天の川なづさひ渡る君が手もいまだまかねば夜の更けぬらく</a></p>
<h2>（七夕）</h2>
<p><a href="2072.html">渡り守舟渡せをと呼ぶ声の至らねばかも楫の音のせぬ</a></p>
<h2>（七夕）</h2>
<p><a href="2073.html">ま日長く川に向き立ちありし袖今夜巻かむと思はくがよさ</a></p>
<h2>（七夕）</h2>
<p><a href="2074.html">天の川渡り瀬ごとに思ひつつ来しくもしるし逢へらく思へば</a></p>
<h2>（七夕）</h2>
<p><a href="2075.html">人さへや見継がずあらむ彦星の妻呼ぶ舟の近づき行くを [一云 見つつあるらむ] </a></p>
<h2>（七夕）</h2>
<p><a href="2076.html">天の川瀬を早みかもぬばたまの夜は更けにつつ逢はぬ彦星</a></p>
<h2>（七夕）</h2>
<p><a href="2077.html">渡り守舟早渡せ一年にふたたび通ふ君にあらなくに</a></p>
<h2>（七夕）</h2>
<p><a href="2078.html">玉葛絶えぬものからさ寝らくは年の渡りにただ一夜のみ</a></p>
<h2>（七夕）</h2>
<p><a href="2079.html">恋ふる日は日長きものを今夜だにともしむべしや逢ふべきものを</a></p>
<h2>（七夕）</h2>
<p><a href="2080.html">織女の今夜逢ひなば常のごと明日を隔てて年は長けむ</a></p>
<h2>（七夕）</h2>
<p><a href="2081.html">天の川棚橋渡せ織女のい渡らさむに棚橋渡せ</a></p>
<h2>（七夕）</h2>
<p><a href="2082.html">天の川川門八十ありいづくにか君がみ舟を我が待ち居らむ</a></p>
<h2>（七夕）</h2>
<p><a href="2083.html">秋風の吹きにし日より天の川瀬に出で立ちて待つと告げこそ</a></p>
<h2>（七夕）</h2>
<p><a href="2084.html">天の川去年の渡り瀬荒れにけり君が来まさむ道の知らなく</a></p>
<h2>（七夕）</h2>
<p><a href="2085.html">天の川瀬々に白波高けども直渡り来ぬ待たば苦しみ</a></p>
<h2>（七夕）</h2>
<p><a href="2086.html">彦星の妻呼ぶ舟の引き綱の絶えむと君を我が思はなくに</a></p>
<h2>（七夕）</h2>
<p><a href="2087.html">渡り守舟出し出でむ今夜のみ相見て後は逢はじものかも</a></p>
<h2>（七夕）</h2>
<p><a href="2088.html">我が隠せる楫棹なくて渡り守舟貸さめやもしましはあり待て</a></p>
<h2>（七夕）</h2>
<p><a href="2089.html">天地の 初めの時ゆ 天の川 い向ひ居りて 一年に ふたたび逢はぬ 妻恋ひに 物思ふ人 天の川 安の川原の あり通ふ 出の渡りに そほ舟の 艫にも舳にも 舟装ひ ま楫しじ貫き 旗すすき 本葉もそよに 秋風の 吹きくる宵に 天の川 白波しのぎ 落ちたぎつ 早瀬渡りて 若草の 妻を巻かむと 大船の 思ひ頼みて 漕ぎ来らむ その夫の子が あらたまの 年の緒長く 思ひ来し 恋尽すらむ 七月の 七日の宵は 我れも悲しも </a></p>
<h2>（七夕）反歌</h2>
<p><a href="2090.html">高麗錦紐解きかはし天人の妻問ふ宵ぞ我れも偲はむ</a></p>
<h2>（七夕）（反歌）</h2>
<p><a href="2091.html">彦星の川瀬を渡るさ小舟のえ行きて泊てむ川津し思ほゆ</a></p>
<h2>（七夕）</h2>
<p><a href="2092.html">天地と 別れし時ゆ 久方の 天つしるしと 定めてし 天の川原に あらたまの 月重なりて 妹に逢ふ 時さもらふと 立ち待つに 我が衣手に 秋風の 吹きかへらへば 立ちて居て たどきを知らに むらきもの 心いさよひ 解き衣の 思ひ乱れて いつしかと 我が待つ今夜 この川の 流れの長く ありこせぬかも </a></p>
<h2>（七夕）反歌</h2>
<p><a href="2093.html">妹に逢ふ時片待つとひさかたの天の川原に月ぞ経にける</a></p>
<h2>詠花</h2>
<p><a href="2094.html">さを鹿の心相思ふ秋萩のしぐれの降るに散らくし惜しも</a></p>
<h2>（詠花）</h2>
<p><a href="2095.html">夕されば野辺の秋萩うら若み露にぞ枯るる秋待ちかてに</a></p>
<h2>（詠花）</h2>
<p><a href="2096.html">真葛原靡く秋風吹くごとに阿太の大野の萩の花散る</a></p>
<h2>（詠花）</h2>
<p><a href="2097.html">雁がねの来鳴かむ日まで見つつあらむこの萩原に雨な降りそね</a></p>
<h2>（詠花）</h2>
<p><a href="2098.html">奥山に棲むといふ鹿の夕さらず妻どふ萩の散らまく惜しも</a></p>
<h2>（詠花）</h2>
<p><a href="2099.html">白露の置かまく惜しみ秋萩を折りのみ折りて置きや枯らさむ</a></p>
<h2>（詠花）</h2>
<p><a href="2100.html">秋田刈る仮廬の宿りにほふまで咲ける秋萩見れど飽かぬかも</a></p>
<h2>（詠花）</h2>
<p><a href="2101.html">我が衣摺れるにはあらず高松の野辺行きしかば萩の摺れるぞ</a></p>
<h2>（詠花）</h2>
<p><a href="2102.html">この夕秋風吹きぬ白露に争ふ萩の明日咲かむ見む</a></p>
<h2>（詠花）</h2>
<p><a href="2103.html">秋風は涼しくなりぬ馬並めていざ野に行かな萩の花見に</a></p>
<h2>（詠花）</h2>
<p><a href="2104.html">朝顔は朝露負ひて咲くといへど夕影にこそ咲きまさりけれ</a></p>
<h2>（詠花）</h2>
<p><a href="2105.html">春されば霞隠りて見えずありし秋萩咲きぬ折りてかざさむ</a></p>
<h2>（詠花）</h2>
<p><a href="2106.html">沙額田の野辺の秋萩時なれば今盛りなり折りてかざさむ</a></p>
<h2>（詠花）</h2>
<p><a href="2107.html">ことさらに衣は摺らじをみなへし佐紀野の萩ににほひて居らむ</a></p>
<h2>（詠花）</h2>
<p><a href="2108.html">秋風は疾く疾く吹き来萩の花散らまく惜しみ競ひ立たむ見む</a></p>
<h2>（詠花）</h2>
<p><a href="2109.html">我が宿の萩の末長し秋風の吹きなむ時に咲かむと思ひて</a></p>
<h2>（詠花）</h2>
<p><a href="2110.html">人皆は萩を秋と言ふよし我れは尾花が末を秋とは言はむ</a></p>
<h2>（詠花）</h2>
<p><a href="2111.html">玉梓の君が使の手折り来るこの秋萩は見れど飽かぬかも</a></p>
<h2>（詠花）</h2>
<p><a href="2112.html">我がやどに咲ける秋萩常ならば我が待つ人に見せましものを</a></p>
<h2>（詠花）</h2>
<p><a href="2113.html">手寸十名相植ゑしなしるく出で見れば宿の初萩咲きにけるかも</a></p>
<h2>（詠花）</h2>
<p><a href="2114.html">我が宿に植ゑ生ほしたる秋萩を誰れか標刺す我れに知らえず</a></p>
<h2>（詠花）</h2>
<p><a href="2115.html">手に取れば袖さへにほふをみなへしこの白露に散らまく惜しも</a></p>
<h2>（詠花）</h2>
<p><a href="2116.html">白露に争ひかねて咲ける萩散らば惜しけむ雨な降りそね</a></p>
<h2>（詠花）</h2>
<p><a href="2117.html">娘女らに行相の早稲を刈る時になりにけらしも萩の花咲く</a></p>
<h2>（詠花）</h2>
<p><a href="2118.html">朝霧のたなびく小野の萩の花今か散るらむいまだ飽かなくに</a></p>
<h2>（詠花）</h2>
<p><a href="2119.html">恋しくは形見にせよと我が背子が植ゑし秋萩花咲きにけり</a></p>
<h2>（詠花）</h2>
<p><a href="2120.html">秋萩に恋尽さじと思へどもしゑやあたらしまたも逢はめやも</a></p>
<h2>（詠花）</h2>
<p><a href="2121.html">秋風は日に異に吹きぬ高円の野辺の秋萩散らまく惜しも</a></p>
<h2>（詠花）</h2>
<p><a href="2122.html">大夫の心はなしに秋萩の恋のみにやもなづみてありなむ</a></p>
<h2>（詠花）</h2>
<p><a href="2123.html">我が待ちし秋は来たりぬしかれども萩の花ぞもいまだ咲かずける</a></p>
<h2>（詠花）</h2>
<p><a href="2124.html">見まく欲り我が待ち恋ひし秋萩は枝もしみみに花咲きにけり</a></p>
<h2>（詠花）</h2>
<p><a href="2125.html">春日野の萩し散りなば朝東風の風にたぐひてここに散り来ね</a></p>
<h2>（詠花）</h2>
<p><a href="2126.html">秋萩は雁に逢はじと言へればか [一云 言へれかも] 声を聞きては花に散りぬる</a></p>
<h2>（詠花）</h2>
<p><a href="2127.html">秋さらば妹に見せむと植ゑし萩露霜負ひて散りにけるかも</a></p>
<h2>詠鴈</h2>
<p><a href="2128.html">秋風に大和へ越ゆる雁がねはいや遠ざかる雲隠りつつ</a></p>
<h2>（詠鴈）</h2>
<p><a href="2129.html">明け暮れの朝霧隠り鳴きて行く雁は我が恋妹に告げこそ</a></p>
<h2>（詠鴈）</h2>
<p><a href="2130.html">我が宿に鳴きし雁がね雲の上に今夜鳴くなり国へかも行く</a></p>
<h2>（詠鴈）</h2>
<p><a href="2131.html">さを鹿の妻どふ時に月をよみ雁が音聞こゆ今し来らしも</a></p>
<h2>（詠鴈）</h2>
<p><a href="2132.html">天雲の外に雁が音聞きしよりはだれ霜降り寒しこの夜は [一云 いやますますに恋こそまされ] </a></p>
<h2>（詠鴈）</h2>
<p><a href="2133.html">秋の田の我が刈りばかの過ぎぬれば雁が音聞こゆ冬かたまけて</a></p>
<h2>（詠鴈）</h2>
<p><a href="2134.html">葦辺なる荻の葉さやぎ秋風の吹き来るなへに雁鳴き渡る [一云 秋風に雁が音聞こゆ今し来らしも] </a></p>
<h2>（詠鴈）</h2>
<p><a href="2135.html">おしてる難波堀江の葦辺には雁寝たるかも霜の降らくに</a></p>
<h2>（詠鴈）</h2>
<p><a href="2136.html">秋風に山飛び越ゆる雁がねの声遠ざかる雲隠るらし</a></p>
<h2>（詠鴈）</h2>
<p><a href="2137.html">朝に行く雁の鳴く音は我がごとく物思へれかも声の悲しき</a></p>
<h2>（詠鴈）</h2>
<p><a href="2138.html">鶴がねの今朝鳴くなへに雁がねはいづくさしてか雲隠るらむ</a></p>
<h2>（詠鴈）</h2>
<p><a href="2139.html">ぬばたまの夜渡る雁はおほほしく幾夜を経てかおのが名を告る</a></p>
<h2>（詠鴈）</h2>
<p><a href="2140.html">あらたまの年の経ゆけばあどもふと夜渡る我れを問ふ人や誰れ</a></p>
<h2>詠鹿鳴</h2>
<p><a href="2141.html">このころの秋の朝明に霧隠り妻呼ぶ鹿の声のさやけさ</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2142.html">さを鹿の妻ととのふと鳴く声の至らむ極み靡け萩原</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2143.html">君に恋ひうらぶれ居れば敷の野の秋萩しのぎさを鹿鳴くも</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2144.html">雁は来ぬ萩は散りぬとさを鹿の鳴くなる声もうらぶれにけり</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2145.html">秋萩の恋も尽きねばさを鹿の声い継ぎい継ぎ恋こそまされ</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2146.html">山近く家や居るべきさを鹿の声を聞きつつ寐ねかてぬかも</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2147.html">山の辺にい行くさつ男は多かれど山にも野にもさを鹿鳴くも</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2148.html">あしひきの山より来せばさを鹿の妻呼ぶ声を聞かましものを</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2149.html">山辺にはさつ男のねらひ畏けどを鹿鳴くなり妻が目を欲り</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2150.html">秋萩の散りゆく見ればおほほしみ妻恋すらしさを鹿鳴くも</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2151.html">山遠き都にしあればさを鹿の妻呼ぶ声は乏しくもあるか</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2152.html">秋萩の散り過ぎゆかばさを鹿はわび鳴きせむな見ずはともしみ</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2153.html">秋萩の咲きたる野辺はさを鹿ぞ露を別けつつ妻どひしける</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2154.html">なぞ鹿のわび鳴きすなるけだしくも秋野の萩や繁く散るらむ</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2155.html">秋萩の咲たる野辺にさを鹿は散らまく惜しみ鳴き行くものを</a></p>
<h2>（詠鹿鳴）</h2>
<p><a href="2156.html">あしひきの山の常蔭に鳴く鹿の声聞かすやも山田守らす子</a></p>
<h2>詠蝉</h2>
<p><a href="2157.html">夕影に来鳴くひぐらしここだくも日ごとに聞けど飽かぬ声かも</a></p>
<h2>詠&lt;蟋&gt;</h2>
<p><a href="2158.html">秋風の寒く吹くなへ我が宿の浅茅が本にこほろぎ鳴くも</a></p>
<h2>（詠&lt;蟋&gt;）</h2>
<p><a href="2159.html">蔭草の生ひたる宿の夕影に鳴くこほろぎは聞けど飽かぬかも</a></p>
<h2>（詠&lt;蟋&gt;）</h2>
<p><a href="2160.html">庭草に村雨降りてこほろぎの鳴く声聞けば秋づきにけり</a></p>
<h2>詠蝦</h2>
<p><a href="2161.html">み吉野の岩もとさらず鳴くかはづうべも鳴きけり川をさやけみ</a></p>
<h2>（詠蝦）</h2>
<p><a href="2162.html">神なびの山下響み行く水にかはづ鳴くなり秋と言はむとや</a></p>
<h2>（詠蝦）</h2>
<p><a href="2163.html">草枕旅に物思ひ我が聞けば夕かたまけて鳴くかはづかも</a></p>
<h2>（詠蝦）</h2>
<p><a href="2164.html">瀬を早み落ちたぎちたる白波にかはづ鳴くなり朝夕ごとに</a></p>
<h2>（詠蝦）</h2>
<p><a href="2165.html">上つ瀬にかはづ妻呼ぶ夕されば衣手寒み妻まかむとか</a></p>
<h2>詠鳥</h2>
<p><a href="2166.html">妹が手を取石の池の波の間ゆ鳥が音異に鳴く秋過ぎぬらし</a></p>
<h2>（詠鳥）</h2>
<p><a href="2167.html">秋の野の尾花が末に鳴くもずの声聞きけむか片聞け我妹</a></p>
<h2>詠露</h2>
<p><a href="2168.html">秋萩に置ける白露朝な朝な玉としぞ見る置ける白露</a></p>
<h2>（詠露）</h2>
<p><a href="2169.html">夕立ちの雨降るごとに [一云 うち降れば] 春日野の尾花が上の白露思ほゆ </a></p>
<h2>（詠露）</h2>
<p><a href="2170.html">秋萩の枝もとををに露霜置き寒くも時はなりにけるかも</a></p>
<h2>（詠露）</h2>
<p><a href="2171.html">白露と秋萩とには恋ひ乱れ別くことかたき我が心かも</a></p>
<h2>（詠露）</h2>
<p><a href="2172.html">我が宿の尾花押しなべ置く露に手触れ我妹子散らまくも見む</a></p>
<h2>（詠露）</h2>
<p><a href="2173.html">白露を取らば消ぬべしいざ子ども露に競ひて萩の遊びせむ</a></p>
<h2>（詠露）</h2>
<p><a href="2174.html">秋田刈る仮廬を作り我が居れば衣手寒く露ぞ置きにける</a></p>
<h2>（詠露）</h2>
<p><a href="2175.html">このころの秋風寒し萩の花散らす白露置きにけらしも</a></p>
<h2>（詠露）</h2>
<p><a href="2176.html">秋田刈る苫手動くなり白露し置く穂田なしと告げに来ぬらし [一云 告げに来らしも] </a></p>
<h2>詠山</h2>
<p><a href="2177.html">春は萌え夏は緑に紅のまだらに見ゆる秋の山かも</a></p>
<h2>詠黄葉</h2>
<p><a href="2178.html">妻ごもる矢野の神山露霜ににほひそめたり散らまく惜しも</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2179.html">朝露ににほひそめたる秋山にしぐれな降りそありわたるがね</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2180.html">九月のしぐれの雨に濡れ通り春日の山は色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2181.html">雁が音の寒き朝明の露ならし春日の山をもみたすものは</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2182.html">このころの暁露に我がやどの萩の下葉は色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2183.html">雁がねは今は来鳴きぬ我が待ちし黄葉早継げ待たば苦しも</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2184.html">秋山をゆめ人懸くな忘れにしその黄葉の思ほゆらくに</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2185.html">大坂を我が越え来れば二上に黄葉流るしぐれ降りつつ</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2186.html">秋されば置く白露に我が門の浅茅が末葉色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2187.html">妹が袖巻来の山の朝露ににほふ黄葉の散らまく惜しも</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2188.html">黄葉のにほひは繁ししかれども妻梨の木を手折りかざさむ</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2189.html">露霜の寒き夕の秋風にもみちにけらし妻梨の木は</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2190.html">我が門の浅茅色づく吉隠の浪柴の野の黄葉散るらし</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2191.html">雁が音を聞きつるなへに高松の野の上の草ぞ色づきにける</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2192.html">我が背子が白栲衣行き触ればにほひぬべくももみつ山かも</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2193.html">秋風の日に異に吹けば水茎の岡の木の葉も色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2194.html">雁がねの来鳴きしなへに韓衣龍田の山はもみちそめたり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2195.html">雁がねの声聞くなへに明日よりは春日の山はもみちそめなむ</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2196.html">しぐれの雨間なくし降れば真木の葉も争ひかねて色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2197.html">いちしろくしぐれの雨は降らなくに大城の山は色づきにけり [謂大城山者 在筑前<國>御笠郡之大野山頂 号曰大城者也]</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2198.html">風吹けば黄葉散りつつすくなくも吾の松原清くあらなくに</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2199.html">物思ふと隠らひ居りて今日見れば春日の山は色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2200.html">九月の白露負ひてあしひきの山のもみたむ見まくしもよし</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2201.html">妹がりと馬に鞍置きて生駒山うち越え来れば黄葉散りつつ</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2202.html">黄葉する時になるらし月人の桂の枝の色づく見れば</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2203.html">里ゆ異に霜は置くらし高松の野山づかさの色づく見れば</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2204.html">秋風の日に異に吹けば露を重み萩の下葉は色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2205.html">秋萩の下葉もみちぬあらたまの月の経ぬれば風をいたみかも</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2206.html">まそ鏡南淵山は今日もかも白露置きて黄葉散るらむ</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2207.html">我がやどの浅茅色づく吉隠の夏身の上にしぐれ降るらし</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2208.html">雁がねの寒く鳴きしゆ水茎の岡の葛葉は色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2209.html">秋萩の下葉の黄葉花に継ぎ時過ぎゆかば後恋ひむかも</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2210.html">明日香川黄葉流る葛城の山の木の葉は今し散るらし</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2211.html">妹が紐解くと結びて龍田山今こそもみちそめてありけれ</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2212.html">雁がねの寒く鳴きしゆ春日なる御笠の山は色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2213.html">このころの暁露に我が宿の秋の萩原色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2214.html">夕されば雁の越え行く龍田山しぐれに競ひ色づきにけり</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2215.html">さ夜更けてしぐれな降りそ秋萩の本葉の黄葉散らまく惜しも</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2216.html">故郷の初黄葉を手折り持ち今日ぞ我が来し見ぬ人のため</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2217.html">君が家の黄葉は早く散りにけりしぐれの雨に濡れにけらしも</a></p>
<h2>（詠黄葉）</h2>
<p><a href="2218.html">一年にふたたび行かぬ秋山を心に飽かず過ぐしつるかも</a></p>
<h2>詠水田</h2>
<p><a href="2219.html">あしひきの山田作る子秀でずとも縄だに延へよ守ると知るがね</a></p>
<h2>（詠水田）</h2>
<p><a href="2220.html">さを鹿の妻呼ぶ山の岡辺なる早稲田は刈らじ霜は降るとも</a></p>
<h2>（詠水田）</h2>
<p><a href="2221.html">我が門に守る田を見れば佐保の内の秋萩すすき思ほゆるかも</a></p>
<h2>詠河</h2>
<p><a href="2222.html">夕さらずかはづ鳴くなる三輪川の清き瀬の音を聞かくしよしも</a></p>
<h2>詠月</h2>
<p><a href="2223.html">天の海に月の舟浮け桂楫懸けて漕ぐ見ゆ月人壮士</a></p>
<h2>（詠月）</h2>
<p><a href="2224.html">この夜らはさ夜更けぬらし雁が音の聞こゆる空ゆ月立ち渡る</a></p>
<h2>（詠月）</h2>
<p><a href="2225.html">我が背子がかざしの萩に置く露をさやかに見よと月は照るらし</a></p>
<h2>（詠月）</h2>
<p><a href="2226.html">心なき秋の月夜の物思ふと寐の寝らえぬに照りつつもとな</a></p>
<h2>（詠月）</h2>
<p><a href="2227.html">思はぬにしぐれの雨は降りたれど天雲晴れて月夜さやけし</a></p>
<h2>（詠月）</h2>
<p><a href="2228.html">萩の花咲きのををりを見よとかも月夜の清き恋まさらくに</a></p>
<h2>（詠月）</h2>
<p><a href="2229.html">白露を玉になしたる九月の有明の月夜見れど飽かぬかも</a></p>
<h2>詠風</h2>
<p><a href="2230.html">恋ひつつも稲葉かき別け家居れば乏しくもあらず秋の夕風</a></p>
<h2>（詠風）</h2>
<p><a href="2231.html">萩の花咲きたる野辺にひぐらしの鳴くなるなへに秋の風吹く</a></p>
<h2>（詠風）</h2>
<p><a href="2232.html">秋山の木の葉もいまだもみたねば今朝吹く風は霜も置きぬべく</a></p>
<h2>詠芳</h2>
<p><a href="2233.html">高松のこの峰も狭に笠立てて満ち盛りたる秋の香のよさ</a></p>
<h2>詠雨</h2>
<p><a href="2234.html">一日には千重しくしくに我が恋ふる妹があたりにしぐれ降れ見む</a></p>
<h2>（詠雨）</h2>
<p><a href="2235.html">秋田刈る旅の廬りにしぐれ降り我が袖濡れぬ干す人なしに</a></p>
<h2>（詠雨）</h2>
<p><a href="2236.html">玉たすき懸けぬ時なし我が恋はしぐれし降らば濡れつつも行かむ</a></p>
<h2>（詠雨）</h2>
<p><a href="2237.html">黄葉を散らすしぐれの降るなへに夜さへぞ寒きひとりし寝れば</a></p>
<h2>詠霜</h2>
<p><a href="2238.html">天飛ぶや雁の翼の覆ひ羽のいづく漏りてか霜の降りけむ</a></p>
<h2>秋相聞</h2>
<p><a href="2239.html">秋山のしたひが下に鳴く鳥の声だに聞かば何か嘆かむ</a></p>
<h2></h2>
<p><a href="2240.html">誰ぞかれと我れをな問ひそ九月の露に濡れつつ君待つ我れを</a></p>
<h2></h2>
<p><a href="2241.html">秋の夜の霧立ちわたりおほほしく夢にぞ見つる妹が姿を</a></p>
<h2></h2>
<p><a href="2242.html">秋の野の尾花が末の生ひ靡き心は妹に寄りにけるかも</a></p>
<h2></h2>
<p><a href="2243.html">秋山に霜降り覆ひ木の葉散り年は行くとも我れ忘れめや</a></p>
<h2>寄水田</h2>
<p><a href="2244.html">住吉の岸を田に墾り蒔きし稲かくて刈るまで逢はぬ君かも</a></p>
<h2>（寄水田）</h2>
<p><a href="2245.html">太刀の後玉纒田居にいつまでか妹を相見ず家恋ひ居らむ</a></p>
<h2>（寄水田）</h2>
<p><a href="2246.html">秋の田の穂の上に置ける白露の消ぬべくも我は思ほゆるかも</a></p>
<h2>（寄水田）</h2>
<p><a href="2247.html">秋の田の穂向きの寄れる片寄りに我れは物思ふつれなきものを</a></p>
<h2>（寄水田）</h2>
<p><a href="2248.html">秋田刈る仮廬を作り廬りしてあるらむ君を見むよしもがも</a></p>
<h2>（寄水田）</h2>
<p><a href="2249.html">鶴が音の聞こゆる田居に廬りして我れ旅なりと妹に告げこそ</a></p>
<h2>（寄水田）</h2>
<p><a href="2250.html">春霞たなびく田居に廬つきて秋田刈るまで思はしむらく</a></p>
<h2>（寄水田）</h2>
<p><a href="2251.html">橘を守部の里の門田早稲刈る時過ぎぬ来じとすらしも</a></p>
<h2>寄露</h2>
<p><a href="2252.html">秋萩の咲き散る野辺の夕露に濡れつつ来ませ夜は更けぬとも</a></p>
<h2>（寄露）</h2>
<p><a href="2253.html">色づかふ秋の露霜な降りそね妹が手本をまかぬ今夜は</a></p>
<h2>（寄露）</h2>
<p><a href="2254.html">秋萩の上に置きたる白露の消かもしなまし恋ひつつあらずは</a></p>
<h2>（寄露）</h2>
<p><a href="2255.html">我が宿の秋萩の上に置く露のいちしろくしも我れ恋ひめやも</a></p>
<h2>（寄露）</h2>
<p><a href="2256.html">秋の穂をしのに押しなべ置く露の消かもしなまし恋ひつつあらずは</a></p>
<h2>（寄露）</h2>
<p><a href="2257.html">露霜に衣手濡れて今だにも妹がり行かな夜は更けぬとも</a></p>
<h2>（寄露）</h2>
<p><a href="2258.html">秋萩の枝もとををに置く露の消かもしなまし恋ひつつあらずは</a></p>
<h2>（寄露）</h2>
<p><a href="2259.html">秋萩の上に白露置くごとに見つつぞ偲ふ君が姿を</a></p>
<h2>寄風</h2>
<p><a href="2260.html">我妹子は衣にあらなむ秋風の寒きこのころ下に着ましを</a></p>
<h2>（寄風）</h2>
<p><a href="2261.html">泊瀬風かく吹く宵はいつまでか衣片敷き我がひとり寝む</a></p>
<h2>寄雨</h2>
<p><a href="2262.html">秋萩を散らす長雨の降るころはひとり起き居て恋ふる夜ぞ多き</a></p>
<h2>（寄雨）</h2>
<p><a href="2263.html">九月のしぐれの雨の山霧のいぶせき我が胸誰を見ばやまむ [一云 十月しぐれの雨降り] </a></p>
<h2>寄蟋</h2>
<p><a href="2264.html">こほろぎの待ち喜ぶる秋の夜を寝る験なし枕と我れは</a></p>
<h2>寄蝦</h2>
<p><a href="2265.html">朝霞鹿火屋が下に鳴くかはづ声だに聞かば我れ恋ひめやも</a></p>
<h2>寄鴈</h2>
<p><a href="2266.html">出でて去なば天飛ぶ雁の泣きぬべみ今日今日と言ふに年ぞ経にける</a></p>
<h2>寄鹿</h2>
<p><a href="2267.html">さを鹿の朝伏す小野の草若み隠らひかねて人に知らゆな</a></p>
<h2>（寄鹿）</h2>
<p><a href="2268.html">さを鹿の小野の草伏いちしろく我がとはなくに人の知れらく</a></p>
<h2>寄鶴</h2>
<p><a href="2269.html">今夜の暁ぐたち鳴く鶴の思ひは過ぎず恋こそまされ</a></p>
<h2>寄草</h2>
<p><a href="2270.html">道の辺の尾花が下の思ひ草今さらさらに何をか思はむ</a></p>
<h2>寄花</h2>
<p><a href="2271.html">草深みこほろぎさはに鳴くやどの萩見に君はいつか来まさむ</a></p>
<h2>（寄花）</h2>
<p><a href="2272.html">秋づけば水草の花のあえぬがに思へど知らじ直に逢はざれば</a></p>
<h2>（寄花）</h2>
<p><a href="2273.html">何すとか君をいとはむ秋萩のその初花の嬉しきものを</a></p>
<h2>（寄花）</h2>
<p><a href="2274.html">臥いまろび恋ひは死ぬともいちしろく色には出でじ朝顔の花</a></p>
<h2>（寄花）</h2>
<p><a href="2275.html">言に出でて云はばゆゆしみ朝顔の穂には咲き出ぬ恋もするかも</a></p>
<h2>（寄花）</h2>
<p><a href="2276.html">雁がねの初声聞きて咲き出たる宿の秋萩見に来我が背子</a></p>
<h2>（寄花）</h2>
<p><a href="2277.html">さを鹿の入野のすすき初尾花いづれの時か妹が手まかむ</a></p>
<h2>（寄花）</h2>
<p><a href="2278.html">恋ふる日の日長くしあればみ園生の韓藍の花の色に出でにけり</a></p>
<h2>（寄花）</h2>
<p><a href="2279.html">我が里に今咲く花のをみなへし堪へぬ心になほ恋ひにけり</a></p>
<h2>（寄花）</h2>
<p><a href="2280.html">萩の花咲けるを見れば君に逢はずまことも久になりにけるかも</a></p>
<h2>（寄花）</h2>
<p><a href="2281.html">朝露に咲きすさびたる月草の日くたつなへに消ぬべく思ほゆ</a></p>
<h2>（寄花）</h2>
<p><a href="2282.html">長き夜を君に恋ひつつ生けらずは咲きて散りにし花ならましを</a></p>
<h2>（寄花）</h2>
<p><a href="2283.html">我妹子に逢坂山のはだすすき穂には咲き出ず恋ひわたるかも</a></p>
<h2>（寄花）</h2>
<p><a href="2284.html">いささめに今も見が欲し秋萩のしなひにあるらむ妹が姿を</a></p>
<h2>（寄花）</h2>
<p><a href="2285.html">秋萩の花野のすすき穂には出でず我が恋ひわたる隠り妻はも</a></p>
<h2>（寄花）</h2>
<p><a href="2286.html">我が宿に咲きし秋萩散り過ぎて実になるまでに君に逢はぬかも</a></p>
<h2>（寄花）</h2>
<p><a href="2287.html">我が宿の萩咲きにけり散らぬ間に早来て見べし奈良の里人</a></p>
<h2>（寄花）</h2>
<p><a href="2288.html">石橋の間々に生ひたるかほ花の花にしありけりありつつ見れば</a></p>
<h2>（寄花）</h2>
<p><a href="2289.html">藤原の古りにし里の秋萩は咲きて散りにき君待ちかねて</a></p>
<h2>（寄花）</h2>
<p><a href="2290.html">秋萩を散り過ぎぬべみ手折り持ち見れども寂し君にしあらねば</a></p>
<h2>（寄花）</h2>
<p><a href="2291.html">朝咲き夕は消ぬる月草の消ぬべき恋も我れはするかも</a></p>
<h2>（寄花）</h2>
<p><a href="2292.html">秋津野の尾花刈り添へ秋萩の花を葺かさね君が仮廬に</a></p>
<h2>（寄花）</h2>
<p><a href="2293.html">咲けりとも知らずしあらば黙もあらむこの秋萩を見せつつもとな</a></p>
<h2>寄山</h2>
<p><a href="2294.html">秋されば雁飛び越ゆる龍田山立ちても居ても君をしぞ思ふ</a></p>
<h2>寄黄葉</h2>
<p><a href="2295.html">我が宿の葛葉日に異に色づきぬ来まさぬ君は何心ぞも</a></p>
<h2>（寄黄葉）</h2>
<p><a href="2296.html">あしひきの山さな葛もみつまで妹に逢はずや我が恋ひ居らむ</a></p>
<h2>（寄黄葉）</h2>
<p><a href="2297.html">黄葉の過ぎかてぬ子を人妻と見つつやあらむ恋しきものを</a></p>
<h2>寄月</h2>
<p><a href="2298.html">君に恋ひ萎えうらぶれ我が居れば秋風吹きて月かたぶきぬ</a></p>
<h2>（寄月）</h2>
<p><a href="2299.html">秋の夜の月かも君は雲隠りしましく見ねばここだ恋しき</a></p>
<h2>（寄月）</h2>
<p><a href="2300.html">九月の有明の月夜ありつつも君が来まさば我れ恋ひめやも</a></p>
<h2>寄夜</h2>
<p><a href="2301.html">よしゑやし恋ひじとすれど秋風の寒く吹く夜は君をしぞ思ふ</a></p>
<h2>（寄夜）</h2>
<p><a href="2302.html">ある人のあな心なと思ふらむ秋の長夜を寝覚め臥すのみ</a></p>
<h2>（寄夜）</h2>
<p><a href="2303.html">秋の夜を長しと言へど積もりにし恋を尽せば短くありけり</a></p>
<h2>寄衣</h2>
<p><a href="2304.html">秋つ葉ににほへる衣我れは着じ君に奉らば夜も着るがね</a></p>
<h2>問答</h2>
<p><a href="2305.html">旅にすら紐解くものを言繁みまろ寝ぞ我がする長きこの夜を</a></p>
<h2>（問答）</h2>
<p><a href="2306.html">しぐれ降る暁月夜紐解かず恋ふらむ君と居らましものを</a></p>
<h2>（問答）</h2>
<p><a href="2307.html">黄葉に置く白露の色端にも出でじと思へば言の繁けく</a></p>
<h2>（問答）</h2>
<p><a href="2308.html">雨降ればたぎつ山川岩に触れ君が砕かむ心は持たじ</a></p>
<h2>譬喩歌</h2>
<p><a href="2309.html">祝らが斎ふ社の黄葉も標縄越えて散るといふものを</a></p>
<h2>旋頭歌</h2>
<p><a href="2310.html">こほろぎの我が床の辺に鳴きつつもとな起き居つつ君に恋ふるに寐ねかてなくに</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2311.html">はだすすき穂には咲き出ぬ恋をぞ我がする玉かぎるただ一目のみ見し人ゆゑに</a></p>
<h2>冬雜歌</h2>
<p><a href="2312.html">我が袖に霰た走る巻き隠し消たずてあらむ妹が見むため</a></p>
<h2></h2>
<p><a href="2313.html">あしひきの山かも高き巻向の崖の小松にみ雪降りくる</a></p>
<h2></h2>
<p><a href="2314.html">巻向の桧原もいまだ雲居ねば小松が末ゆ沫雪流る</a></p>
<h2></h2>
<p><a href="2315.html">あしひきの山道も知らず白橿の枝もとををに雪の降れれば [或云 枝もたわたわ] </a></p>
<h2>詠雪</h2>
<p><a href="2316.html">奈良山の嶺なほ霧らふうべしこそ籬が下の雪は消ずけれ</a></p>
<h2>（詠雪）</h2>
<p><a href="2317.html">こと降らば袖さへ濡れて通るべく降りなむ雪の空に消につつ</a></p>
<h2>（詠雪）</h2>
<p><a href="2318.html">夜を寒み朝戸を開き出で見れば庭もはだらにみ雪降りたり [一云 庭もほどろに 雪ぞ降りたる] </a></p>
<h2>（詠雪）</h2>
<p><a href="2319.html">夕されば衣手寒し高松の山の木ごとに雪ぞ降りたる</a></p>
<h2>（詠雪）</h2>
<p><a href="2320.html">我が袖に降りつる雪も流れ行きて妹が手本にい行き触れぬか</a></p>
<h2>（詠雪）</h2>
<p><a href="2321.html">沫雪は今日はな降りそ白栲の袖まき干さむ人もあらなくに</a></p>
<h2>（詠雪）</h2>
<p><a href="2322.html">はなはだも降らぬ雪ゆゑこちたくも天つみ空は雲らひにつつ</a></p>
<h2>（詠雪）</h2>
<p><a href="2323.html">我が背子を今か今かと出で見れば沫雪降れり庭もほどろに</a></p>
<h2>（詠雪）</h2>
<p><a href="2324.html">あしひきの山に白きは我が宿に昨日の夕降りし雪かも</a></p>
<h2>詠花</h2>
<p><a href="2325.html">誰が園の梅の花ぞもひさかたの清き月夜にここだ散りくる</a></p>
<h2>（詠花）</h2>
<p><a href="2326.html">梅の花まづ咲く枝を手折りてばつとと名付けてよそへてむかも</a></p>
<h2>（詠花）</h2>
<p><a href="2327.html">誰が園の梅にかありけむここだくも咲きてあるかも見が欲しまでに</a></p>
<h2>（詠花）</h2>
<p><a href="2328.html">来て見べき人もあらなくに我家なる梅の初花散りぬともよし</a></p>
<h2>（詠花）</h2>
<p><a href="2329.html">雪寒み咲きには咲かぬ梅の花よしこのころはかくてもあるがね</a></p>
<h2>詠露</h2>
<p><a href="2330.html">妹がためほつ枝の梅を手折るとは下枝の露に濡れにけるかも</a></p>
<h2>詠黄葉</h2>
<p><a href="2331.html">八田の野の浅茅色づく有乳山嶺の沫雪寒く降るらし</a></p>
<h2>詠月</h2>
<p><a href="2332.html">さ夜更けば出で来む月を高山の嶺の白雲隠すらむかも</a></p>
<h2>冬相聞</h2>
<p><a href="2333.html">降る雪の空に消ぬべく恋ふれども逢ふよしなしに月ぞ経にける</a></p>
<h2></h2>
<p><a href="2334.html">沫雪は千重に降りしけ恋ひしくの日長き我れは見つつ偲はむ</a></p>
<h2>寄露</h2>
<p><a href="2335.html">咲き出照る梅の下枝に置く露の消ぬべく妹に恋ふるこのころ</a></p>
<h2>寄霜</h2>
<p><a href="2336.html">はなはだも夜更けてな行き道の辺の斎笹の上に霜の降る夜を</a></p>
<h2>寄雪</h2>
<p><a href="2337.html">笹の葉にはだれ降り覆ひ消なばかも忘れむと言へばまして思ほゆ</a></p>
<h2>（寄雪）</h2>
<p><a href="2338.html">霰降りいたく風吹き寒き夜や旗野に今夜我が独り寝む</a></p>
<h2>（寄雪）</h2>
<p><a href="2339.html">吉隠の野木に降り覆ふ白雪のいちしろくしも恋ひむ我れかも</a></p>
<h2>（寄雪）</h2>
<p><a href="2340.html">一目見し人に恋ふらく天霧らし降りくる雪の消ぬべく思ほゆ</a></p>
<h2>（寄雪）</h2>
<p><a href="2341.html">思ひ出づる時はすべなみ豊国の由布山雪の消ぬべく思ほゆ</a></p>
<h2>（寄雪）</h2>
<p><a href="2342.html">夢のごと君を相見て天霧らし降りくる雪の消ぬべく思ほゆ</a></p>
<h2>（寄雪）</h2>
<p><a href="2343.html">我が背子が言うるはしみ出でて行かば裳引きしるけむ雪な降りそね</a></p>
<h2>（寄雪）</h2>
<p><a href="2344.html">梅の花それとも見えず降る雪のいちしろけむな間使遣らば [一云 降る雪に間使遣らばそれと知らなむ] </a></p>
<h2>（寄雪）</h2>
<p><a href="2345.html">天霧らひ降りくる雪の消なめども君に逢はむとながらへわたる</a></p>
<h2>（寄雪）</h2>
<p><a href="2346.html">うかねらふ跡見山雪のいちしろく恋ひば妹が名人知らむかも</a></p>
<h2>（寄雪）</h2>
<p><a href="2347.html">海人小舟泊瀬の山に降る雪の日長く恋ひし君が音ぞする</a></p>
<h2>（寄雪）</h2>
<p><a href="2348.html">和射見の嶺行き過ぎて降る雪のいとひもなしと申せその子に</a></p>
<h2>寄花</h2>
<p><a href="2349.html">我が宿に咲きたる梅を月夜よみ宵々見せむ君をこそ待て</a></p>
<h2>寄夜</h2>
<p><a href="2350.html">あしひきの山のあらしは吹かねども君なき宵はかねて寒しも</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
