#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第十一巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第十一巻）</h1>

 <h2>旋頭歌</h2>
<p><a href="2351.html">新室の壁草刈りにいましたまはね草のごと寄り合ふ娘子は君がまにまに</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2352.html">新室を踏み鎮む子が手玉鳴らすも玉のごと照らせる君を内にと申せ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2353.html">泊瀬の斎槻が下に我が隠せる妻あかねさし照れる月夜に人見てむかも [一云 人見つらむか] </a></p>
<h2>（旋頭歌）</h2>
<p><a href="2354.html">ますらをの思ひ乱れて隠せるその妻天地に通り照るともあらはれめやも [一云 ますらをの思ひたけびて] </a></p>
<h2>（旋頭歌）</h2>
<p><a href="2355.html">愛しと我が思ふ妹は早も死なぬか生けりとも我れに寄るべしと人の言はなくに</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2356.html">高麗錦紐の片方ぞ床に落ちにける明日の夜し来なむと言はば取り置きて待たむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2357.html">朝戸出の君が足結を濡らす露原早く起き出でつつ我れも裳裾濡らさな</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2358.html">何せむに命をもとな長く欲りせむ生けりとも我が思ふ妹にやすく逢はなくに</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2359.html">息の緒に我れは思へど人目多みこそ吹く風にあらばしばしば逢ふべきものを</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2360.html">人の親処女児据ゑて守山辺から朝な朝な通ひし君が来ねば悲しも</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2361.html">天なる一つ棚橋いかにか行かむ若草の妻がりと言はば足飾りせむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2362.html">山背の久背の若子が欲しと言ふ我れあふさわに我れを欲しと言ふ山背の久世</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2363.html">岡の崎廻みたる道を人な通ひそありつつも君が来まさむ避き道にせむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2364.html">玉垂の小簾のすけきに入り通ひ来ねたらちねの母が問はさば風と申さむ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2365.html">うちひさす宮道に逢ひし人妻ゆゑに玉の緒の思ひ乱れて寝る夜しぞ多き</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2366.html">まそ鏡見しかと思ふ妹も逢はぬかも玉の緒の絶えたる恋の繁きこのころ</a></p>
<h2>（旋頭歌）</h2>
<p><a href="2367.html">海原の道に乗りてや我が恋ひ居らむ大船のゆたにあるらむ人の子ゆゑに</a></p>
<h2>正述心緒</h2>
<p><a href="2368.html">たらちねの母が手離れかくばかりすべなきことはいまだせなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2369.html">人の寝る味寐は寝ずてはしきやし君が目すらを欲りし嘆かむ [或本歌云 君を思ふに明けにけるかも] </a></p>
<h2>（正述心緒）</h2>
<p><a href="2370.html">恋ひしなば恋ひも死ねとや玉桙の道行く人の言も告げなく</a></p>
<h2>（正述心緒）</h2>
<p><a href="2371.html">心には千重に思へど人に言はぬ我が恋妻を見むよしもがも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2372.html">かくばかり恋ひむものぞと知らませば遠くも見べくあらましものを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2373.html">いつはしも恋ひぬ時とはあらねども夕かたまけて恋ひはすべなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2374.html">かくのみし恋ひやわたらむたまきはる命も知らず年は経につつ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2375.html">我れゆ後生まれむ人は我がごとく恋する道にあひこすなゆめ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2376.html">ますらをの現し心も我れはなし夜昼といはず恋ひしわたれば</a></p>
<h2>（正述心緒）</h2>
<p><a href="2377.html">何せむに命継ぎけむ我妹子に恋ひぬ前にも死なましものを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2378.html">よしゑやし来まさぬ君を何せむにいとはず我れは恋ひつつ居らむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2379.html">見わたせば近き渡りをた廻り今か来ますと恋ひつつぞ居る</a></p>
<h2>（正述心緒）</h2>
<p><a href="2380.html">はしきやし誰が障ふれかも玉桙の道見忘れて君が来まさぬ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2381.html">君が目を見まく欲りしてこの二夜千年のごとも我は恋ふるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2382.html">うち日さす宮道を人は満ち行けど我が思ふ君はただひとりのみ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2383.html">世の中は常かくのみと思へどもはたた忘れずなほ恋ひにけり</a></p>
<h2>（正述心緒）</h2>
<p><a href="2384.html">我が背子は幸くいますと帰り来と我れに告げ来む人も来ぬかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2385.html">あらたまの五年経れど我が恋の跡なき恋のやまなくあやし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2386.html">巌すら行き通るべきますらをも恋といふことは後悔いにけり</a></p>
<h2>（正述心緒）</h2>
<p><a href="2387.html">日並べば人知りぬべし今日の日は千年のごともありこせぬかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2388.html">立ちて居てたづきも知らず思へども妹に告げねば間使も来ず</a></p>
<h2>（正述心緒）</h2>
<p><a href="2389.html">ぬばたまのこの夜な明けそ赤らひく朝行く君を待たば苦しも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2390.html">恋するに死するものにあらませば我が身は千たび死にかへらまし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2391.html">玉かぎる昨日の夕見しものを今日の朝に恋ふべきものか</a></p>
<h2>（正述心緒）</h2>
<p><a href="2392.html">なかなかに見ずあらましを相見てゆ恋ほしき心まして思ほゆ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2393.html">玉桙の道行かずあらばねもころのかかる恋には逢はざらましを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2394.html">朝影に我が身はなりぬ玉かきるほのかに見えて去にし子ゆゑに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2395.html">行き行きて逢はぬ妹ゆゑひさかたの天露霜に濡れにけるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2396.html">たまさかに我が見し人をいかならむよしをもちてかまた一目見む</a></p>
<h2>（正述心緒）</h2>
<p><a href="2397.html">しましくも見ぬば恋ほしき我妹子を日に日に来れば言の繁けく</a></p>
<h2>（正述心緒）</h2>
<p><a href="2398.html">たまきはる世までと定め頼みたる君によりてし言の繁けく</a></p>
<h2>（正述心緒）</h2>
<p><a href="2399.html">赤らひく肌も触れずて寐ぬれども心を異には我が思はなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2400.html">いで何かここだはなはだ利心の失するまで思ふ恋ゆゑにこそ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2401.html">恋ひ死なば恋ひも死ねとか我妹子が我家の門を過ぎて行くらむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2402.html">妹があたり遠くも見ればあやしくも我れは恋ふるか逢ふよしなしに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2403.html">玉くせの清き川原にみそぎして斎ふ命は妹がためこそ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2404.html">思ひ寄り見ては寄りにしものにあれば一日の間も忘れて思へや</a></p>
<h2>（正述心緒）</h2>
<p><a href="2405.html">垣ほなす人は言へども高麗錦紐解き開けし君ならなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2406.html">高麗錦紐解き開けて夕だに知らずある命恋ひつつかあらむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2407.html">百積の船隠り入る八占さし母は問ふともその名は告らじ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2408.html">眉根掻き鼻ひ紐解け待つらむかいつかも見むと思へる我れを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2409.html">君に恋ひうらぶれ居れば悔しくも我が下紐の結ふ手いたづらに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2410.html">あらたまの年は果つれど敷栲の袖交へし子を忘れて思へや</a></p>
<h2>（正述心緒）</h2>
<p><a href="2411.html">白栲の袖をはつはつ見しからにかかる恋をも我れはするかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2412.html">我妹子に恋ひすべながり夢に見むと我れは思へど寐ねらえなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2413.html">故もなく我が下紐を解けしめて人にな知らせ直に逢ふまでに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2414.html">恋ふること慰めかねて出でて行けば山を川をも知らず来にけり</a></p>
<h2>寄物陳思</h2>
<p><a href="2415.html">娘子らを袖振る山の瑞垣の久しき時ゆ思ひけり我れは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2416.html">ちはやぶる神の持たせる命をば誰がためにかも長く欲りせむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2417.html">石上布留の神杉神さぶる恋をも我れはさらにするかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2418.html">いかならむ名負ふ神に手向けせば我が思ふ妹を夢にだに見む</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2419.html">天地といふ名の絶えてあらばこそ汝と我れと逢ふことやまめ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2420.html">月見れば国は同じぞ山へなり愛し妹はへなりたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2421.html">来る道は岩踏む山はなくもがも我が待つ君が馬つまづくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2422.html">岩根踏みへなれる山はあらねども逢はぬ日まねみ恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2423.html">道の後深津島山しましくも君が目見ねば苦しかりけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2424.html">紐鏡能登香の山も誰がゆゑか君来ませるに紐解かず寝む</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2425.html">山科の木幡の山を馬はあれど徒歩より我が来し汝を思ひかねて</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2426.html">遠山に霞たなびきいや遠に妹が目見ねば我れ恋ひにけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2427.html">宇治川の瀬々のしき波しくしくに妹は心に乗りにけるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2428.html">ちはや人宇治の渡りの瀬を早み逢はずこそあれ後も我が妻</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2429.html">はしきやし逢はぬ子ゆゑにいたづらに宇治川の瀬に裳裾濡らしつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2430.html">宇治川の水泡さかまき行く水の事かへらずぞ思ひ染めてし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2431.html">鴨川の後瀬静けく後も逢はむ妹には我れは今ならずとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2432.html">言に出でて言はばゆゆしみ山川のたぎつ心を塞かへたりけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2433.html">水の上に数書くごとき我が命妹に逢はむとうけひつるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2434.html">荒礒越し外行く波の外心我れは思はじ恋ひて死ぬとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2435.html">近江の海沖つ白波知らずとも妹がりといはば七日越え来む</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2436.html">大船の香取の海にいかり下ろしいかなる人か物思はずあらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2437.html">沖つ裳を隠さふ波の五百重波千重しくしくに恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2438.html">人言はしましぞ我妹綱手引く海ゆまさりて深くしぞ思ふ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2439.html">近江の海沖つ島山奥まけて我が思ふ妹が言の繁けく</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2440.html">近江の海沖漕ぐ舟のいかり下ろし隠りて君が言待つ我れぞ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2441.html">隠り沼の下ゆ恋ふればすべをなみ妹が名告りつ忌むべきものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2442.html">大地は取り尽すとも世の中の尽しえぬものは恋にしありけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2443.html">隠りどの沢泉なる岩が根も通してぞ思ふ我が恋ふらくは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2444.html">白真弓石辺の山の常磐なる命なれやも恋ひつつ居らむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2445.html">近江の海沈く白玉知らずして恋ひせしよりは今こそまされ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2446.html">白玉を巻きてぞ持てる今よりは我が玉にせむ知れる時だに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2447.html">白玉を手に巻きしより忘れじと思ひけらくは何か終らむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2448.html">白玉の間開けつつ貫ける緒もくくり寄すれば後もあふものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2449.html">香具山に雲居たなびきおほほしく相見し子らを後恋ひむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2450.html">雲間よりさ渡る月のおほほしく相見し子らを見むよしもがも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2451.html">天雲の寄り合ひ遠み逢はずとも異し手枕我れまかめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2452.html">雲だにもしるくし立たば慰めて見つつも居らむ直に逢ふまでに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2453.html">春柳葛城山に立つ雲の立ちても居ても妹をしぞ思ふ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2454.html">春日山雲居隠りて遠けども家は思はず君をしぞ思ふ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2455.html">我がゆゑに言はれし妹は高山の嶺の朝霧過ぎにけむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2456.html">ぬばたまの黒髪山の山菅に小雨降りしきしくしく思ほゆ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2457.html">大野らに小雨降りしく木の下に時と寄り来ね我が思ふ人</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2458.html">朝霜の消なば消ぬべく思ひつついかにこの夜を明かしてむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2459.html">我が背子が浜行く風のいや早に言を早みかいや逢はずあらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2460.html">遠き妹が振り放け見つつ偲ふらむこの月の面に雲なたなびき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2461.html">山の端を追ふ三日月のはつはつに妹をぞ見つる恋ほしきまでに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2462.html">我妹子し我れを思はばまそ鏡照り出づる月の影に見え来ね</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2463.html">久方の天照る月の隠りなば何になそへて妹を偲はむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2464.html">三日月のさやにも見えず雲隠り見まくぞ欲しきうたてこのころ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2465.html">我が背子に我が恋ひ居れば我が宿の草さへ思ひうらぶれにけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2466.html">浅茅原小野に標結ふ空言をいかなりと言ひて君をし待たむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2467.html">道の辺の草深百合の後もと言ふ妹が命を我れ知らめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2468.html">港葦に交じれる草のしり草の人皆知りぬ我が下思ひは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2469.html">山ぢさの白露重みうらぶれて心も深く我が恋やまず</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2470.html">港にさ根延ふ小菅ぬすまはず君に恋ひつつありかてぬかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2471.html">山背の泉の小菅なみなみに妹が心を我が思はなくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2472.html">見わたしの三室の山の巌菅ねもころ我れは片思ぞする [一云 みもろの山の岩小菅] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2473.html">菅の根のねもころ君が結びてし我が紐の緒を解く人もなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2474.html">山菅の乱れ恋のみせしめつつ逢はぬ妹かも年は経につつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2475.html">我が宿の軒にしだ草生ひたれど恋忘れ草見れどいまだ生ひず</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2476.html">打つ田には稗はしあまたありといへど選えし我れぞ夜をひとり寝る</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2477.html">あしひきの名負ふ山菅押し伏せて君し結ばば逢はずあらめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2478.html">秋柏潤和川辺の小竹の芽の人には忍び君に堪へなくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2479.html">さね葛後も逢はむと夢のみにうけひわたりて年は経につつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2480.html">道の辺のいちしの花のいちしろく人皆知りぬ我が恋妻は [或本歌曰 いちしろく人知りにけり継ぎてし思へば] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2481.html">大野らにたどきも知らず標結ひてありかつましじ我が恋ふらくは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2482.html">水底に生ふる玉藻のうち靡き心は寄りて恋ふるこのころ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2483.html">敷栲の衣手離れて玉藻なす靡きか寝らむ我を待ちかてに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2484.html">君来ずは形見にせむと我がふたり植ゑし松の木君を待ち出でむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2485.html">袖振らば見ゆべき限り我れはあれどその松が枝に隠らひにけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2486.html">茅渟の海の浜辺の小松根深めて我れ恋ひわたる人の子ゆゑに</a></p>
<h2>（寄物陳思）或本歌&lt;曰&gt;</h2>
<p><a href="2486S.html">茅渟の海の潮干の小松ねもころに恋ひやわたらむ人の子ゆゑに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2487.html">奈良山の小松が末のうれむぞは我が思ふ妹に逢はずやみなむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2488.html">礒の上に立てるむろの木ねもころに何しか深め思ひそめけむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2489.html">橘の本に我を立て下枝取りならむや君と問ひし子らはも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2490.html">天雲に翼打ちつけて飛ぶ鶴のたづたづしかも君しまさねば</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2491.html">妹に恋ひ寐ねぬ朝明にをし鳥のこゆかく渡る妹が使か</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2492.html">思ひにしあまりにしかばにほ鳥のなづさひ来しを人見けむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2493.html">高山の嶺行くししの友を多み袖振らず来ぬ忘ると思ふな</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2494.html">大船に真楫しじ貫き漕ぐほともここだ恋ふるを年にあらばいかに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2495.html">たらつねの母が養ふ蚕の繭隠り隠れる妹を見むよしもがも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2496.html">肥人の額髪結へる染木綿の染みにし心我れ忘れめや [一云 忘らえめやも] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2497.html">隼人の名に負ふ夜声のいちしろく我が名は告りつ妻と頼ませ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2498.html">剣大刀諸刃の利きに足踏みて死なば死なむよ君によりては</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2499.html">我妹子に恋ひしわたれば剣大刀名の惜しけくも思ひかねつも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2500.html">朝月の日向黄楊櫛古りぬれど何しか君が見れど飽かざらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2501.html">里遠み恋ひうらぶれぬまそ鏡床の辺去らず夢に見えこそ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2502.html">まそ鏡手に取り持ちて朝な朝な見れども君は飽くこともなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2503.html">夕されば床の辺去らぬ黄楊枕何しか汝れが主待ちかたき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2504.html">解き衣の恋ひ乱れつつ浮き真砂生きても我れはありわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2505.html">梓弓引きてゆるさずあらませばかかる恋にはあはざらましを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2506.html">言霊の八十の街に夕占問ふ占まさに告る妹は相寄らむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2507.html">玉桙の道行き占に占なへば妹に逢はむと我れに告りつも</a></p>
<h2>問答</h2>
<p><a href="2508.html">すめろぎの神の御門を畏みとさもらふ時に逢へる君かも</a></p>
<h2>（問答）</h2>
<p><a href="2509.html">まそ鏡見とも言はめや玉かぎる岩垣淵の隠りたる妻</a></p>
<h2>（問答）</h2>
<p><a href="2510.html">赤駒が足掻速けば雲居にも隠り行かむぞ袖まけ我妹</a></p>
<h2>（問答）</h2>
<p><a href="2511.html">こもりくの豊泊瀬道は常滑のかしこき道ぞ恋ふらくはゆめ</a></p>
<h2>（問答）</h2>
<p><a href="2512.html">味酒のみもろの山に立つ月の見が欲し君が馬の音ぞする</a></p>
<h2>（問答）</h2>
<p><a href="2513.html">鳴る神の少し響みてさし曇り雨も降らぬか君を留めむ</a></p>
<h2>（問答）</h2>
<p><a href="2514.html">鳴る神の少し響みて降らずとも我は留まらむ妹し留めば</a></p>
<h2>（問答）</h2>
<p><a href="2515.html">敷栲の枕響みて夜も寝ず思ふ人には後も逢ふものを</a></p>
<h2>（問答）</h2>
<p><a href="2516.html">敷栲の枕は人に言とへやその枕には苔生しにたり</a></p>
<h2>正述心緒</h2>
<p><a href="2517.html">たらちねの母に障らばいたづらに汝も我れも事なるべしや</a></p>
<h2>（正述心緒）</h2>
<p><a href="2518.html">我妹子が我れを送ると白栲の袖漬つまでに泣きし思ほゆ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2519.html">奥山の真木の板戸を押し開きしゑや出で来ね後は何せむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2520.html">刈り薦の一重を敷きてさ寝れども君とし寝れば寒けくもなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2521.html">かきつはた丹つらふ君をいささめに思ひ出でつつ嘆きつるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2522.html">恨めしと思ふさなはにありしかば外のみぞ見し心は思へど</a></p>
<h2>（正述心緒）</h2>
<p><a href="2523.html">さ丹つらふ色には出でず少なくも心のうちに我が思はなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2524.html">我が背子に直に逢はばこそ名は立ため言の通ひに何かそこゆゑ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2525.html">ねもころに片思ひすれかこのころの我が心どの生けるともなき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2526.html">待つらむに至らば妹が嬉しみと笑まむ姿を行きて早見む</a></p>
<h2>（正述心緒）</h2>
<p><a href="2527.html">誰れぞこの我が宿来呼ぶたらちねの母に嘖はえ物思ふ我れを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2528.html">さ寝ぬ夜は千夜もありとも我が背子が思ひ悔ゆべき心は持たじ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2529.html">家人は道もしみみに通へども我が待つ妹が使来ぬかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2530.html">あらたまの寸戸が竹垣網目ゆも妹し見えなば我れ恋ひめやも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2531.html">我が背子がその名告らじとたまきはる命は捨てつ忘れたまふな</a></p>
<h2>（正述心緒）</h2>
<p><a href="2532.html">おほならば誰が見むとかもぬばたまの我が黒髪を靡けて居らむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2533.html">面忘れいかなる人のするものぞ我れはしかねつ継ぎてし思へば</a></p>
<h2>（正述心緒）</h2>
<p><a href="2534.html">相思はぬ人のゆゑにかあらたまの年の緒長く我が恋ひ居らむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2535.html">おほろかの心は思はじ我がゆゑに人に言痛く言はれしものを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2536.html">息の緒に妹をし思へば年月の行くらむ別も思ほえぬかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2537.html">たらちねの母に知らえず我が持てる心はよしゑ君がまにまに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2538.html">ひとり寝と薦朽ちめやも綾席緒になるまでに君をし待たむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2539.html">相見ては千年やいぬるいなをかも我れやしか思ふ君待ちかてに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2540.html">振分けの髪を短み青草を髪にたくらむ妹をしぞ思ふ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2541.html">た廻り行箕の里に妹を置きて心空にあり地は踏めども</a></p>
<h2>（正述心緒）</h2>
<p><a href="2542.html">若草の新手枕をまきそめて夜をや隔てむ憎くあらなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2543.html">我が恋ふることも語らひ慰めむ君が使を待ちやかねてむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2544.html">うつつには逢ふよしもなし夢にだに間なく見え君恋ひに死ぬべし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2545.html">誰ぞかれと問はば答へむすべをなみ君が使を帰しやりつも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2546.html">思はぬに至らば妹が嬉しみと笑まむ眉引き思ほゆるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2547.html">かくばかり恋ひむものぞと思はねば妹が手本をまかぬ夜もありき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2548.html">かくだにも我れは恋ひなむ玉梓の君が使を待ちやかねてむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2549.html">妹に恋ひ我が泣く涙敷栲の木枕通り袖さへ濡れぬ [或本歌曰 枕通りてまけば寒しも] </a></p>
<h2>（正述心緒）</h2>
<p><a href="2550.html">立ちて思ひ居てもぞ思ふ紅の赤裳裾引き去にし姿を</a></p>
<h2>（正述心緒）</h2>
<p><a href="2551.html">思ひにしあまりにしかばすべをなみ出でてぞ行きしその門を見に</a></p>
<h2>（正述心緒）</h2>
<p><a href="2552.html">心には千重しくしくに思へども使を遣らむすべの知らなく</a></p>
<h2>（正述心緒）</h2>
<p><a href="2553.html">夢のみに見てすらここだ恋ふる我はうつつに見てばましていかにあらむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2554.html">相見ては面隠さゆるものからに継ぎて見まくの欲しき君かも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2555.html">朝戸を早くな開けそあぢさはふ目が欲る君が今夜来ませる</a></p>
<h2>（正述心緒）</h2>
<p><a href="2556.html">玉垂の小簾の垂簾を行きかちに寐は寝さずとも君は通はせ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2557.html">たらちねの母に申さば君も我れも逢ふとはなしに年ぞ経ぬべき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2558.html">愛しと思へりけらしな忘れと結びし紐の解くらく思へば</a></p>
<h2>（正述心緒）</h2>
<p><a href="2559.html">昨日見て今日こそ隔て我妹子がここだく継ぎて見まくし欲しも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2560.html">人もなき古りにし里にある人をめぐくや君が恋に死なする</a></p>
<h2>（正述心緒）</h2>
<p><a href="2561.html">人言の繁き間守りて逢ふともやなほ我が上に言の繁けむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2562.html">里人の言寄せ妻を荒垣の外にや我が見む憎くあらなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2563.html">人目守る君がまにまに我れさへに早く起きつつ裳の裾濡れぬ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2564.html">ぬばたまの妹が黒髪今夜もか我がなき床に靡けて寝らむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2565.html">花ぐはし葦垣越しにただ一目相見し子ゆゑ千たび嘆きつ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2566.html">色に出でて恋ひば人見て知りぬべし心のうちの隠り妻はも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2567.html">相見ては恋慰むと人は言へど見て後にぞも恋まさりける</a></p>
<h2>（正述心緒）</h2>
<p><a href="2568.html">おほろかに我れし思はばかくばかり難き御門を罷り出めやも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2569.html">思ふらむその人なれやぬばたまの夜ごとに君が夢にし見ゆる [或本歌曰 夜昼と言はずあが恋ひわたる] </a></p>
<h2>（正述心緒）</h2>
<p><a href="2570.html">かくのみし恋ひば死ぬべみたらちねの母にも告げずやまず通はせ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2571.html">大夫は友の騒きに慰もる心もあらむ我れぞ苦しき</a></p>
<h2>（正述心緒）</h2>
<p><a href="2572.html">偽りも似つきてぞするいつよりか見ぬ人恋ふに人の死せし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2573.html">心さへ奉れる君に何をかも言はず言ひしと我がぬすまはむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2574.html">面忘れだにもえすやと手握りて打てども懲りず恋といふ奴</a></p>
<h2>（正述心緒）</h2>
<p><a href="2575.html">めづらしき君を見むとこそ左手の弓取る方の眉根掻きつれ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2576.html">人間守り葦垣越しに我妹子を相見しからに言ぞさだ多き</a></p>
<h2>（正述心緒）</h2>
<p><a href="2577.html">今だにも目な乏しめそ相見ずて恋ひむ年月久しけまくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2578.html">朝寝髪我れは梳らじうるはしき君が手枕触れてしものを</a></p>
<h2>（正述心緒）</h2>
<p><a href="2579.html">早行きていつしか君を相見むと思ひし心今ぞなぎぬる</a></p>
<h2>（正述心緒）</h2>
<p><a href="2580.html">面形の忘るとあらばあづきなく男じものや恋ひつつ居らむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2581.html">言に言へば耳にたやすし少なくも心のうちに我が思はなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2582.html">あづきなく何のたはこと今さらに童言する老人にして</a></p>
<h2>（正述心緒）</h2>
<p><a href="2583.html">相見ては幾久さにもあらなくに年月のごと思ほゆるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2584.html">ますらをと思へる我れをかくばかり恋せしむるは悪しくはありけり</a></p>
<h2>（正述心緒）</h2>
<p><a href="2585.html">かくしつつ我が待つ験あらぬかも世の人皆の常にあらなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2586.html">人言を繁みと君に玉梓の使も遣らず忘ると思ふな</a></p>
<h2>（正述心緒）</h2>
<p><a href="2587.html">大原の古りにし里に妹を置きて我れ寐ねかねつ夢に見えこそ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2588.html">夕されば君来まさむと待ちし夜のなごりぞ今も寐ねかてにする</a></p>
<h2>（正述心緒）</h2>
<p><a href="2589.html">相思はず君はあるらしぬばたまの夢にも見えずうけひて寝れど</a></p>
<h2>（正述心緒）</h2>
<p><a href="2590.html">岩根踏み夜道は行かじと思へれど妹によりては忍びかねつも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2591.html">人言の繁き間守ると逢はずあらばつひにや子らが面忘れなむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2592.html">恋死なむ後は何せむ我が命生ける日にこそ見まく欲りすれ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2593.html">敷栲の枕響みて寐ねらえず物思ふ今夜早も明けぬかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2594.html">行かぬ我れを来むとか夜も門閉さずあはれ我妹子待ちつつあるらむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2595.html">夢にだに何かも見えぬ見ゆれども我れかも惑ふ恋の繁きに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2596.html">慰もる心はなしにかくのみし恋ひやわたらむ月に日に異に [或本歌曰 沖つ波しきてのみやも恋ひわたりなむ] </a></p>
<h2>（正述心緒）</h2>
<p><a href="2597.html">いかにして忘れむものぞ我妹子に恋はまされど忘らえなくに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2598.html">遠くあれど君にぞ恋ふる玉桙の里人皆に我れ恋ひめやも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2599.html">験なき恋をもするか夕されば人の手まきて寝らむ子ゆゑに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2600.html">百代しも千代しも生きてあらめやも我が思ふ妹を置きて嘆かむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2601.html">うつつにも夢にも我れは思はずき古りたる君にここに逢はむとは</a></p>
<h2>（正述心緒）</h2>
<p><a href="2602.html">黒髪の白髪までと結びてし心ひとつを今解かめやも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2603.html">心をし君に奉ると思へればよしこのころは恋ひつつをあらむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2604.html">思ひ出でて音には泣くともいちしろく人の知るべく嘆かすなゆめ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2605.html">玉桙の道行きぶりに思はぬに妹を相見て恋ふるころかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2606.html">人目多み常かくのみしさもらはばいづれの時か我が恋ひずあらむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2607.html">敷栲の衣手離れて我を待つとあるらむ子らは面影に見ゆ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2608.html">妹が袖別れし日より白栲の衣片敷き恋ひつつぞ寝る</a></p>
<h2>（正述心緒）</h2>
<p><a href="2609.html">白栲の袖はまゆひぬ我妹子が家のあたりをやまず振りしに</a></p>
<h2>（正述心緒）</h2>
<p><a href="2610.html">ぬばたまの我が黒髪を引きぬらし乱れてさらに恋ひわたるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2611.html">今さらに君が手枕まき寝めや我が紐の緒の解けつつもとな</a></p>
<h2>（正述心緒）</h2>
<p><a href="2612.html">白栲の袖触れてし夜我が背子に我が恋ふらくはやむ時もなし</a></p>
<h2>（正述心緒）</h2>
<p><a href="2613.html">夕占にも占にも告れる今夜だに来まさぬ君をいつとか待たむ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2614.html">眉根掻き下いふかしみ思へるにいにしへ人を相見つるかも</a></p>
<h2>（正述心緒）或本歌&lt;曰&gt;</h2>
<p><a href="2614S1.html">眉根掻き誰をか見むと思ひつつ日長く恋ひし妹に逢へるかも</a></p>
<h2>（正述心緒）一書歌曰</h2>
<p><a href="2614S2.html">眉根掻き下いふかしみ思へりし妹が姿を今日見つるかも</a></p>
<h2>（正述心緒）</h2>
<p><a href="2615.html">敷栲の枕をまきて妹と我れと寝る夜はなくて年ぞ経にける</a></p>
<h2>（正述心緒）</h2>
<p><a href="2616.html">奥山の真木の板戸を音早み妹があたりの霜の上に寝ぬ</a></p>
<h2>（正述心緒）</h2>
<p><a href="2617.html">あしひきの山桜戸を開け置きて我が待つ君を誰れか留むる</a></p>
<h2>（正述心緒）</h2>
<p><a href="2618.html">月夜よみ妹に逢はむと直道から我れは来つれど夜ぞ更けにける</a></p>
<h2>寄物陳思</h2>
<p><a href="2619.html">朝影に我が身はなりぬ韓衣裾のあはずて久しくなれば</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2620.html">解き衣の思ひ乱れて恋ふれどもなぞ汝がゆゑと問ふ人もなき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2621.html">摺り衣着りと夢に見つうつつにはいづれの人の言か繁けむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2622.html">志賀の海人の塩焼き衣なれぬれど恋といふものは忘れかねつも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2623.html">紅の八しほの衣朝な朝な馴れはすれどもいやめづらしも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2624.html">紅の深染めの衣色深く染みにしかばか忘れかねつる</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2625.html">逢はなくに夕占を問ふと幣に置くに我が衣手はまたぞ継ぐべき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2626.html">古衣打棄つる人は秋風の立ちくる時に物思ふものぞ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2627.html">はねかづら今する妹がうら若み笑みみ怒りみ付けし紐解く</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2628.html">いにしへの倭文機帯を結び垂れ誰れといふ人も君にはまさじ</a></p>
<h2>（寄物陳思）一書歌&lt;曰&gt;</h2>
<p><a href="2628S.html">いにしへの狭織の帯を結び垂れ誰れしの人も君にはまさじ </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2629.html">逢はずとも我れは恨みじこの枕我れと思ひてまきてさ寝ませ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2630.html">結へる紐解かむ日遠み敷栲の我が木枕は苔生しにけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2631.html">ぬばたまの黒髪敷きて長き夜を手枕の上に妹待つらむか</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2632.html">まそ鏡直にし妹を相見ずは我が恋やまじ年は経ぬとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2633.html">まそ鏡手に取り持ちて朝な朝な見む時さへや恋の繁けむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2634.html">里遠み恋わびにけりまそ鏡面影去らず夢に見えこそ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2635.html">剣大刀身に佩き添ふる大夫や恋といふものを忍びかねてむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2636.html">剣大刀諸刃の上に行き触れて死にかもしなむ恋ひつつあらずは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2637.html">うち鼻ひ鼻をぞひつる剣大刀身に添ふ妹し思ひけらしも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2638.html">梓弓末のはら野に鳥狩する君が弓弦の絶えむと思へや</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2639.html">葛城の襲津彦真弓新木にも頼めや君が我が名告りけむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2640.html">梓弓引きみ緩へみ来ずは来ず来ば来そをなぞ来ずは来ばそを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2641.html">時守の打ち鳴す鼓数みみれば時にはなりぬ逢はなくもあやし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2642.html">燈火の影にかがよふうつせみの妹が笑まひし面影に見ゆ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2643.html">玉桙の道行き疲れ稲席しきても君を見むよしもがも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2644.html">小治田の板田の橋の壊れなば桁より行かむな恋ひそ我妹</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2645.html">宮材引く泉の杣に立つ民のやむ時もなく恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2646.html">住吉の津守網引のうけの緒の浮かれか行かむ恋ひつつあらずは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2647.html">手作りを空ゆ引き越し遠みこそ目言離るらめ絶ゆと隔てや</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2648.html">かにかくに物は思はじ飛騨人の打つ墨縄のただ一道に</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2649.html">あしひきの山田守る翁が置く鹿火の下焦れのみ我が恋ひ居らむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2650.html">そき板もち葺ける板目のあはざらばいかにせむとか我が寝そめけむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2651.html">難波人葦火焚く屋の煤してあれどおのが妻こそ常めづらしき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2652.html">妹が髪上げ竹葉野の放れ駒荒びにけらし逢はなく思へば</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2653.html">馬の音のとどともすれば松蔭に出でてぞ見つるけだし君かと</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2654.html">君に恋ひ寐ねぬ朝明に誰が乗れる馬の足の音ぞ我れに聞かする</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2655.html">紅の裾引く道を中に置きて我れは通はむ君か来まさむ [一云 裾漬く川を 又曰 待ちにか待たむ] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2656.html">天飛ぶや軽の社の斎ひ槻幾代まであらむ隠り妻ぞも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2657.html">神なびにひもろき立てて斎へども人の心はまもりあへぬもの</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2658.html">天雲の八重雲隠り鳴る神の音のみにやも聞きわたりなむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2659.html">争へば神も憎ますよしゑやしよそふる君が憎くあらなくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2660.html">夜並べて君を来ませとちはやぶる神の社を祷まぬ日はなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2661.html">霊ぢはふ神も我れをば打棄てこそしゑや命の惜しけくもなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2662.html">我妹子にまたも逢はむとちはやぶる神の社を祷まぬ日はなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2663.html">ちはやぶる神の斎垣も越えぬべし今は我が名の惜しけくもなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2664.html">夕月夜暁闇の朝影に我が身はなりぬ汝を思ひかねに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2665.html">月しあれば明くらむ別も知らずして寝て我が来しを人見けむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2666.html">妹が目の見まく欲しけく夕闇の木の葉隠れる月待つごとし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2667.html">真袖持ち床うち掃ひ君待つと居りし間に月かたぶきぬ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2668.html">二上に隠らふ月の惜しけども妹が手本を離るるこのころ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2669.html">我が背子が振り放け見つつ嘆くらむ清き月夜に雲なたなびき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2670.html">まそ鏡清き月夜のゆつりなば思ひはやまず恋こそまさめ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2671.html">今夜の有明月夜ありつつも君をおきては待つ人もなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2672.html">この山の嶺に近しと我が見つる月の空なる恋もするかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2673.html">ぬばたまの夜渡る月のゆつりなばさらにや妹に我が恋ひ居らむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2674.html">朽網山夕居る雲の薄れゆかば我れは恋ひむな君が目を欲り</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2675.html">君が着る御笠の山に居る雲の立てば継がるる恋もするかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2676.html">ひさかたの天飛ぶ雲にありてしか君をば相見むおつる日なしに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2677.html">佐保の内ゆあらしの風の吹きぬれば帰りは知らに嘆く夜ぞ多き</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2678.html">はしきやし吹かぬ風ゆゑ玉櫛笥開けてさ寝にし我れぞ悔しき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2679.html">窓越しに月おし照りてあしひきのあらし吹く夜は君をしぞ思ふ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2680.html">川千鳥棲む沢の上に立つ霧のいちしろけむな相言ひそめてば</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2681.html">我が背子が使を待つと笠も着ず出でつつぞ見し雨の降らくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2682.html">韓衣君にうち着せ見まく欲り恋ひぞ暮らしし雨の降る日を</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2683.html">彼方の埴生の小屋に小雨降り床さへ濡れぬ身に添へ我妹</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2684.html">笠なしと人には言ひて雨障み留まりし君が姿し思ほゆ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2685.html">妹が門行き過ぎかねつひさかたの雨も降らぬかそをよしにせむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2686.html">夕占問ふ我が袖に置く白露を君に見せむと取れば消につつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2687.html">桜麻の麻生の下草露しあれば明かしてい行け母は知るとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2688.html">待ちかねて内には入らじ白栲の我が衣手に露は置きぬとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2689.html">朝露の消やすき我が身老いぬともまたをちかへり君をし待たむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2690.html">白栲の我が衣手に露は置き妹は逢はさずたゆたひにして</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2691.html">かにかくに物は思はじ朝露の我が身ひとつは君がまにまに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2692.html">夕凝りの霜置きにけり朝戸出にいたくし踏みて人に知らゆな</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2693.html">かくばかり恋ひつつあらずは朝に日に妹が踏むらむ地にあらましを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2694.html">あしひきの山鳥の尾の一峰越え一目見し子に恋ふべきものか</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2695.html">我妹子に逢ふよしをなみ駿河なる富士の高嶺の燃えつつかあらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2696.html">荒熊のすむといふ山の師歯迫山責めて問ふとも汝が名は告らじ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2697.html">妹が名も我が名も立たば惜しみこそ富士の高嶺の燃えつつわたれ</a></p>
<h2>（寄物陳思）或歌曰</h2>
<p><a href="2697S.html">君が名も我が名も立たば惜しみこそ富士の高嶺の燃えつつも居れ </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2698.html">行きて見て来れば恋ほしき朝香潟山越しに置きて寐ねかてぬかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2699.html">阿太人の梁打ち渡す瀬を早み心は思へど直に逢はぬかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2700.html">玉かぎる岩垣淵の隠りには伏して死ぬとも汝が名は告らじ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2701.html">明日香川明日も渡らむ石橋の遠き心は思ほえぬかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2702.html">明日香川水行きまさりいや日異に恋のまさらばありかつましじ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2703.html">ま薦刈る大野川原の水隠りに恋ひ来し妹が紐解く我れは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2704.html">あしひきの山下響み行く水の時ともなくも恋ひわたるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2705.html">はしきやし逢はぬ君ゆゑいたづらにこの川の瀬に玉裳濡らしつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2706.html">泊瀬川早み早瀬をむすび上げて飽かずや妹と問ひし君はも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2707.html">青山の岩垣沼の水隠りに恋ひやわたらむ逢ふよしをなみ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2708.html">しなが鳥猪名山響に行く水の名のみ寄そりし隠り妻はも [一云 名のみ寄そりて恋ひつつやあらむ] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2709.html">我妹子に我が恋ふらくは水ならばしがらみ越して行くべく思ほゆ [或本歌發句云 相思はぬ人を思はく] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2710.html">犬上の鳥籠の山なる不知哉川いさとを聞こせ我が名告らすな</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2711.html">奥山の木の葉隠りて行く水の音聞きしより常忘らえず</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2712.html">言急くは中は淀ませ水無川絶ゆといふことをありこすなゆめ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2713.html">明日香川行く瀬を早み早けむと待つらむ妹をこの日暮らしつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2714.html">もののふの八十宇治川の早き瀬に立ちえぬ恋も我れはするかも [一云 立ちても君は忘れかねつも] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2715.html">神なびの打廻の崎の岩淵の隠りてのみや我が恋ひ居らむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2716.html">高山ゆ出で来る水の岩に触れ砕けてぞ思ふ妹に逢はぬ夜は</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2717.html">朝東風にゐで越す波の外目にも逢はぬものゆゑ瀧もとどろに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2718.html">高山の岩もとたぎち行く水の音には立てじ恋ひて死ぬとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2719.html">隠り沼の下に恋ふれば飽き足らず人に語りつ忌むべきものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2720.html">水鳥の鴨の棲む池の下樋なみいぶせき君を今日見つるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2721.html">玉藻刈るゐでのしがらみ薄みかも恋の淀める我が心かも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2722.html">我妹子が笠のかりての和射見野に我れは入りぬと妹に告げこそ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2723.html">あまたあらぬ名をしも惜しみ埋れ木の下ゆぞ恋ふるゆくへ知らずて</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2724.html">秋風の千江の浦廻の木屑なす心は寄りぬ後は知らねど</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2725.html">白真砂御津の埴生の色に出でて言はなくのみぞ我が恋ふらくは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2726.html">風吹かぬ浦に波立ちなき名をも我れは負へるか逢ふとはなしに [一云 女と思ひて] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2727.html">酢蛾島の夏身の浦に寄する波間も置きて我が思はなくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2728.html">近江の海沖つ島山奥まへて我が思ふ妹が言の繁けく</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2729.html">霰降り遠つ大浦に寄する波よしも寄すとも憎くあらなくに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2730.html">紀の海の名高の浦に寄する波音高きかも逢はぬ子ゆゑに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2731.html">牛窓の波の潮騒島響み寄そりし君は逢はずかもあらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2732.html">沖つ波辺波の来寄る佐太の浦のこのさだ過ぎて後恋ひむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2733.html">白波の来寄する島の荒礒にもあらましものを恋ひつつあらずは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2734.html">潮満てば水泡に浮かぶ真砂にも我はなりてしか恋ひは死なずて</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2735.html">住吉の岸の浦廻にしく波のしくしく妹を見むよしもがも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2736.html">風をいたみいたぶる波の間なく我が思ふ君は相思ふらむか</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2737.html">大伴の御津の白波間なく我が恋ふらくを人の知らなく</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2738.html">大船のたゆたふ海にいかり下ろしいかにせばかも我が恋やまむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2739.html">みさご居る沖つ荒礒に寄する波ゆくへも知らず我が恋ふらくは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2740.html">大船の艫にも舳にも寄する波寄すとも我れは君がまにまに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2741.html">大海に立つらむ波は間あらむ君に恋ふらくやむ時もなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2742.html">志賀の海人の煙焼き立て焼く塩の辛き恋をも我れはするかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2743.html">なかなかに君に恋ひずは比良の浦の海人ならましを玉藻刈りつつ</a></p>
<h2>（寄物陳思）或本歌曰</h2>
<p><a href="2743S.html">なかなかに君に恋ひずは縄の浦の海人にあらましを玉藻刈る刈る </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2744.html">鱸取る海人の燈火外にだに見ぬ人ゆゑに恋ふるこのころ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2745.html">港入りの葦別け小舟障り多み我が思ふ君に逢はぬころかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2746.html">庭清み沖へ漕ぎ出る海人舟の楫取る間なき恋もするかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2747.html">あぢかまの塩津をさして漕ぐ船の名は告りてしを逢はざらめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2748.html">大船に葦荷刈り積みしみみにも妹は心に乗りにけるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2749.html">駅路に引き舟渡し直乗りに妹は心に乗りにけるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2750.html">我妹子に逢はず久しもうましもの安倍橘の苔生すまでに</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2751.html">あぢの住む渚沙の入江の荒礒松我を待つ子らはただ独りのみ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2752.html">我妹子を聞き都賀野辺のしなひ合歓木我れは忍びず間なくし思へば</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2753.html">波の間ゆ見ゆる小島の浜久木久しくなりぬ君に逢はずして</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2754.html">朝柏潤八川辺の小竹の芽の偲ひて寝れば夢に見えけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2755.html">浅茅原刈り標さして空言も寄そりし君が言をし待たむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2756.html">月草の借れる命にある人をいかに知りてか後も逢はむと言ふ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2757.html">大君の御笠に縫へる有間菅ありつつ見れど事なき我妹</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2758.html">菅の根のねもころ妹に恋ふるにし大夫心思ほえぬかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2759.html">我が宿の穂蓼古幹摘み生し実になるまでに君をし待たむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2760.html">あしひきの山沢ゑぐを摘みに行かむ日だにも逢はせ母は責むとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2761.html">奥山の岩本菅の根深くも思ほゆるかも我が思ひ妻は</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2762.html">葦垣の中の和草にこやかに我れと笑まして人に知らゆな</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2763.html">紅の浅葉の野らに刈る草の束の間も我を忘らすな</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2764.html">妹がため命残せり刈り薦の思ひ乱れて死ぬべきものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2765.html">我妹子に恋つつあらずは刈り薦の思ひ乱れて死ぬべきものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2766.html">三島江の入江の薦を刈りにこそ我れをば君は思ひたりけれ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2767.html">あしひきの山橘の色に出でて我は恋なむを人目難みすな</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2768.html">葦鶴の騒く入江の白菅の知らせむためと言痛かるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2769.html">我が背子に我が恋ふらくは夏草の刈り除くれども生ひしくごとし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2770.html">道の辺のいつ柴原のいつもいつも人の許さむ言をし待たむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2771.html">我妹子が袖を頼みて真野の浦の小菅の笠を着ずて来にけり</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2772.html">真野の池の小菅を笠に縫はずして人の遠名を立つべきものか</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2773.html">さす竹の世隠りてあれ我が背子が我がりし来ずは我れ恋めやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2774.html">神奈備の浅小竹原のうるはしみ我が思ふ君が声のしるけく</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2775.html">山高み谷辺に延へる玉葛絶ゆる時なく見むよしもがも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2776.html">道の辺の草を冬野に踏み枯らし我れ立ち待つと妹に告げこそ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2777.html">畳薦へだて編む数通はさば道の芝草生ひずあらましを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2778.html">水底に生ふる玉藻の生ひ出でずよしこのころはかくて通はむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2779.html">海原の沖つ縄海苔うち靡き心もしのに思ほゆるかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2780.html">紫の名高の浦の靡き藻の心は妹に寄りにしものを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2781.html">海の底奥を深めて生ふる藻のもとも今こそ恋はすべなき</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2782.html">さ寝がには誰れとも寝めど沖つ藻の靡きし君が言待つ我れを</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2783.html">我妹子が何とも我れを思はねばふふめる花の穂に咲きぬべし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2784.html">隠りには恋ひて死ぬともみ園生の韓藍の花の色に出でめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2785.html">咲く花は過ぐる時あれど我が恋ふる心のうちはやむ時もなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2786.html">山吹のにほへる妹がはねず色の赤裳の姿夢に見えつつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2787.html">天地の寄り合ひの極み玉の緒の絶えじと思ふ妹があたり見つ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2788.html">息の緒に思へば苦し玉の緒の絶えて乱れな知らば知るとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2789.html">玉の緒の絶えたる恋の乱れなば死なまくのみぞまたも逢はずして</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2790.html">玉の緒のくくり寄せつつ末つひに行きは別れず同じ緒にあらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2791.html">片糸もち貫きたる玉の緒を弱み乱れやしなむ人の知るべく</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2792.html">玉の緒の現し心や年月の行きかはるまで妹に逢はずあらむ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2793.html">玉の緒の間も置かず見まく欲り我が思ふ妹は家遠くありて</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2794.html">隠り津の沢たつみなる岩根ゆも通してぞ思ふ君に逢はまくは</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2795.html">紀の国の飽等の浜の忘れ貝我れは忘れじ年は経ぬとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2796.html">水くくる玉に交じれる磯貝の片恋ひのみに年は経につつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2797.html">住吉の浜に寄るといふうつせ貝実なき言もち我れ恋ひめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2798.html">伊勢の海人の朝な夕なに潜くといふ鰒の貝の片思にして</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2799.html">人言を繁みと君を鶉鳴く人の古家に語らひて遣りつ</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2800.html">暁と鶏は鳴くなりよしゑやしひとり寝る夜は明けば明けぬとも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2801.html">大海の荒礒の洲鳥朝な朝な見まく欲しきを見えぬ君かも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2802.html">思へども思ひもかねつあしひきの山鳥の尾の長きこの夜を</a></p>
<h2>（寄物陳思）或本歌&lt;曰&gt;</h2>
<p><a href="2802S.html">あしひきの山鳥の尾のしだり尾の長々し夜をひとりかも寝む </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2803.html">里中に鳴くなる鶏の呼び立てていたくは泣かぬ隠り妻はも [一云 里響め鳴くなる鶏の] </a></p>
<h2>（寄物陳思）</h2>
<p><a href="2804.html">高山にたかべさ渡り高々に我が待つ君を待ち出でむかも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2805.html">伊勢の海ゆ鳴き来る鶴の音どろも君が聞こさば我れ恋ひめやも</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2806.html">我妹子に恋ふれにかあらむ沖に棲む鴨の浮寝の安けくもなし</a></p>
<h2>（寄物陳思）</h2>
<p><a href="2807.html">明けぬべく千鳥しば鳴く白栲の君が手枕いまだ飽かなくに</a></p>
<h2>問答</h2>
<p><a href="2808.html">眉根掻き鼻ひ紐解け待てりやもいつかも見むと恋ひ来し我れを</a></p>
<h2>（問答）</h2>
<p><a href="2809.html">今日なれば鼻ひ鼻ひし眉かゆみ思ひしことは君にしありけり</a></p>
<h2>（問答）</h2>
<p><a href="2810.html">音のみを聞きてや恋ひむまそ鏡直目に逢ひて恋ひまくもいたく</a></p>
<h2>（問答）</h2>
<p><a href="2811.html">この言を聞かむとならしまそ鏡照れる月夜も闇のみに見つ</a></p>
<h2>（問答）</h2>
<p><a href="2812.html">我妹子に恋ひてすべなみ白栲の袖返ししは夢に見えきや</a></p>
<h2>（問答）</h2>
<p><a href="2813.html">我が背子が袖返す夜の夢ならしまことも君に逢ひたるごとし</a></p>
<h2>（問答）</h2>
<p><a href="2814.html">我が恋は慰めかねつま日長く夢に見えずて年の経ぬれば</a></p>
<h2>（問答）</h2>
<p><a href="2815.html">ま日長く夢にも見えず絶えぬとも我が片恋はやむ時もあらじ</a></p>
<h2>（問答）</h2>
<p><a href="2816.html">うらぶれて物な思ひそ天雲のたゆたふ心我が思はなくに</a></p>
<h2>（問答）</h2>
<p><a href="2817.html">うらぶれて物は思はじ水無瀬川ありても水は行くといふものを</a></p>
<h2>（問答）</h2>
<p><a href="2818.html">かきつはた佐紀沼の菅を笠に縫ひ着む日を待つに年ぞ経にける</a></p>
<h2>（問答）</h2>
<p><a href="2819.html">おしてる難波菅笠置き古し後は誰が着む笠ならなくに</a></p>
<h2>（問答）</h2>
<p><a href="2820.html">かくだにも妹を待ちなむさ夜更けて出で来し月のかたぶくまでに</a></p>
<h2>（問答）</h2>
<p><a href="2821.html">木の間より移ろふ月の影を惜しみ立ち廻るにさ夜更けにけり</a></p>
<h2>（問答）</h2>
<p><a href="2822.html">栲領布の白浜波の寄りもあへず荒ぶる妹に恋ひつつぞ居る [一云 恋ふるころかも] </a></p>
<h2>（問答）</h2>
<p><a href="2823.html">かへらまに君こそ我れに栲領巾の白浜波の寄る時もなき</a></p>
<h2>（問答）</h2>
<p><a href="2824.html">思ふ人来むと知りせば八重葎覆へる庭に玉敷かましを</a></p>
<h2>（問答）</h2>
<p><a href="2825.html">玉敷ける家も何せむ八重葎覆へる小屋も妹と居りせば</a></p>
<h2>（問答）</h2>
<p><a href="2826.html">かくしつつあり慰めて玉の緒の絶えて別ればすべなかるべし</a></p>
<h2>（問答）</h2>
<p><a href="2827.html">紅の花にしあらば衣手に染め付け持ちて行くべく思ほゆ</a></p>
<h2>譬喩</h2>
<p><a href="2828.html">紅の深染めの衣を下に着ば人の見らくににほひ出でむかも</a></p>
<h2>（譬喩）</h2>
<p><a href="2829.html">衣しも多くあらなむ取り替へて着ればや君が面忘れたる</a></p>
<h2>（譬喩）</h2>
<p><a href="2830.html">梓弓弓束巻き替へ中見さしさらに引くとも君がまにまに</a></p>
<h2>（譬喩）</h2>
<p><a href="2831.html">みさご居る洲に居る舟の夕潮を待つらむよりは我れこそまされ</a></p>
<h2>（譬喩）</h2>
<p><a href="2832.html">山川に筌を伏せて守りもあへず年の八年を我がぬすまひし</a></p>
<h2>（譬喩）</h2>
<p><a href="2833.html">葦鴨のすだく池水溢るともまけ溝の辺に我れ越えめやも</a></p>
<h2>（譬喩）</h2>
<p><a href="2834.html">大和の室生の毛桃本繁く言ひてしものをならずはやまじ</a></p>
<h2>（譬喩）</h2>
<p><a href="2835.html">ま葛延ふ小野の浅茅を心ゆも人引かめやも我がなけなくに</a></p>
<h2>（譬喩）</h2>
<p><a href="2836.html">三島菅いまだ苗なり時待たば着ずやなりなむ三島菅笠</a></p>
<h2>（譬喩）</h2>
<p><a href="2837.html">み吉野の水隈が菅を編まなくに刈りのみ刈りて乱りてむとや</a></p>
<h2>（譬喩）</h2>
<p><a href="2838.html">川上に洗ふ若菜の流れ来て妹があたりの瀬にこそ寄らめ</a></p>
<h2>（譬喩）</h2>
<p><a href="2839.html">かくしてやなほやまもらむ大荒木の浮田の社の標にあらなくに</a></p>
<h2>（譬喩）</h2>
<p><a href="2840.html">いくばくも降らぬ雨ゆゑ我が背子が御名のここだく瀧もとどろに</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
