#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第十六巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第十六巻）</h1>

 <h2>有由縁并雜歌 / 昔者有娘子  字曰櫻兒也  于時有二壮子  共誂此娘而捐生挌&lt;競&gt;貪死相敵  於是娘子戯欷曰  従古&lt;来&gt;今未聞未見一女之身徃適二門矣  方今壮子之意有難和平  不如妾死相害永息  尓乃尋入林中懸樹經死  其兩壮子不敢哀慟血泣漣襟  各陳心緒作歌二首</h2>
<p><a href="3786.html">春さらばかざしにせむと我が思ひし桜の花は散りにけるかも [其一]</a></p>
<h2>（昔物有娘子  字曰櫻兒也  于時有二壮子  共誂此娘而捐生挌&lt;競&gt;貪死相敵  於是娘子戯欷曰  従古&lt;来&gt;今未聞未見一女之見徃適二門矣  方今壮子之意有難和平  不如妾死相害永息  尓乃尋入林中懸樹經死  其兩壮子不敢哀慟血泣漣襟  各陳心緒作歌二首）</h2>
<p><a href="3787.html">妹が名に懸けたる桜花咲かば常にや恋ひむいや年のはに [其二]</a></p>
<h2>或曰  &lt;昔&gt;有三男同娉一女也  娘子嘆息曰  一女之身易滅如露  三雄之志難平如石  遂乃彷徨池上沈没水底  於時其壮士等不勝哀頽之至  各陳所心作歌三首  [娘子字曰&lt;イ&gt;兒也]</h2>
<p><a href="3788.html">耳成の池し恨めし我妹子が来つつ潜かば水は涸れなむ [一]</a></p>
<h2>（或曰  &lt;昔&gt;有三男同娉一女也  娘子嘆息曰  一女之身易滅如露  三雄之志難平如石  遂乃彷徨池上沈没水底  於時其壮士等不勝哀頽之至  各陳所心作歌三首  [娘子字曰&lt;イ&gt;兒也]）</h2>
<p><a href="3789.html">あしひきの山縵の子今日行くと我れに告げせば帰り来ましを [二]</a></p>
<h2>（或曰  &lt;昔&gt;有三男同娉一女也  娘子嘆息曰  一女之身易滅如露  三雄之志難平如石  遂乃彷徨池上沈没水底  於時其壮士等不勝哀頽之至  各陳所心作歌三首  [娘子字曰&lt;イ&gt;兒也]）</h2>
<p><a href="3790.html">あしひきの玉縵の子今日のごといづれの隈を見つつ来にけむ [三]</a></p>
<h2>昔有老翁  号曰竹取翁也  此翁季春之月登丘遠望  忽値煮羮之九箇女子也  百嬌無儔花容無止  于時娘子等呼老翁嗤曰  叔父来乎  吹此燭火也  於是翁曰唯&lt;々&gt;  漸Ｔ徐行著接座上  良久娘子等皆共含咲相推譲之曰  阿誰呼此翁哉尓乃竹取翁謝之曰  非慮之外偶逢神仙  迷惑之心無敢所禁  近狎之罪希贖以歌  即作歌一首[并短歌]</h2>
<p><a href="3791.html">みどり子の 若子髪には たらちし 母に抱かえ ひむつきの 稚児が髪には 木綿肩衣 純裏に縫ひ着 頚つきの 童髪には 結ひはたの 袖つけ衣 着し我れを 丹よれる 子らがよちには 蜷の腸 か黒し髪を ま櫛持ち ここにかき垂れ 取り束ね 上げても巻きみ 解き乱り 童になしみ さ丹つかふ 色になつける 紫の 大綾の衣 住吉の 遠里小野の ま榛持ち にほほし衣に 高麗錦 紐に縫ひつけ 刺部重部 なみ重ね着て 打麻やし 麻続の子ら あり衣の 財の子らが  打ちし栲 延へて織る布 日さらしの 麻手作りを 信巾裳成者之寸丹取為支屋所経 稲置娘子が 妻どふと 我れにおこせし 彼方の 二綾下沓 飛ぶ鳥 明日香壮士が 長雨禁へ 縫ひし黒沓 さし履きて 庭にたたずみ 退けな立ち 禁娘子が ほの聞きて 我れにおこせし 水縹の 絹の帯を 引き帯なす 韓帯に取らし わたつみの 殿の甍に 飛び翔ける すがるのごとき 腰細に 取り装ほひ まそ鏡 取り並め懸けて おのがなり かへらひ見つつ 春さりて 野辺を廻れば おもしろみ 我れを思へか さ野つ鳥 来鳴き翔らふ 秋さりて 山辺を行けば なつかしと 我れを思へか 天雲も 行きたなびく かへり立ち 道を来れば うちひさす 宮女 さす竹の 舎人壮士も 忍ぶらひ かへらひ見つつ 誰が子ぞとや 思はえてある かくのごと 所為故為 いにしへ ささきし我れや はしきやし 今日やも子らに いさとや 思はえてある かくのごと 所為故為 いにしへの 賢しき人も 後の世の 鑑にせむと 老人を 送りし車 持ち帰りけり 持ち帰りけり </a></p>
<h2>（昔有老翁  号曰竹取翁也  此翁季春之月登丘遠望  忽値煮羮之九箇女子也  百嬌無儔花容無止  于時娘子等呼老翁嗤曰  叔父来乎  吹此燭火也  於是翁曰唯&lt;々&gt;  漸Ｔ徐行著接座上  良久娘子等皆共含咲相推譲之曰  阿誰呼此翁哉尓乃竹取翁謝之曰  非慮之外偶逢神仙  迷惑之心無敢所禁  近狎之罪希贖以歌  即作歌一首[并短歌]）反歌二首</h2>
<p><a href="3792.html">死なばこそ相見ずあらめ生きてあらば白髪子らに生ひずあらめやも</a></p>
<h2>（（昔有老翁  号曰竹取翁也  此翁季春之月登丘遠望  忽値煮羮之九箇女子也  百嬌無儔花容無止  于時娘子等呼老翁嗤曰  叔父来乎  吹此燭火也  於是翁曰唯&lt;々&gt;  漸Ｔ徐行著接座上  良久娘子等皆共含咲相推譲之曰  阿誰呼此翁哉尓乃竹取翁謝之曰  非慮之外偶逢神仙  迷惑之心無敢所禁  近狎之罪希贖以歌  即作歌一首[并短歌]）反歌二首）</h2>
<p><a href="3793.html">白髪し子らに生ひなばかくのごと若けむ子らに罵らえかねめや</a></p>
<h2>娘子等和歌九首</h2>
<p><a href="3794.html">はしきやし翁の歌におほほしき九の子らや感けて居らむ [一]</a></p>
<h2>（娘子等和歌九首）</h2>
<p><a href="3795.html">恥を忍び恥を黙して事もなく物言はぬさきに我れは寄りなむ [二]</a></p>
<h2>（娘子等和歌九首）</h2>
<p><a href="3796.html">否も諾も欲しきまにまに許すべき顔見ゆるかも我れも寄りなむ [三]</a></p>
<h2>（娘子等和歌九首）</h2>
<p><a href="3797.html">死にも生きも同じ心と結びてし友や違はむ我れも寄りなむ [四]</a></p>
<h2>（娘子等和歌九首）</h2>
<p><a href="3798.html">何すと違ひは居らむ否も諾も友のなみなみ我れも寄りなむ [五]</a></p>
<h2>（娘子等和歌九首）</h2>
<p><a href="3799.html">あにもあらじおのが身のから人の子の言も尽さじ我れも寄りなむ [六]</a></p>
<h2>（娘子等和歌九首）</h2>
<p><a href="3800.html">はだすすき穂にはな出でそ思ひたる心は知らゆ我れも寄りなむ [七]</a></p>
<h2>（娘子等和歌九首）</h2>
<p><a href="3801.html">住吉の岸野の榛ににほふれどにほはぬ我れやにほひて居らむ [八]</a></p>
<h2>（娘子等和歌九首）</h2>
<p><a href="3802.html">春の野の下草靡き我れも寄りにほひ寄りなむ友のまにまに [九]</a></p>
<h2>昔者有壮士與美女也[姓名未詳]  不告二親竊為交接  於時娘子之意欲親令知  因作歌詠送與其夫歌曰</h2>
<p><a href="3803.html">隠りのみ恋ふれば苦し山の端ゆ出でくる月の顕さばいかに</a></p>
<h2>昔者有壮士  新成婚礼也  未經幾時忽為驛使被遣遠境  公事有限會期無日  於是娘子  感慟悽愴沈臥疾エ  累&lt;年&gt;之後壮士還来覆命既了  乃詣相視而娘子之姿容疲羸甚異言語哽咽  于時壮士哀嘆流涙裁歌口号  其歌一首</h2>
<p><a href="3804.html">かくのみにありけるものを猪名川の沖を深めて我が思へりける</a></p>
<h2>娘子臥聞夫君之歌従枕擧頭應聲和歌一首</h2>
<p><a href="3805.html">ぬばたまの黒髪濡れて沫雪の降るにや来ますここだ恋ふれば</a></p>
<h2></h2>
<p><a href="3806.html">事しあらば小泊瀬山の石城にも隠らばともにな思ひそ我が背</a></p>
<h2></h2>
<p><a href="3807.html">安積山影さへ見ゆる山の井の浅き心を我が思はなくに</a></p>
<h2></h2>
<p><a href="3808.html">住吉の小集楽に出でてうつつにもおの妻すらを鏡と見つも</a></p>
<h2></h2>
<p><a href="3809.html">商返しめすとの御法あらばこそ我が下衣返し給はめ</a></p>
<h2></h2>
<p><a href="3810.html">味飯を水に醸みなし我が待ちしかひはかつてなし直にしあらねば</a></p>
<h2>戀夫君歌一首[并短歌]</h2>
<p><a href="3811.html">さ丹つらふ 君がみ言と 玉梓の 使も来ねば 思ひ病む 我が身ひとつぞ ちはやぶる 神にもな負ほせ 占部据ゑ 亀もな焼きそ 恋ひしくに 痛き我が身ぞ いちしろく 身にしみ通り むらきもの 心砕けて 死なむ命 にはかになりぬ 今さらに 君か我を呼ぶ たらちねの 母のみ言か 百足らず 八十の衢に 夕占にも 占にもぞ問ふ 死ぬべき我がゆゑ </a></p>
<h2>（戀夫君歌一首[并短歌]）反歌</h2>
<p><a href="3812.html">占部をも八十の衢も占問へど君を相見むたどき知らずも</a></p>
<h2>（戀夫君歌一首[并短歌]）或本反歌曰</h2>
<p><a href="3813.html">我が命は惜しくもあらずさ丹つらふ君によりてぞ長く欲りせし</a></p>
<h2>贈歌一首</h2>
<p><a href="3814.html">白玉は緒絶えしにきと聞きしゆゑにその緒また貫き我が玉にせむ</a></p>
<h2>答歌一首</h2>
<p><a href="3815.html">白玉の緒絶えはまことしかれどもその緒また貫き人持ち去にけり</a></p>
<h2>穂積親王御歌一首</h2>
<p><a href="3816.html">家にありし櫃にかぎさし蔵めてし恋の奴のつかみかかりて</a></p>
<h2></h2>
<p><a href="3817.html">かるうすは田ぶせの本に我が背子はにふぶに笑みて立ちませり見ゆ [田廬者多夫世<反>]</a></p>
<h2></h2>
<p><a href="3818.html">朝霞鹿火屋が下の鳴くかはづ偲ひつつありと告げむ子もがも</a></p>
<h2></h2>
<p><a href="3819.html">夕立の雨うち降れば春日野の尾花が末の白露思ほゆ</a></p>
<h2></h2>
<p><a href="3820.html">夕づく日さすや川辺に作る屋の形をよろしみうべ寄そりけり</a></p>
<h2>兒部女王嗤歌一首</h2>
<p><a href="3821.html">うましものいづく飽かじをさかとらが角のふくれにしぐひ合ひにけむ</a></p>
<h2>古歌曰</h2>
<p><a href="3822.html">橘の寺の長屋に我が率寝し童女放髪は髪上げつらむか</a></p>
<h2>决&lt;曰&gt;</h2>
<p><a href="3823.html">橘の照れる長屋に我が率ねし童女放髪に髪上げつらむか</a></p>
<h2>長忌寸意吉麻呂歌八首</h2>
<p><a href="3824.html">さし鍋に湯沸かせ子ども櫟津の桧橋より来む狐に浴むさむ</a></p>
<h2>詠行騰蔓菁食薦屋ａ歌</h2>
<p><a href="3825.html">食薦敷き青菜煮て来む梁にむかばき懸けて休むこの君</a></p>
<h2>詠荷葉歌</h2>
<p><a href="3826.html">蓮葉はかくこそあるもの意吉麻呂が家なるものは芋の葉にあらし</a></p>
<h2>詠雙六頭歌</h2>
<p><a href="3827.html">一二の目のみにはあらず五六三四さへありけり双六のさえ</a></p>
<h2>詠香塔厠&lt;屎&gt;鮒奴歌</h2>
<p><a href="3828.html">香塗れる塔にな寄りそ川隈の屎鮒食めるいたき女奴</a></p>
<h2>詠酢醤蒜鯛水ク歌</h2>
<p><a href="3829.html">醤酢に蒜搗きかてて鯛願ふ我れにな見えそ水葱の羹</a></p>
<h2>詠玉掃鎌天木香棗歌</h2>
<p><a href="3830.html">玉掃刈り来鎌麻呂むろの木と棗が本とかき掃かむため</a></p>
<h2>詠白鷺啄木飛歌</h2>
<p><a href="3831.html">池神の力士舞かも白鷺の桙啄ひ持ちて飛び渡るらむ</a></p>
<h2>忌部首詠數種物歌一首  [名忘失也]</h2>
<p><a href="3832.html">からたちと茨刈り除け倉建てむ屎遠くまれ櫛造る刀自</a></p>
<h2>境部王詠數種物歌一首  [穂積親王之子也]</h2>
<p><a href="3833.html">虎に乗り古屋を越えて青淵に蛟龍捕り来む剣太刀もが</a></p>
<h2>作主未詳歌一首</h2>
<p><a href="3834.html">梨棗黍に粟つぎ延ふ葛の後も逢はむと葵花咲く</a></p>
<h2>獻新田部親王歌一首  [未詳]</h2>
<p><a href="3835.html">勝間田の池は我れ知る蓮なししか言ふ君が鬚なきごとし</a></p>
<h2>謗&lt;侫&gt;人歌一首</h2>
<p><a href="3836.html">奈良山の児手柏の両面にかにもかくにも侫人の伴</a></p>
<h2></h2>
<p><a href="3837.html">ひさかたの雨も降らぬか蓮葉に溜まれる水の玉に似たる見む</a></p>
<h2>無心所著歌二首</h2>
<p><a href="3838.html">我妹子が額に生ふる双六のこと負の牛の鞍の上の瘡</a></p>
<h2>（無心所著歌二首）</h2>
<p><a href="3839.html">我が背子が犢鼻にするつぶれ石の吉野の山に氷魚ぞ下がれる [懸有反云 佐<我>礼流]</a></p>
<h2>池田朝臣嗤大神朝臣奥守歌一首  [池田朝臣名忘失也]</h2>
<p><a href="3840.html">寺々の女餓鬼申さく大神の男餓鬼賜りてその子産まはむ</a></p>
<h2>大神朝臣奥守報嗤歌一首</h2>
<p><a href="3841.html">仏造るま朱足らずは水溜まる池田の朝臣が鼻の上を掘れ</a></p>
<h2>或云 / 平群朝臣&lt;嗤&gt;歌一首</h2>
<p><a href="3842.html">童ども草はな刈りそ八穂蓼を穂積の朝臣が腋草を刈れ</a></p>
<h2>穂積朝臣和歌一首</h2>
<p><a href="3843.html">いづくにぞま朱掘る岡薦畳平群の朝臣が鼻の上を掘れ</a></p>
<h2>嗤咲黒色歌一首</h2>
<p><a href="3844.html">ぬばたまの斐太の大黒見るごとに巨勢の小黒し思ほゆるかも</a></p>
<h2>答歌一首</h2>
<p><a href="3845.html">駒造る土師の志婢麻呂白くあればうべ欲しからむその黒色を</a></p>
<h2>戯嗤僧歌一首</h2>
<p><a href="3846.html">法師らが鬚の剃り杭馬繋いたくな引きそ法師は泣かむ</a></p>
<h2>法師報歌一首</h2>
<p><a href="3847.html">壇越やしかもな言ひそ里長が課役徴らば汝も泣かむ</a></p>
<h2>夢裏作歌一首</h2>
<p><a href="3848.html">あらき田の鹿猪田の稲を倉に上げてあなひねひねし我が恋ふらくは</a></p>
<h2>Ｑ世間無常歌二首</h2>
<p><a href="3849.html">生き死にの二つの海を厭はしみ潮干の山を偲ひつるかも</a></p>
<h2>（Ｑ世間無常歌二首）</h2>
<p><a href="3850.html">世間の繁き仮廬に住み住みて至らむ国のたづき知らずも</a></p>
<h2></h2>
<p><a href="3851.html">心をし無何有の郷に置きてあらば藐孤射の山を見まく近けむ</a></p>
<h2></h2>
<p><a href="3852.html">鯨魚取り海や死にする山や死にする死ぬれこそ海は潮干て山は枯れすれ</a></p>
<h2>嗤咲痩人歌二首</h2>
<p><a href="3853.html">石麻呂に我れ物申す夏痩せによしといふものぞ鰻捕り食せ [賣世反也]</a></p>
<h2>（嗤咲痩人歌二首）</h2>
<p><a href="3854.html">痩す痩すも生けらばあらむをはたやはた鰻を捕ると川に流るな</a></p>
<h2>高宮王詠數首物歌二首</h2>
<p><a href="3855.html">さう莢に延ひおほとれる屎葛絶ゆることなく宮仕へせむ</a></p>
<h2>（高宮王詠數首物歌二首）</h2>
<p><a href="3856.html">波羅門の作れる小田を食む烏瞼腫れて幡桙に居り</a></p>
<h2>戀夫君歌一首</h2>
<p><a href="3857.html">飯食めど うまくもあらず 行き行けど 安くもあらず あかねさす 君が心し 忘れかねつも </a></p>
<h2></h2>
<p><a href="3858.html">このころの我が恋力記し集め功に申さば五位の冠</a></p>
<h2></h2>
<p><a href="3859.html">このころの我が恋力賜らずはみさとづかさに出でて訴へむ</a></p>
<h2>筑前國志賀白水郎歌十首</h2>
<p><a href="3860.html">大君の遣はさなくにさかしらに行きし荒雄ら沖に袖振る</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3861.html">荒雄らを来むか来じかと飯盛りて門に出で立ち待てど来まさず</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3862.html">志賀の山いたくな伐りそ荒雄らがよすかの山と見つつ偲はむ</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3863.html">荒雄らが行きにし日より志賀の海人の大浦田沼は寂しくもあるか</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3864.html">官こそさしても遣らめさかしらに行きし荒雄ら波に袖振る</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3865.html">荒雄らは妻子の業をば思はずろ年の八年を待てど来まさず</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3866.html">沖つ鳥鴨とふ船の帰り来ば也良の崎守早く告げこそ</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3867.html">沖つ鳥鴨とふ船は也良の崎廻みて漕ぎ来と聞こえ来ぬかも</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3868.html">沖行くや赤ら小舟につと遣らばけだし人見て開き見むかも</a></p>
<h2>（筑前國志賀白水郎歌十首）</h2>
<p><a href="3869.html">大船に小舟引き添へ潜くとも志賀の荒雄に潜き逢はめやも</a></p>
<h2></h2>
<p><a href="3870.html">紫の粉潟の海に潜く鳥玉潜き出ば我が玉にせむ</a></p>
<h2></h2>
<p><a href="3871.html">角島の瀬戸のわかめは人の共荒かりしかど我れとは和海藻</a></p>
<h2></h2>
<p><a href="3872.html">我が門の榎の実もり食む百千鳥千鳥は来れど君ぞ来まさぬ</a></p>
<h2></h2>
<p><a href="3873.html">我が門に千鳥しば鳴く起きよ起きよ我が一夜夫人に知らゆな</a></p>
<h2></h2>
<p><a href="3874.html">射ゆ鹿を認ぐ川辺のにこ草の身の若かへにさ寝し子らはも</a></p>
<h2></h2>
<p><a href="3875.html">琴酒を 押垂小野ゆ 出づる水 ぬるくは出でず 寒水の 心もけやに 思ほゆる 音の少なき 道に逢はぬかも 少なきよ 道に逢はさば 色げせる 菅笠小笠 我がうなげる 玉の七つ緒 取り替へも 申さむものを 少なき道に 逢はぬかも </a></p>
<h2>豊前國白水郎歌一首</h2>
<p><a href="3876.html">豊国の企救の池なる菱の末を摘むとや妹がみ袖濡れけむ</a></p>
<h2>豊後國白水郎歌一首</h2>
<p><a href="3877.html">紅に染めてし衣雨降りてにほひはすともうつろはめやも</a></p>
<h2>能登國歌三首</h2>
<p><a href="3878.html">はしたての 熊来のやらに 新羅斧 落し入れ わし かけてかけて な泣かしそね 浮き出づるやと見む わし </a></p>
<h2>（能登國歌三首）</h2>
<p><a href="3879.html">はしたての 熊来酒屋に まぬらる奴 わし さすひ立て 率て来なましを まぬらる奴 わし </a></p>
<h2>（能登國歌三首）</h2>
<p><a href="3880.html">鹿島嶺の 机の島の しただみを い拾ひ持ち来て 石もち つつき破り 早川に 洗ひ濯ぎ 辛塩に こごと揉み 高坏に盛り 机に立てて 母にあへつや 目豆児の刀自 父にあへつや 身女児の刀自 </a></p>
<h2>越中國歌四首</h2>
<p><a href="3881.html">大野道は茂道茂路茂くとも君し通はば道は広けむ</a></p>
<h2>（越中國歌四首）</h2>
<p><a href="3882.html">渋谿の二上山に鷲ぞ子産むといふ翳にも君のみために鷲ぞ子産むといふ</a></p>
<h2>（越中國歌四首）</h2>
<p><a href="3883.html">弥彦おのれ神さび青雲のたなびく日すら小雨そほ降る [一云 あなに神さび]</a></p>
<h2>（越中國歌四首）</h2>
<p><a href="3884.html">弥彦神の麓に今日らもか鹿の伏すらむ皮衣着て角つきながら</a></p>
<h2>乞食者&lt;詠&gt;二首</h2>
<p><a href="3885.html">いとこ 汝背の君 居り居りて 物にい行くとは 韓国の 虎といふ神を 生け捕りに 八つ捕り持ち来 その皮を 畳に刺し 八重畳 平群の山に 四月と 五月との間に 薬猟 仕ふる時に あしひきの この片山に 二つ立つ 櫟が本に 梓弓 八つ手挟み ひめ鏑 八つ手挟み 獣待つと 我が居る時に さを鹿の 来立ち嘆かく たちまちに 我れは死ぬべし 大君に 我れは仕へむ 我が角は み笠のはやし 我が耳は み墨の坩 我が目らは ますみの鏡 我が爪は み弓の弓弭 我が毛らは み筆はやし 我が皮は み箱の皮に 我が肉は み膾はやし 我が肝も み膾はやし 我がみげは み塩のはやし 老いたる奴 我が身一つに 七重花咲く 八重花咲くと 申しはやさね 申しはやさね </a></p>
<h2>（乞食者&lt;詠&gt;二首）</h2>
<p><a href="3886.html">おしてるや 難波の小江に 廬作り 隠りて居る 葦蟹を 大君召すと 何せむに  我を召すらめや 明けく 我が知ることを 歌人と 我を召すらめや 笛吹きと  我を召すらめや 琴弾きと 我を召すらめや かもかくも 命受けむと 今日今日と 飛鳥に至り 置くとも 置勿に至り つかねども 都久野に至り 東の 中の御門ゆ 参入り来て 命受くれば 馬にこそ ふもだしかくもの 牛にこそ 鼻縄はくれ あしひきの この片山の もむ楡を 五百枝剥き垂り 天照るや 日の異に干し さひづるや 韓臼に搗き 庭に立つ 手臼に搗き おしてるや 難波の小江の 初垂りを からく垂り来て 陶人の 作れる瓶を 今日行きて 明日取り持ち来 我が目らに 塩塗りたまひ きたひはやすも きたひはやすも </a></p>
<h2>怕物歌三首</h2>
<p><a href="3887.html">天にあるやささらの小野に茅草刈り草刈りばかに鶉を立つも</a></p>
<h2>（怕物歌三首）</h2>
<p><a href="3888.html">沖つ国うしはく君の塗り屋形丹塗りの屋形神の門渡る</a></p>
<h2>（怕物歌三首）</h2>
<p><a href="3889.html">人魂のさ青なる君がただひとり逢へりし雨夜の葉非左し思ほゆ</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
