#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第十四巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第十四巻）</h1>

 <h2>東歌</h2>
<p><a href="3348.html">夏麻引く海上潟の沖つ洲に船は留めむさ夜更けにけり</a></p>
<h2></h2>
<p><a href="3349.html">葛飾の真間の浦廻を漕ぐ船の船人騒く波立つらしも</a></p>
<h2></h2>
<p><a href="3350.html">筑波嶺の新桑繭の衣はあれど君が御衣しあやに着欲しも</a></p>
<h2>或本歌曰  又云</h2>
<p><a href="3350S.html">たらちねの あまた着欲しも </a></p>
<h2></h2>
<p><a href="3351.html">筑波嶺に雪かも降らるいなをかも愛しき子ろが布乾さるかも</a></p>
<h2></h2>
<p><a href="3352.html">信濃なる須我の荒野に霍公鳥鳴く声聞けば時過ぎにけり</a></p>
<h2>相聞</h2>
<p><a href="3353.html">あらたまの伎倍の林に汝を立てて行きかつましじ寐を先立たね</a></p>
<h2></h2>
<p><a href="3354.html">伎倍人のまだら衾に綿さはだ入りなましもの妹が小床に</a></p>
<h2></h2>
<p><a href="3355.html">天の原富士の柴山この暗の時ゆつりなば逢はずかもあらむ</a></p>
<h2></h2>
<p><a href="3356.html">富士の嶺のいや遠長き山道をも妹がりとへばけによばず来ぬ</a></p>
<h2></h2>
<p><a href="3357.html">霞居る富士の山びに我が来なばいづち向きてか妹が嘆かむ</a></p>
<h2></h2>
<p><a href="3358.html">さ寝らくは玉の緒ばかり恋ふらくは富士の高嶺の鳴沢のごと</a></p>
<h2>或本歌曰</h2>
<p><a href="3358S1.html">ま愛しみ寝らくはしけらくさ鳴らくは伊豆の高嶺の鳴沢なすよ</a></p>
<h2>一本歌曰</h2>
<p><a href="3358S2.html">逢へらくは玉の緒しけや恋ふらくは富士の高嶺に降る雪なすも</a></p>
<h2></h2>
<p><a href="3359.html">駿河の海おし辺に生ふる浜つづら汝を頼み母に違ひぬ [一云 親に違ひぬ] </a></p>
<h2></h2>
<p><a href="3360.html">伊豆の海に立つ白波のありつつも継ぎなむものを乱れしめめや</a></p>
<h2>或本歌曰</h2>
<p><a href="3360S.html">白雲の絶えつつも継がむと思へや乱れそめけむ </a></p>
<h2></h2>
<p><a href="3361.html">足柄のをてもこのもにさすわなのかなるましづみ子ろ我れ紐解く</a></p>
<h2></h2>
<p><a href="3362.html">相模嶺の小峰見そくし忘れ来る妹が名呼びて我を音し泣くな</a></p>
<h2>或本歌曰</h2>
<p><a href="3362S.html">武蔵嶺の小峰見隠し忘れ行く君が名懸けて我を音し泣くる</a></p>
<h2></h2>
<p><a href="3363.html">我が背子を大和へ遣りて待つしだす足柄山の杉の木の間か</a></p>
<h2></h2>
<p><a href="3364.html">足柄の箱根の山に粟蒔きて実とはなれるを粟無くもあやし</a></p>
<h2>或本歌末句曰</h2>
<p><a href="3364S.html">延ふ葛の引かば寄り来ね下なほなほに </a></p>
<h2></h2>
<p><a href="3365.html">鎌倉の見越しの崎の岩崩えの君が悔ゆべき心は持たじ</a></p>
<h2></h2>
<p><a href="3366.html">ま愛しみさ寝に我は行く鎌倉の水無瀬川に潮満つなむか</a></p>
<h2></h2>
<p><a href="3367.html">百づ島足柄小舟歩き多み目こそ離るらめ心は思へど</a></p>
<h2></h2>
<p><a href="3368.html">あしがりの土肥の河内に出づる湯のよにもたよらに子ろが言はなくに</a></p>
<h2></h2>
<p><a href="3369.html">あしがりの麻万の小菅の菅枕あぜかまかさむ子ろせ手枕</a></p>
<h2></h2>
<p><a href="3370.html">あしがりの箱根の嶺ろのにこ草の花つ妻なれや紐解かず寝む</a></p>
<h2></h2>
<p><a href="3371.html">足柄のみ坂畏み曇り夜の我が下ばへをこち出つるかも</a></p>
<h2></h2>
<p><a href="3372.html">相模道の余綾の浜の真砂なす子らは愛しく思はるるかも</a></p>
<h2></h2>
<p><a href="3373.html">多摩川にさらす手作りさらさらになにぞこの子のここだ愛しき</a></p>
<h2></h2>
<p><a href="3374.html">武蔵野に占部肩焼きまさでにも告らぬ君が名占に出にけり</a></p>
<h2></h2>
<p><a href="3375.html">武蔵野のをぐきが雉立ち別れ去にし宵より背ろに逢はなふよ</a></p>
<h2></h2>
<p><a href="3376.html">恋しけば袖も振らむを武蔵野のうけらが花の色に出なゆめ</a></p>
<h2>或本歌曰</h2>
<p><a href="3376S.html">いかにして恋ひばか妹に武蔵野のうけらが花の色に出ずあらむ </a></p>
<h2></h2>
<p><a href="3377.html">武蔵野の草葉もろ向きかもかくも君がまにまに我は寄りにしを</a></p>
<h2></h2>
<p><a href="3378.html">入間道の於保屋が原のいはゐつら引かばぬるぬる我にな絶えそね</a></p>
<h2></h2>
<p><a href="3379.html">我が背子をあどかも言はむ武蔵野のうけらが花の時なきものを</a></p>
<h2></h2>
<p><a href="3380.html">埼玉の津に居る船の風をいたみ綱は絶ゆとも言な絶えそね</a></p>
<h2></h2>
<p><a href="3381.html">夏麻引く宇奈比をさして飛ぶ鳥の至らむとぞよ我が下延へし</a></p>
<h2></h2>
<p><a href="3382.html">馬来田の嶺ろの笹葉の露霜の濡れて我来なば汝は恋ふばぞも</a></p>
<h2></h2>
<p><a href="3383.html">馬来田の嶺ろに隠り居かくだにも国の遠かば汝が目欲りせむ</a></p>
<h2></h2>
<p><a href="3384.html">葛飾の真間の手児名をまことかも我れに寄すとふ真間の手児名を</a></p>
<h2></h2>
<p><a href="3385.html">葛飾の真間の手児名がありしかば真間のおすひに波もとどろに</a></p>
<h2></h2>
<p><a href="3386.html">にほ鳥の葛飾早稲をにへすともその愛しきを外に立てめやも</a></p>
<h2></h2>
<p><a href="3387.html">足の音せず行かむ駒もが葛飾の真間の継橋やまず通はむ</a></p>
<h2></h2>
<p><a href="3388.html">筑波嶺の嶺ろに霞居過ぎかてに息づく君を率寝て遣らさね</a></p>
<h2></h2>
<p><a href="3389.html">妹が門いや遠そきぬ筑波山隠れぬほとに袖は振りてな</a></p>
<h2></h2>
<p><a href="3390.html">筑波嶺にかか鳴く鷲の音のみをか泣きわたりなむ逢ふとはなしに</a></p>
<h2></h2>
<p><a href="3391.html">筑波嶺にそがひに見ゆる葦穂山悪しかるとがもさね見えなくに</a></p>
<h2></h2>
<p><a href="3392.html">筑波嶺の岩もとどろに落つる水よにもたゆらに我が思はなくに</a></p>
<h2></h2>
<p><a href="3393.html">筑波嶺のをてもこのもに守部据ゑ母い守れども魂ぞ会ひにける</a></p>
<h2></h2>
<p><a href="3394.html">さ衣の小筑波嶺ろの山の崎忘ら来ばこそ汝を懸けなはめ</a></p>
<h2></h2>
<p><a href="3395.html">小筑波の嶺ろに月立し間夜はさはだなりぬをまた寝てむかも</a></p>
<h2></h2>
<p><a href="3396.html">小筑波の茂き木の間よ立つ鳥の目ゆか汝を見むさ寝ざらなくに</a></p>
<h2></h2>
<p><a href="3397.html">常陸なる浪逆の海の玉藻こそ引けば絶えすれあどか絶えせむ</a></p>
<h2></h2>
<p><a href="3398.html">人皆の言は絶ゆとも埴科の石井の手児が言な絶えそね</a></p>
<h2></h2>
<p><a href="3399.html">信濃道は今の墾り道刈りばねに足踏ましなむ沓はけ我が背</a></p>
<h2></h2>
<p><a href="3400.html">信濃なる千曲の川のさざれ石も君し踏みてば玉と拾はむ</a></p>
<h2></h2>
<p><a href="3401.html">なかまなに浮き居る船の漕ぎ出なば逢ふことかたし今日にしあらずは</a></p>
<h2></h2>
<p><a href="3402.html">日の暮れに碓氷の山を越ゆる日は背なのが袖もさやに振らしつ</a></p>
<h2></h2>
<p><a href="3403.html">我が恋はまさかも愛し草枕多胡の入野の奥も愛しも</a></p>
<h2></h2>
<p><a href="3404.html">上つ毛野安蘇のま麻むらかき抱き寝れど飽かぬをあどか我がせむ</a></p>
<h2></h2>
<p><a href="3405.html">上つ毛野乎度の多杼里が川路にも子らは逢はなもひとりのみして</a></p>
<h2>或本歌曰</h2>
<p><a href="3405S.html">上つ毛野小野の多杼里があはぢにも背なは逢はなも見る人なしに </a></p>
<h2></h2>
<p><a href="3406.html">上つ毛野佐野の茎立ち折りはやし我れは待たむゑ来とし来ずとも</a></p>
<h2></h2>
<p><a href="3407.html">上つ毛野まぐはしまとに朝日さしまきらはしもなありつつ見れば</a></p>
<h2></h2>
<p><a href="3408.html">新田山嶺にはつかなな我に寄そりはしなる子らしあやに愛しも</a></p>
<h2></h2>
<p><a href="3409.html">伊香保ろに天雲い継ぎかぬまづく人とおたはふいざ寝しめとら</a></p>
<h2></h2>
<p><a href="3410.html">伊香保ろの沿ひの榛原ねもころに奥をなかねそまさかしよかば</a></p>
<h2></h2>
<p><a href="3411.html">多胡の嶺に寄せ綱延へて寄すれどもあにくやしづしその顔よきに</a></p>
<h2></h2>
<p><a href="3412.html">上つ毛野久路保の嶺ろの葛葉がた愛しけ子らにいや離り来も</a></p>
<h2></h2>
<p><a href="3413.html">利根川の川瀬も知らず直渡り波にあふのす逢へる君かも</a></p>
<h2></h2>
<p><a href="3414.html">伊香保ろのやさかのゐでに立つ虹の現はろまでもさ寝をさ寝てば</a></p>
<h2></h2>
<p><a href="3415.html">上つ毛野伊香保の沼に植ゑ小水葱かく恋ひむとや種求めけむ</a></p>
<h2></h2>
<p><a href="3416.html">上つ毛野可保夜が沼のいはゐつら引かばぬれつつ我をな絶えそね</a></p>
<h2></h2>
<p><a href="3417.html">上つ毛野伊奈良の沼の大藺草外に見しよは今こそまされ [柿本朝臣人麻呂歌集出也]</a></p>
<h2></h2>
<p><a href="3418.html">上つ毛野佐野田の苗のむら苗に事は定めつ今はいかにせも</a></p>
<h2></h2>
<p><a href="3419.html">伊香保せよ奈可中次下思ひどろくまこそしつと忘れせなふも</a></p>
<h2></h2>
<p><a href="3420.html">上つ毛野佐野の舟橋取り離し親は放くれど我は離るがへ</a></p>
<h2></h2>
<p><a href="3421.html">伊香保嶺に雷な鳴りそね我が上には故はなけども子らによりてぞ</a></p>
<h2></h2>
<p><a href="3422.html">伊香保風吹く日吹かぬ日ありと言へど我が恋のみし時なかりけり</a></p>
<h2></h2>
<p><a href="3423.html">上つ毛野伊香保の嶺ろに降ろ雪の行き過ぎかてぬ妹が家のあたり</a></p>
<h2></h2>
<p><a href="3424.html">下つ毛野みかもの山のこ楢のすまぐはし子ろは誰が笥か持たむ</a></p>
<h2></h2>
<p><a href="3425.html">下つ毛野阿蘇の川原よ石踏まず空ゆと来ぬよ汝が心告れ</a></p>
<h2></h2>
<p><a href="3426.html">会津嶺の国をさ遠み逢はなはば偲ひにせもと紐結ばさね</a></p>
<h2></h2>
<p><a href="3427.html">筑紫なるにほふ子ゆゑに陸奥の可刀利娘子の結ひし紐解く</a></p>
<h2></h2>
<p><a href="3428.html">安達太良の嶺に伏す鹿猪のありつつも我れは至らむ寝処な去りそね</a></p>
<h2>譬喩歌</h2>
<p><a href="3429.html">遠江引佐細江のみをつくし我れを頼めてあさましものを</a></p>
<h2></h2>
<p><a href="3430.html">志太の浦を朝漕ぐ船はよしなしに漕ぐらめかもよよしこさるらめ</a></p>
<h2></h2>
<p><a href="3431.html">足柄の安伎奈の山に引こ船の後引かしもよここばこがたに</a></p>
<h2></h2>
<p><a href="3432.html">足柄のわを可鶏山のかづの木の我をかづさねも門さかずとも</a></p>
<h2></h2>
<p><a href="3433.html">薪伐る鎌倉山の木垂る木を松と汝が言はば恋ひつつやあらむ</a></p>
<h2></h2>
<p><a href="3434.html">上つ毛野阿蘇山つづら野を広み延ひにしものをあぜか絶えせむ</a></p>
<h2></h2>
<p><a href="3435.html">伊香保ろの沿ひの榛原我が衣に着きよらしもよひたへと思へば</a></p>
<h2></h2>
<p><a href="3436.html">しらとほふ小新田山の守る山のうら枯れせなな常葉にもがも</a></p>
<h2></h2>
<p><a href="3437.html">陸奥の安達太良真弓はじき置きて反らしめきなば弦はかめかも</a></p>
<h2>雜歌</h2>
<p><a href="3438.html">都武賀野に鈴が音聞こゆ可牟思太の殿のなかちし鳥猟すらしも</a></p>
<h2>或本歌曰  又曰</h2>
<p><a href="3438S.html">美都我野に 若子し </a></p>
<h2></h2>
<p><a href="3439.html">鈴が音の早馬駅家の堤井の水を給へな妹が直手よ</a></p>
<h2></h2>
<p><a href="3440.html">この川に朝菜洗ふ子汝れも我れもよちをぞ持てるいで子給りに [一云 ましも我れも] </a></p>
<h2></h2>
<p><a href="3441.html">ま遠くの雲居に見ゆる妹が家にいつか至らむ歩め我が駒</a></p>
<h2>柿本朝臣人麻呂歌集曰  又曰</h2>
<p><a href="3441S.html">遠くして 歩め黒駒 </a></p>
<h2></h2>
<p><a href="3442.html">東道の手児の呼坂越えがねて山にか寝むも宿りはなしに</a></p>
<h2></h2>
<p><a href="3443.html">うらもなく我が行く道に青柳の張りて立てれば物思ひ出つも</a></p>
<h2></h2>
<p><a href="3444.html">伎波都久の岡のくくみら我れ摘めど籠にも満たなふ背なと摘まさね</a></p>
<h2></h2>
<p><a href="3445.html">港の葦が中なる玉小菅刈り来我が背子床の隔しに</a></p>
<h2></h2>
<p><a href="3446.html">妹なろが使ふ川津のささら荻葦と人言語りよらしも</a></p>
<h2></h2>
<p><a href="3447.html">草蔭の安努な行かむと墾りし道安努は行かずて荒草立ちぬ</a></p>
<h2></h2>
<p><a href="3448.html">花散らふこの向つ峰の乎那の峰のひじにつくまで君が代もがも</a></p>
<h2></h2>
<p><a href="3449.html">白栲の衣の袖を麻久良我よ海人漕ぎ来見ゆ波立つなゆめ</a></p>
<h2></h2>
<p><a href="3450.html">乎久佐男と乎具佐受家男と潮舟の並べて見れば乎具佐勝ちめり</a></p>
<h2></h2>
<p><a href="3451.html">左奈都良の岡に粟蒔き愛しきが駒は食ぐとも我はそとも追じ</a></p>
<h2></h2>
<p><a href="3452.html">おもしろき野をばな焼きそ古草に新草交り生ひは生ふるがに</a></p>
<h2></h2>
<p><a href="3453.html">風の音の遠き我妹が着せし衣手本のくだりまよひ来にけり</a></p>
<h2></h2>
<p><a href="3454.html">庭に立つ麻手小衾今夜だに夫寄しこせね麻手小衾</a></p>
<h2>相聞</h2>
<p><a href="3455.html">恋しけば来ませ我が背子垣つ柳末摘み枯らし我れ立ち待たむ</a></p>
<h2></h2>
<p><a href="3456.html">うつせみの八十言のへは繁くとも争ひかねて我を言なすな</a></p>
<h2></h2>
<p><a href="3457.html">うちひさす宮の我が背は大和女の膝まくごとに我を忘らすな</a></p>
<h2></h2>
<p><a href="3458.html">汝背の子や等里の岡道しなかだ折れ我を音し泣くよ息づくまでに</a></p>
<h2></h2>
<p><a href="3459.html">稲つけばかかる我が手を今夜もか殿の若子が取りて嘆かむ</a></p>
<h2></h2>
<p><a href="3460.html">誰れぞこの屋の戸押そぶる新嘗に我が背を遣りて斎ふこの戸を</a></p>
<h2></h2>
<p><a href="3461.html">あぜと言へかさ寝に逢はなくにま日暮れて宵なは来なに明けぬしだ来る</a></p>
<h2></h2>
<p><a href="3462.html">あしひきの山沢人の人さはにまなと言ふ子があやに愛しさ</a></p>
<h2></h2>
<p><a href="3463.html">ま遠くの野にも逢はなむ心なく里のみ中に逢へる背なかも</a></p>
<h2></h2>
<p><a href="3464.html">人言の繁きによりてまを薦の同じ枕は我はまかじやも</a></p>
<h2></h2>
<p><a href="3465.html">高麗錦紐解き放けて寝るが上にあどせろとかもあやに愛しき</a></p>
<h2></h2>
<p><a href="3466.html">ま愛しみ寝れば言に出さ寝なへば心の緒ろに乗りて愛しも</a></p>
<h2></h2>
<p><a href="3467.html">奥山の真木の板戸をとどとして我が開かむに入り来て寝さね</a></p>
<h2></h2>
<p><a href="3468.html">山鳥の峰ろのはつをに鏡懸け唱ふべみこそ汝に寄そりけめ</a></p>
<h2></h2>
<p><a href="3469.html">夕占にも今夜と告らろ我が背なはあぜぞも今夜寄しろ来まさぬ</a></p>
<h2></h2>
<p><a href="3470.html">相見ては千年やいぬるいなをかも我れやしか思ふ君待ちがてに [柿本朝臣人麻呂歌集出也]</a></p>
<h2></h2>
<p><a href="3471.html">しまらくは寝つつもあらむを夢のみにもとな見えつつ我を音し泣くる</a></p>
<h2></h2>
<p><a href="3472.html">人妻とあぜかそを言はむしからばか隣の衣を借りて着なはも</a></p>
<h2></h2>
<p><a href="3473.html">左努山に打つや斧音の遠かども寝もとか子ろが面に見えつる</a></p>
<h2></h2>
<p><a href="3474.html">植ゑ竹の本さへ響み出でて去なばいづし向きてか妹が嘆かむ</a></p>
<h2></h2>
<p><a href="3475.html">恋ひつつも居らむとすれど遊布麻山隠れし君を思ひかねつも</a></p>
<h2></h2>
<p><a href="3476.html">うべ子なは我ぬに恋ふなも立と月のぬがなへ行けば恋しかるなも</a></p>
<h2>或本歌末句曰</h2>
<p><a href="3476S.html">ぬがなへ行けど我ぬ行がのへば </a></p>
<h2></h2>
<p><a href="3477.html">東路の手児の呼坂越えて去なば我れは恋ひむな後は逢ひぬとも</a></p>
<h2></h2>
<p><a href="3478.html">遠しとふ故奈の白嶺に逢ほしだも逢はのへしだも汝にこそ寄され</a></p>
<h2></h2>
<p><a href="3479.html">安可見山草根刈り除け逢はすがへ争ふ妹しあやに愛しも</a></p>
<h2></h2>
<p><a href="3480.html">大君の命畏み愛し妹が手枕離れ夜立ち来のかも</a></p>
<h2></h2>
<p><a href="3481.html">あり衣のさゑさゑしづみ家の妹に物言はず来にて思ひ苦しも</a></p>
<h2></h2>
<p><a href="3482.html">韓衣裾のうち交へ逢はねども異しき心を我が思はなくに</a></p>
<h2>或本歌曰</h2>
<p><a href="3482S.html">韓衣裾のうち交ひ逢はなへば寝なへのからに言痛かりつも </a></p>
<h2></h2>
<p><a href="3483.html">昼解けば解けなへ紐の我が背なに相寄るとかも夜解けやすけ</a></p>
<h2></h2>
<p><a href="3484.html">麻苧らを麻笥にふすさに績まずとも明日着せさめやいざせ小床に</a></p>
<h2></h2>
<p><a href="3485.html">剣大刀身に添ふ妹を取り見がね音をぞ泣きつる手児にあらなくに</a></p>
<h2></h2>
<p><a href="3486.html">愛し妹を弓束並べ巻きもころ男のこととし言はばいや勝たましに</a></p>
<h2></h2>
<p><a href="3487.html">梓弓末に玉巻きかくすすぞ寝なななりにし奥をかぬかぬ</a></p>
<h2></h2>
<p><a href="3488.html">生ふしもとこの本山のましばにも告らぬ妹が名かたに出でむかも</a></p>
<h2></h2>
<p><a href="3489.html">梓弓欲良の山辺の茂かくに妹ろを立ててさ寝処払ふも</a></p>
<h2></h2>
<p><a href="3490.html">梓弓末は寄り寝むまさかこそ人目を多み汝をはしに置けれ [柿本朝臣人麻呂歌集出也]</a></p>
<h2></h2>
<p><a href="3491.html">柳こそ伐れば生えすれ世の人の恋に死なむをいかにせよとぞ</a></p>
<h2></h2>
<p><a href="3492.html">小山田の池の堤にさす柳成りも成らずも汝と二人はも</a></p>
<h2></h2>
<p><a href="3493.html">遅速も汝をこそ待ため向つ峰の椎の小やで枝の逢ひは違はじ</a></p>
<h2>或本歌曰</h2>
<p><a href="3493S.html">遅速も君をし待たむ向つ峰の椎のさ枝の時は過ぐとも </a></p>
<h2></h2>
<p><a href="3494.html">子持山若かへるでのもみつまで寝もと我は思ふ汝はあどか思ふ</a></p>
<h2></h2>
<p><a href="3495.html">巌ろの沿ひの若松限りとや君が来まさぬうらもとなくも</a></p>
<h2></h2>
<p><a href="3496.html">橘の古婆の放髪が思ふなむ心うつくしいで我れは行かな</a></p>
<h2></h2>
<p><a href="3497.html">川上の根白高萱あやにあやにさ寝さ寝てこそ言に出にしか</a></p>
<h2></h2>
<p><a href="3498.html">海原の根柔ら小菅あまたあれば君は忘らす我れ忘るれや</a></p>
<h2></h2>
<p><a href="3499.html">岡に寄せ我が刈る萱のさね萱のまことなごやは寝ろとへなかも</a></p>
<h2></h2>
<p><a href="3500.html">紫草は根をかも終ふる人の子のうら愛しけを寝を終へなくに</a></p>
<h2></h2>
<p><a href="3501.html">安波峰ろの峰ろ田に生はるたはみづら引かばぬるぬる我を言な絶え</a></p>
<h2></h2>
<p><a href="3502.html">我が目妻人は放くれど朝顔のとしさへこごと我は離るがへ</a></p>
<h2></h2>
<p><a href="3503.html">安齊可潟潮干のゆたに思へらばうけらが花の色に出めやも</a></p>
<h2></h2>
<p><a href="3504.html">春へ咲く藤の末葉のうら安にさ寝る夜ぞなき子ろをし思へば</a></p>
<h2></h2>
<p><a href="3505.html">うちひさつ宮能瀬川のかほ花の恋ひてか寝らむ昨夜も今夜も</a></p>
<h2></h2>
<p><a href="3506.html">新室のこどきに至ればはだすすき穂に出し君が見えぬこのころ</a></p>
<h2></h2>
<p><a href="3507.html">谷狭み峰に延ひたる玉葛絶えむの心我が思はなくに</a></p>
<h2></h2>
<p><a href="3508.html">芝付の御宇良崎なるねつこ草相見ずあらば我れ恋ひめやも</a></p>
<h2></h2>
<p><a href="3509.html">栲衾白山風の寝なへども子ろがおそきのあろこそえしも</a></p>
<h2></h2>
<p><a href="3510.html">み空行く雲にもがもな今日行きて妹に言どひ明日帰り来む</a></p>
<h2></h2>
<p><a href="3511.html">青嶺ろにたなびく雲のいさよひに物をぞ思ふ年のこのころ</a></p>
<h2></h2>
<p><a href="3512.html">一嶺ろに言はるものから青嶺ろにいさよふ雲の寄そり妻はも</a></p>
<h2></h2>
<p><a href="3513.html">夕さればみ山を去らぬ布雲のあぜか絶えむと言ひし子ろはも</a></p>
<h2></h2>
<p><a href="3514.html">高き嶺に雲のつくのす我れさへに君につきなな高嶺と思ひて</a></p>
<h2></h2>
<p><a href="3515.html">我が面の忘れむしだは国はふり嶺に立つ雲を見つつ偲はせ</a></p>
<h2></h2>
<p><a href="3516.html">対馬の嶺は下雲あらなふ可牟の嶺にたなびく雲を見つつ偲はも</a></p>
<h2></h2>
<p><a href="3517.html">白雲の絶えにし妹をあぜせろと心に乗りてここば愛しけ</a></p>
<h2></h2>
<p><a href="3518.html">岩の上にいかかる雲のかのまづく人ぞおたはふいざ寝しめとら</a></p>
<h2></h2>
<p><a href="3519.html">汝が母に嘖られ我は行く青雲の出で来我妹子相見て行かむ</a></p>
<h2></h2>
<p><a href="3520.html">面形の忘れむしだは大野ろにたなびく雲を見つつ偲はむ</a></p>
<h2></h2>
<p><a href="3521.html">烏とふ大をそ鳥のまさでにも来まさぬ君をころくとぞ鳴く</a></p>
<h2></h2>
<p><a href="3522.html">昨夜こそば子ろとさ寝しか雲の上ゆ鳴き行く鶴の間遠く思ほゆ</a></p>
<h2></h2>
<p><a href="3523.html">坂越えて安倍の田の面に居る鶴のともしき君は明日さへもがも</a></p>
<h2></h2>
<p><a href="3524.html">まを薦の節の間近くて逢はなへば沖つま鴨の嘆きぞ我がする</a></p>
<h2></h2>
<p><a href="3525.html">水久君野に鴨の這ほのす子ろが上に言緒ろ延へていまだ寝なふも</a></p>
<h2></h2>
<p><a href="3526.html">沼二つ通は鳥が巣我が心二行くなもとなよ思はりそね</a></p>
<h2></h2>
<p><a href="3527.html">沖に住も小鴨のもころ八尺鳥息づく妹を置きて来のかも</a></p>
<h2></h2>
<p><a href="3528.html">水鳥の立たむ装ひに妹のらに物言はず来にて思ひかねつも</a></p>
<h2></h2>
<p><a href="3529.html">等夜の野に兎ねらはりをさをさも寝なへ子ゆゑに母に嘖はえ</a></p>
<h2></h2>
<p><a href="3530.html">さを鹿の伏すや草むら見えずとも子ろが金門よ行かくしえしも</a></p>
<h2></h2>
<p><a href="3531.html">妹をこそ相見に来しか眉引きの横山辺ろの獣なす思へる</a></p>
<h2></h2>
<p><a href="3532.html">春の野に草食む駒の口やまず我を偲ふらむ家の子ろはも</a></p>
<h2></h2>
<p><a href="3533.html">人の子の愛しけしだは浜洲鳥足悩む駒の惜しけくもなし</a></p>
<h2></h2>
<p><a href="3534.html">赤駒が門出をしつつ出でかてにせしを見立てし家の子らはも</a></p>
<h2></h2>
<p><a href="3535.html">己が命をおほにな思ひそ庭に立ち笑ますがからに駒に逢ふものを</a></p>
<h2></h2>
<p><a href="3536.html">赤駒を打ちてさ緒引き心引きいかなる背なか我がり来むと言ふ</a></p>
<h2></h2>
<p><a href="3537.html">くへ越しに麦食む小馬のはつはつに相見し子らしあやに愛しも</a></p>
<h2>或本歌曰</h2>
<p><a href="3537S.html">馬柵越し麦食む駒のはつはつに新肌触れし子ろし愛しも </a></p>
<h2></h2>
<p><a href="3538.html">広橋を馬越しがねて心のみ妹がり遣りて我はここにして</a></p>
<h2>或本歌發句曰</h2>
<p><a href="3538S.html">小林に駒を馳ささげ</a></p>
<h2></h2>
<p><a href="3539.html">あずの上に駒を繋ぎて危ほかど人妻子ろを息に我がする</a></p>
<h2></h2>
<p><a href="3540.html">左和多里の手児にい行き逢ひ赤駒が足掻きを速み言問はず来ぬ</a></p>
<h2></h2>
<p><a href="3541.html">あずへから駒の行ごのす危はとも人妻子ろをまゆかせらふも</a></p>
<h2></h2>
<p><a href="3542.html">さざれ石に駒を馳させて心痛み我が思ふ妹が家のあたりかも</a></p>
<h2></h2>
<p><a href="3543.html">むろがやの都留の堤の成りぬがに子ろは言へどもいまだ寝なくに</a></p>
<h2></h2>
<p><a href="3544.html">あすか川下濁れるを知らずして背ななと二人さ寝て悔しも</a></p>
<h2></h2>
<p><a href="3545.html">あすか川堰くと知りせばあまた夜も率寝て来ましを堰くと知りせば</a></p>
<h2></h2>
<p><a href="3546.html">青柳の張らろ川門に汝を待つと清水は汲まず立ち処平すも</a></p>
<h2></h2>
<p><a href="3547.html">あぢの棲む須沙の入江の隠り沼のあな息づかし見ず久にして</a></p>
<h2></h2>
<p><a href="3548.html">鳴る瀬ろにこつの寄すなすいとのきて愛しけ背ろに人さへ寄すも</a></p>
<h2></h2>
<p><a href="3549.html">多由比潟潮満ちわたるいづゆかも愛しき背ろが我がり通はむ</a></p>
<h2></h2>
<p><a href="3550.html">おしていなと稲は搗かねど波の穂のいたぶらしもよ昨夜ひとり寝て</a></p>
<h2></h2>
<p><a href="3551.html">阿遅可麻の潟にさく波平瀬にも紐解くものか愛しけを置きて</a></p>
<h2></h2>
<p><a href="3552.html">まつが浦にさわゑうら立ちま人言思ほすなもろ我が思ほのすも</a></p>
<h2></h2>
<p><a href="3553.html">あじかまの可家の港に入る潮のこてたずくもが入りて寝まくも</a></p>
<h2></h2>
<p><a href="3554.html">妹が寝る床のあたりに岩ぐくる水にもがもよ入りて寝まくも</a></p>
<h2></h2>
<p><a href="3555.html">麻久良我の許我の渡りの韓楫の音高しもな寝なへ子ゆゑに</a></p>
<h2></h2>
<p><a href="3556.html">潮船の置かれば愛しさ寝つれば人言繁し汝をどかもしむ</a></p>
<h2></h2>
<p><a href="3557.html">悩ましけ人妻かもよ漕ぐ舟の忘れはせなないや思ひ増すに</a></p>
<h2></h2>
<p><a href="3558.html">逢はずして行かば惜しけむ麻久良我の許我漕ぐ船に君も逢はぬかも</a></p>
<h2></h2>
<p><a href="3559.html">大船を舳ゆも艫ゆも堅めてし許曽の里人あらはさめかも</a></p>
<h2></h2>
<p><a href="3560.html">ま金ふく丹生のま朱の色に出て言はなくのみぞ我が恋ふらくは</a></p>
<h2></h2>
<p><a href="3561.html">金門田を荒垣ま斎み日が照れば雨を待とのす君をと待とも</a></p>
<h2></h2>
<p><a href="3562.html">荒礒やに生ふる玉藻のうち靡きひとりや寝らむ我を待ちかねて</a></p>
<h2></h2>
<p><a href="3563.html">比多潟の礒のわかめの立ち乱え我をか待つなも昨夜も今夜も</a></p>
<h2></h2>
<p><a href="3564.html">古須気ろの浦吹く風のあどすすか愛しけ子ろを思ひ過ごさむ</a></p>
<h2></h2>
<p><a href="3565.html">かの子ろと寝ずやなりなむはだすすき宇良野の山に月片寄るも</a></p>
<h2></h2>
<p><a href="3566.html">我妹子に我が恋ひ死なばそわへかも神に負ほせむ心知らずて</a></p>
<h2>防人歌</h2>
<p><a href="3567.html">置きて行かば妹はま愛し持ちて行く梓の弓の弓束にもがも</a></p>
<h2></h2>
<p><a href="3568.html">後れ居て恋ひば苦しも朝猟の君が弓にもならましものを</a></p>
<h2></h2>
<p><a href="3569.html">防人に立ちし朝開の金戸出にたばなれ惜しみ泣きし子らはも</a></p>
<h2></h2>
<p><a href="3570.html">葦の葉に夕霧立ちて鴨が音の寒き夕し汝をば偲はむ</a></p>
<h2></h2>
<p><a href="3571.html">己妻を人の里に置きおほほしく見つつぞ来ぬるこの道の間</a></p>
<h2>譬喩歌</h2>
<p><a href="3572.html">あど思へか阿自久麻山の弓絃葉のふふまる時に風吹かずかも</a></p>
<h2></h2>
<p><a href="3573.html">あしひきの山かづらかげましばにも得がたきかげを置きや枯らさむ</a></p>
<h2></h2>
<p><a href="3574.html">小里なる花橘を引き攀ぢて折らむとすれどうら若みこそ</a></p>
<h2></h2>
<p><a href="3575.html">美夜自呂のすかへに立てるかほが花な咲き出でそねこめて偲はむ</a></p>
<h2></h2>
<p><a href="3576.html">苗代の小水葱が花を衣に摺りなるるまにまにあぜか愛しけ</a></p>
<h2>挽歌</h2>
<p><a href="3577.html">愛し妹をいづち行かめと山菅のそがひに寝しく今し悔しも</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
