#!/usr/local/bin/python
# -*- coding: utf-8; -*-

HEADER = """<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta http-equiv="Content-Script-Type" content="text/javascript" />
    <link rel="SHORTCUT ICON" href="images/favicon.ico" />
    <link rel="stylesheet" href="styles/style.css" type="text/css" />
    <title>本日の万葉集 / 万葉集全首（第二十巻）</title>
</head>

<body>
<div id="page">

 <div id="header">
   <a id="logo" name="logo" href="index.html">
     本日の<br />万葉集
   </a>

   <div id="menu">
     <ul>
       <li><a class="calibrate" href="result.html">利用実績</a></li>
       <li><a class="calibrate" href="sample.cgi">サンプル</a></li>
       <li><a href="register.cgi">登録/設定変更<br />（無料）</a></li>
       <li><a class="calibrate" href="cancel.html">利用解除</a></li>
     </ul>
   </div>
 </div>

 <div id="content">

 <div>
   <form action="search.cgi" method="post">
     <table summary="万葉集検索" class="search">
       <tr>
         <td>万葉集検索</td>
         <td><input type="text" name="keyword" value="%(keyword)s" accesskey="k" tabindex="1" /></td>
         <td><input name="submitted" type="hidden" value="submitted" />
             <input type="submit" value="&nbsp;&nbsp;検索&nbsp;&nbsp;" accesskey="s" tabindex="2" /></td>
       </tr>
     </table>
   </form>
 </div>

 <h1>万葉集全首（第二十巻）</h1>

 <h2>幸行於山村之時歌二首 / 先太上天皇詔陪従王臣曰夫諸王卿等宣賦和歌而奏即御口号曰</h2>
<p><a href="4293.html">あしひきの山行きしかば山人の我れに得しめし山づとぞこれ</a></p>
<h2>（幸行於山村之時歌二首） / 舎人親王應詔奉和歌一首</h2>
<p><a href="4294.html">あしひきの山に行きけむ山人の心も知らず山人や誰れ</a></p>
<h2>天平勝寶五年八月十二日二三大夫等各提壷酒  登高圓野聊述所心作歌三首</h2>
<p><a href="4295.html">高円の尾花吹き越す秋風に紐解き開けな直ならずとも</a></p>
<h2>（天平勝寶五年八月十二日二三大夫等各提壷酒  登高圓野聊述所心作歌三首）</h2>
<p><a href="4296.html">天雲に雁ぞ鳴くなる高円の萩の下葉はもみちあへむかも</a></p>
<h2>（天平勝寶五年八月十二日二三大夫等各提壷酒  登高圓野聊述所心作歌三首）</h2>
<p><a href="4297.html">をみなへし秋萩しのぎさを鹿の露別け鳴かむ高圓の野ぞ</a></p>
<h2>六年正月四日氏人等賀集于少納言大伴宿祢家持之宅宴飲歌三首</h2>
<p><a href="4298.html">霜の上に霰た走りいやましに我れは参ゐ来む年の緒長く [古今未詳]</a></p>
<h2>（六年正月四日氏人等賀集于少納言大伴宿祢家持之宅宴飲歌三首）</h2>
<p><a href="4299.html">年月は新た新たに相見れど我が思ふ君は飽き足らぬかも [古今未詳]</a></p>
<h2>（六年正月四日氏人等賀集于少納言大伴宿祢家持之宅宴飲歌三首）</h2>
<p><a href="4300.html">霞立つ春の初めを今日のごと見むと思へば楽しとぞ思ふ</a></p>
<h2>七日天皇太上天皇皇大后&lt;在&gt;於東常宮南大殿肆宴歌一首</h2>
<p><a href="4301.html">印南野の赤ら柏は時はあれど君を我が思ふ時はさねなし</a></p>
<h2>三月十九日家持之庄門槻樹下宴飲歌二首</h2>
<p><a href="4302.html">山吹は撫でつつ生ほさむありつつも君来ましつつかざしたりけり</a></p>
<h2>（三月十九日家持之庄門槻樹下宴飲歌二首）</h2>
<p><a href="4303.html">我が背子が宿の山吹咲きてあらばやまず通はむいや年の端に</a></p>
<h2>同月廿五日左大臣橘卿宴于山田御母之宅歌一首</h2>
<p><a href="4304.html">山吹の花の盛りにかくのごと君を見まくは千年にもがも</a></p>
<h2>詠霍公鳥歌一首</h2>
<p><a href="4305.html">木の暗の茂き峰の上を霍公鳥鳴きて越ゆなり今し来らしも</a></p>
<h2>七夕歌八首</h2>
<p><a href="4306.html">初秋風涼しき夕解かむとぞ紐は結びし妹に逢はむため</a></p>
<h2>（七夕歌八首）</h2>
<p><a href="4307.html">秋と言へば心ぞ痛きうたて異に花になそへて見まく欲りかも</a></p>
<h2>（七夕歌八首）</h2>
<p><a href="4308.html">初尾花花に見むとし天の川へなりにけらし年の緒長く</a></p>
<h2>（七夕歌八首）</h2>
<p><a href="4309.html">秋風に靡く川辺のにこ草のにこよかにしも思ほゆるかも</a></p>
<h2>（七夕歌八首）</h2>
<p><a href="4310.html">秋されば霧立ちわたる天の川石並置かば継ぎて見むかも</a></p>
<h2>（七夕歌八首）</h2>
<p><a href="4311.html">秋風に今か今かと紐解きてうら待ち居るに月かたぶきぬ</a></p>
<h2>（七夕歌八首）</h2>
<p><a href="4312.html">秋草に置く白露の飽かずのみ相見るものを月をし待たむ</a></p>
<h2>（七夕歌八首）</h2>
<p><a href="4313.html">青波に袖さへ濡れて漕ぐ舟のかし振るほとにさ夜更けなむか</a></p>
<h2></h2>
<p><a href="4314.html">八千種に草木を植ゑて時ごとに咲かむ花をし見つつ偲はな</a></p>
<h2></h2>
<p><a href="4315.html">宮人の袖付け衣秋萩ににほひよろしき高圓の宮</a></p>
<h2></h2>
<p><a href="4316.html">高圓の宮の裾廻の野づかさに今咲けるらむをみなへしはも</a></p>
<h2></h2>
<p><a href="4317.html">秋野には今こそ行かめもののふの男女の花にほひ見に</a></p>
<h2></h2>
<p><a href="4318.html">秋の野に露負へる萩を手折らずてあたら盛りを過ぐしてむとか</a></p>
<h2></h2>
<p><a href="4319.html">高圓の秋野の上の朝霧に妻呼ぶ壮鹿出で立つらむか</a></p>
<h2></h2>
<p><a href="4320.html">大夫の呼び立てしかばさを鹿の胸別け行かむ秋野萩原</a></p>
<h2>天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌</h2>
<p><a href="4321.html">畏きや命被り明日ゆりや草がむた寝む妹なしにして</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4322.html">我が妻はいたく恋ひらし飲む水に影さへ見えてよに忘られず</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4323.html">時々の花は咲けども何すれぞ母とふ花の咲き出来ずけむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4324.html">遠江志留波の礒と尓閇の浦と合ひてしあらば言も通はむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4325.html">父母も花にもがもや草枕旅は行くとも捧ごて行かむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4326.html">父母が殿の後方のももよ草百代いでませ我が来るまで</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4327.html">我が妻も絵に描き取らむ暇もが旅行く我れは見つつ偲はむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4328.html">大君の命畏み磯に触り海原渡る父母を置きて</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4329.html">八十国は難波に集ひ船かざり我がせむ日ろを見も人もがも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4330.html">難波津に装ひ装ひて今日の日や出でて罷らむ見る母なしに</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）追痛防人悲別之心作歌一首[并短歌]</h2>
<p><a href="4331.html">大君の 遠の朝廷と しらぬひ 筑紫の国は 敵守る おさへの城ぞと 聞こし食す 四方の国には 人さはに 満ちてはあれど 鶏が鳴く 東男は 出で向ひ かへり見せずて 勇みたる 猛き軍士と ねぎたまひ 任けのまにまに たらちねの 母が目離れて 若草の 妻をも巻かず あらたまの 月日数みつつ 葦が散る 難波の御津に 大船に ま櫂しじ貫き 朝なぎに 水手ととのへ 夕潮に 楫引き折り 率ひて 漕ぎ行く君は 波の間を い行きさぐくみ ま幸くも 早く至りて 大君の 命のまにま 大夫の 心を持ちて あり廻り 事し終らば つつまはず 帰り来ませと 斎瓮を 床辺に据ゑて 白栲の 袖折り返し ぬばたまの 黒髪敷きて 長き日を 待ちかも恋ひむ 愛しき妻らは </a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（追痛防人悲別之心作歌一首[并短歌]）</h2>
<p><a href="4332.html">大夫の靫取り負ひて出でて行けば別れを惜しみ嘆きけむ妻</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（追痛防人悲別之心作歌一首[并短歌]）</h2>
<p><a href="4333.html">鶏が鳴く東壮士の妻別れ悲しくありけむ年の緒長み</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4334.html">海原を遠く渡りて年経とも子らが結べる紐解くなゆめ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4335.html">今替る新防人が船出する海原の上に波なさきそね</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4336.html">防人の堀江漕ぎ出る伊豆手船楫取る間なく恋は繁けむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4337.html">水鳥の立ちの急ぎに父母に物言はず来にて今ぞ悔しき</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4338.html">畳薦牟良自が礒の離磯の母を離れて行くが悲しさ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4339.html">国廻るあとりかまけり行き廻り帰り来までに斎ひて待たね</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4340.html">父母え斎ひて待たね筑紫なる水漬く白玉取りて来までに</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4341.html">橘の美袁利の里に父を置きて道の長道は行きかてのかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4342.html">真木柱ほめて造れる殿のごといませ母刀自面変はりせず</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4343.html">我ろ旅は旅と思ほど家にして子持ち痩すらむ我が妻愛しも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4344.html">忘らむて野行き山行き我れ来れど我が父母は忘れせのかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4345.html">我妹子と二人我が見しうち寄する駿河の嶺らは恋しくめあるか</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4346.html">父母が頭掻き撫で幸くあれて言ひし言葉ぜ忘れかねつる</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4347.html">家にして恋ひつつあらずは汝が佩ける大刀になりても斎ひてしかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4348.html">たらちねの母を別れてまこと我れ旅の仮廬に安く寝むかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4349.html">百隈の道は来にしをまたさらに八十島過ぎて別れか行かむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4350.html">庭中の阿須波の神に小柴さし我れは斎はむ帰り来までに</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4351.html">旅衣八重着重ねて寐のれどもなほ肌寒し妹にしあらねば</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4352.html">道の辺の茨のうれに延ほ豆のからまる君をはかれか行かむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4353.html">家風は日に日に吹けど我妹子が家言持ちて来る人もなし</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4354.html">たちこもの立ちの騒きに相見てし妹が心は忘れせぬかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4355.html">よそにのみ見てや渡らも難波潟雲居に見ゆる島ならなくに</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4356.html">我が母の袖もち撫でて我がからに泣きし心を忘らえのかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4357.html">葦垣の隈処に立ちて我妹子が袖もしほほに泣きしぞ思はゆ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4358.html">大君の命畏み出で来れば我の取り付きて言ひし子なはも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4359.html">筑紫辺に舳向かる船のいつしかも仕へまつりて国に舳向かも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）陳私拙懐一首&lt;[并短歌]&gt;</h2>
<p><a href="4360.html">皇祖の 遠き御代にも 押し照る 難波の国に 天の下 知らしめしきと 今の緒に 絶えず言ひつつ かけまくも あやに畏し 神ながら 我ご大君の うち靡く 春の初めは 八千種に 花咲きにほひ 山見れば 見の羨しく 川見れば 見のさやけく ものごとに 栄ゆる時と 見したまひ 明らめたまひ 敷きませる 難波の宮は 聞こし食す 四方の国より 奉る 御調の船は 堀江より 水脈引きしつつ 朝なぎに 楫引き上り 夕潮に 棹さし下り あぢ群の 騒き競ひて 浜に出でて 海原見れば 白波の 八重をるが上に 海人小船 はららに浮きて 大御食に 仕へまつると をちこちに 漁り釣りけり そきだくも おぎろなきかも こきばくも ゆたけきかも ここ見れば うべし神代ゆ 始めけらしも </a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（陳私拙懐一首&lt;[并短歌]&gt;）</h2>
<p><a href="4361.html">桜花今盛りなり難波の海押し照る宮に聞こしめすなへ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（陳私拙懐一首&lt;[并短歌]&gt;）</h2>
<p><a href="4362.html">海原のゆたけき見つつ葦が散る難波に年は経ぬべく思ほゆ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4363.html">難波津に御船下ろ据ゑ八十楫貫き今は漕ぎぬと妹に告げこそ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4364.html">防人に立たむ騒きに家の妹がなるべきことを言はず来ぬかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4365.html">押し照るや難波の津ゆり船装ひ我れは漕ぎぬと妹に告ぎこそ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4366.html">常陸指し行かむ雁もが我が恋を記して付けて妹に知らせむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4367.html">我が面の忘れもしだは筑波嶺を振り放け見つつ妹は偲はね</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4368.html">久慈川は幸くあり待て潮船にま楫しじ貫き我は帰り来む</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4369.html">筑波嶺のさ百合の花の夜床にも愛しけ妹ぞ昼も愛しけ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4370.html">霰降り鹿島の神を祈りつつ皇御軍に我れは来にしを</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4371.html">橘の下吹く風のかぐはしき筑波の山を恋ひずあらめかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4372.html">足柄の み坂給はり 返り見ず 我れは越え行く 荒し夫も 立しやはばかる 不破の関 越えて我は行く 馬の爪 筑紫の崎に 留まり居て 我れは斎はむ 諸々は 幸くと申す 帰り来までに </a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4373.html">今日よりは返り見なくて大君の醜の御楯と出で立つ我れは</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4374.html">天地の神を祈りて猟矢貫き筑紫の島を指して行く我れは</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4375.html">松の木の並みたる見れば家人の我れを見送ると立たりしもころ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4376.html">旅行きに行くと知らずて母父に言申さずて今ぞ悔しけ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4377.html">母刀自も玉にもがもや戴きてみづらの中に合へ巻かまくも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4378.html">月日やは過ぐは行けども母父が玉の姿は忘れせなふも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4379.html">白波の寄そる浜辺に別れなばいともすべなみ八度袖振る</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4380.html">難波津を漕ぎ出て見れば神さぶる生駒高嶺に雲ぞたなびく</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4381.html">国々の防人集ひ船乗りて別るを見ればいともすべなし</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4382.html">ふたほがみ悪しけ人なりあたゆまひ我がする時に防人にさす</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4383.html">津の国の海の渚に船装ひ立し出も時に母が目もがも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4384.html">暁のかはたれ時に島蔭を漕ぎ去し船のたづき知らずも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4385.html">行こ先に波なとゑらひ後方には子をと妻をと置きてとも来ぬ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4386.html">我が門の五本柳いつもいつも母が恋すす業りましつしも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4387.html">千葉の野の児手柏のほほまれどあやに愛しみ置きて誰が来ぬ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4388.html">旅とへど真旅になりぬ家の妹が着せし衣に垢付きにかり</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4389.html">潮舟の舳越そ白波にはしくも負ふせたまほか思はへなくに</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4390.html">群玉の枢にくぎさし堅めとし妹が心は動くなめかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4391.html">国々の社の神に幣奉り贖乞ひすなむ妹が愛しさ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4392.html">天地のいづれの神を祈らばか愛し母にまた言とはむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4393.html">大君の命にされば父母を斎瓮と置きて参ゐ出来にしを</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4394.html">大君の命畏み弓の共さ寝かわたらむ長けこの夜を</a></p>
<h2>獨惜龍田山櫻花歌一首</h2>
<p><a href="4395.html">龍田山見つつ越え来し桜花散りか過ぎなむ我が帰るとに</a></p>
<h2>獨見江水浮漂糞怨恨貝玉不依作歌一首</h2>
<p><a href="4396.html">堀江より朝潮満ちに寄る木屑貝にありせばつとにせましを</a></p>
<h2>在舘門見江南美女作歌一首</h2>
<p><a href="4397.html">見わたせば向つ峰の上の花にほひ照りて立てるは愛しき誰が妻</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）為防人情陳思作歌一首[并短歌]</h2>
<p><a href="4398.html">大君の 命畏み 妻別れ 悲しくはあれど 大夫の 心振り起し 取り装ひ 門出をすれば たらちねの 母掻き撫で 若草の 妻は取り付き 平らけく 我れは斎はむ ま幸くて 早帰り来と 真袖もち 涙を拭ひ むせひつつ 言問ひすれば 群鳥の 出で立ちかてに とどこほり かへり見しつつ いや遠に 国を来離れ いや高に 山を越え過ぎ 葦が散る 難波に来居て 夕潮に 船を浮けすゑ 朝なぎに 舳向け漕がむと さもらふと 我が居る時に 春霞 島廻に立ちて 鶴が音の 悲しく鳴けば はろはろに 家を思ひ出 負ひ征矢の そよと鳴るまで 嘆きつるかも </a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（為防人情陳思作歌一首[并短歌]）</h2>
<p><a href="4399.html">海原に霞たなびき鶴が音の悲しき宵は国辺し思ほゆ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（為防人情陳思作歌一首[并短歌]）</h2>
<p><a href="4400.html">家思ふと寐を寝ず居れば鶴が鳴く葦辺も見えず春の霞に</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4401.html">唐衣裾に取り付き泣く子らを置きてぞ来のや母なしにして</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4402.html">ちはやぶる神の御坂に幣奉り斎ふ命は母父がため</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4403.html">大君の命畏み青雲のとのびく山を越よて来ぬかむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4404.html">難波道を行きて来までと我妹子が付けし紐が緒絶えにけるかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4405.html">我が妹子が偲ひにせよと付けし紐糸になるとも我は解かじとよ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4406.html">我が家ろに行かも人もが草枕旅は苦しと告げ遣らまくも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4407.html">ひな曇り碓氷の坂を越えしだに妹が恋しく忘らえぬかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）陳防人悲別之情歌一首[并短歌]</h2>
<p><a href="4408.html">大君の 任けのまにまに 島守に 我が立ち来れば ははそ葉の 母の命は み裳の裾 摘み上げ掻き撫で ちちの実の 父の命は 栲づのの 白髭の上ゆ 涙垂り 嘆きのたばく 鹿子じもの ただ独りして 朝戸出の 愛しき我が子 あらたまの 年の緒長く 相見ずは 恋しくあるべし 今日だにも 言問ひせむと 惜しみつつ 悲しびませば 若草の 妻も子どもも をちこちに さはに囲み居 春鳥の 声のさまよひ 白栲の 袖泣き濡らし たづさはり 別れかてにと 引き留め 慕ひしものを 大君の 命畏み 玉桙の 道に出で立ち 岡の崎 い廻むるごとに 万たび かへり見しつつ はろはろに 別れし来れば 思ふそら 安くもあらず 恋ふるそら 苦しきものを うつせみの 世の人なれば たまきはる 命も知らず 海原の 畏き道を 島伝ひ い漕ぎ渡りて あり廻り 我が来るまでに 平けく 親はいまさね つつみなく 妻は待たせと 住吉の 我が統め神に 幣奉り 祈り申して 難波津に 船を浮け据ゑ 八十楫貫き 水手ととのへて 朝開き 我は漕ぎ出ぬと 家に告げこそ </a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（陳防人悲別之情歌一首[并短歌]）</h2>
<p><a href="4409.html">家人の斎へにかあらむ平けく船出はしぬと親に申さね</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（陳防人悲別之情歌一首[并短歌]）</h2>
<p><a href="4410.html">み空行く雲も使と人は言へど家づと遣らむたづき知らずも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（陳防人悲別之情歌一首[并短歌]）</h2>
<p><a href="4411.html">家づとに貝ぞ拾へる浜波はいやしくしくに高く寄すれど</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）（陳防人悲別之情歌一首[并短歌]）</h2>
<p><a href="4412.html">島蔭に我が船泊てて告げ遣らむ使を無みや恋ひつつ行かむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4413.html">枕太刀腰に取り佩きま愛しき背ろが罷き来む月の知らなく</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4414.html">大君の命畏み愛しけ真子が手離り島伝ひ行く</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4415.html">白玉を手に取り持して見るのすも家なる妹をまた見てももや</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4416.html">草枕旅行く背なが丸寝せば家なる我れは紐解かず寝む</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4417.html">赤駒を山野にはがし捕りかにて多摩の横山徒歩ゆか遣らむ</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4418.html">我が門の片山椿まこと汝れ我が手触れなな土に落ちもかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4419.html">家ろには葦火焚けども住みよけを筑紫に至りて恋しけ思はも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4420.html">草枕旅の丸寝の紐絶えば我が手と付けろこれの針持し</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4421.html">我が行きの息づくしかば足柄の峰延ほ雲を見とと偲はね</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4422.html">我が背なを筑紫へ遣りて愛しみ帯は解かななあやにかも寝も</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4423.html">足柄の御坂に立して袖振らば家なる妹はさやに見もかも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4424.html">色深く背なが衣は染めましをみ坂給らばまさやかに見む</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4425.html">防人に行くは誰が背と問ふ人を見るが羨しさ物思ひもせず</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4426.html">天地の神に幣置き斎ひつついませ我が背な我れをし思はば</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4427.html">家の妹ろ我を偲ふらし真結ひに結ひし紐の解くらく思へば</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4428.html">我が背なを筑紫は遣りて愛しみえひは解かななあやにかも寝む</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4429.html">馬屋なる縄立つ駒の後るがへ妹が言ひしを置きて悲しも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4430.html">荒し男のいをさ手挟み向ひ立ちかなるましづみ出でてと我が来る</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4431.html">笹が葉のさやぐ霜夜に七重着る衣に増せる子ろが肌はも</a></p>
<h2>（天平勝寳七歳乙未二月相替遣筑紫諸國防人等歌）</h2>
<p><a href="4432.html">障へなへぬ命にあれば愛し妹が手枕離れあやに悲しも</a></p>
<h2>三月三日檢校防人  勅使并兵部使人等同集飲宴作歌三首</h2>
<p><a href="4433.html">朝な朝な上がるひばりになりてしか都に行きて早帰り来む</a></p>
<h2>（三月三日檢校防人  勅使并兵部使人等同集飲宴作歌三首）</h2>
<p><a href="4434.html">ひばり上がる春へとさやになりぬれば都も見えず霞たなびく</a></p>
<h2>（三月三日檢校防人  勅使并兵部使人等同集飲宴作歌三首）</h2>
<p><a href="4435.html">ふふめりし花の初めに来し我れや散りなむ後に都へ行かむ</a></p>
<h2>昔年相替防人歌一首</h2>
<p><a href="4436.html">闇の夜の行く先知らず行く我れをいつ来まさむと問ひし子らはも</a></p>
<h2>先太上天皇御製霍公鳥歌一首  [日本根子高瑞日清足姫天皇也]</h2>
<p><a href="4437.html">霍公鳥なほも鳴かなむ本つ人かけつつもとな我を音し泣くも</a></p>
<h2>薩妙觀應詔奉和歌一首</h2>
<p><a href="4438.html">霍公鳥ここに近くを来鳴きてよ過ぎなむ後に験あらめやも</a></p>
<h2>冬日幸于靱負御井之時内命婦石川朝臣應詔賦雪歌一首  [諱曰邑婆]</h2>
<p><a href="4439.html">松が枝の土に着くまで降る雪を見ずてや妹が隠り居るらむ</a></p>
<h2>上総國朝集使大&lt;掾&gt;大原真人今城向京之時郡司妻女等餞之歌二首</h2>
<p><a href="4440.html">足柄の八重山越えていましなば誰れをか君と見つつ偲はむ</a></p>
<h2>（上総國朝集使大&lt;掾&gt;大原真人今城向京之時郡司妻女等餞之歌二首）</h2>
<p><a href="4441.html">立ちしなふ君が姿を忘れずは世の限りにや恋ひわたりなむ</a></p>
<h2>五月九日兵部少輔大伴宿祢家持之宅集宴&lt;歌&gt;四首</h2>
<p><a href="4442.html">我が背子が宿のなでしこ日並べて雨は降れども色も変らず</a></p>
<h2>（五月九日兵部少輔大伴宿祢家持之宅集宴&lt;歌&gt;四首）</h2>
<p><a href="4443.html">ひさかたの雨は降りしくなでしこがいや初花に恋しき我が背</a></p>
<h2>（五月九日兵部少輔大伴宿祢家持之宅集宴&lt;歌&gt;四首）</h2>
<p><a href="4444.html">我が背子が宿なる萩の花咲かむ秋の夕は我れを偲はせ</a></p>
<h2>即聞鴬哢作歌一首</h2>
<p><a href="4445.html">鴬の声は過ぎぬと思へどもしみにし心なほ恋ひにけり</a></p>
<h2>同月十一日左大臣橘卿宴右大辨丹比國人真人之宅歌三首</h2>
<p><a href="4446.html">我が宿に咲けるなでしこ賄はせむゆめ花散るないやをちに咲け</a></p>
<h2>（同月十一日左大臣橘卿宴右大辨丹比國人真人之宅歌三首）</h2>
<p><a href="4447.html">賄しつつ君が生ほせるなでしこが花のみ問はむ君ならなくに</a></p>
<h2>（同月十一日左大臣橘卿宴右大辨丹比國人真人之宅歌三首）</h2>
<p><a href="4448.html">あぢさゐの八重咲くごとく八つ代にをいませ我が背子見つつ偲はむ</a></p>
<h2>十八日左大臣&lt;宴&gt;於兵部卿橘奈良麻呂朝臣之宅歌三首</h2>
<p><a href="4449.html">なでしこが花取り持ちてうつらうつら見まくの欲しき君にもあるかも</a></p>
<h2>（十八日左大臣&lt;宴&gt;於兵部卿橘奈良麻呂朝臣之宅歌三首）</h2>
<p><a href="4450.html">我が背子が宿のなでしこ散らめやもいや初花に咲きは増すとも</a></p>
<h2>（十八日左大臣&lt;宴&gt;於兵部卿橘奈良麻呂朝臣之宅歌三首）</h2>
<p><a href="4451.html">うるはしみ我が思ふ君はなでしこが花になそへて見れど飽かぬかも</a></p>
<h2>八月十三日在内南安殿肆宴歌二首</h2>
<p><a href="4452.html">娘子らが玉裳裾引くこの庭に秋風吹きて花は散りつつ</a></p>
<h2>（八月十三日在内南安殿肆宴歌二首）</h2>
<p><a href="4453.html">秋風の吹き扱き敷ける花の庭清き月夜に見れど飽かぬかも</a></p>
<h2>十一月廿八日左大臣集於兵部卿橘奈良麻呂朝臣宅宴歌一首</h2>
<p><a href="4454.html">高山の巌に生ふる菅の根のねもころごろに降り置く白雪</a></p>
<h2>天平元年班田之時使葛城王従山背國贈薩妙觀命婦等所歌一首[副芹子Ｌ]</h2>
<p><a href="4455.html">あかねさす昼は田賜びてぬばたまの夜のいとまに摘める芹これ</a></p>
<h2>（天平元年班田之時使葛城王従山背國贈薩妙觀命婦等所歌一首[副芹子Ｌ]）薩妙觀命婦報贈歌一首</h2>
<p><a href="4456.html">大夫と思へるものを太刀佩きて可尓波の田居に芹ぞ摘みける</a></p>
<h2>天平勝寶八歳丙申二月朔乙酉廿四日戊申  太上天皇&lt;大&gt;后幸行於河内離宮  經信以壬子傳幸於難波宮也  三月七日於河内國伎人郷馬國人之家宴歌三首</h2>
<p><a href="4457.html">住吉の浜松が根の下延へて我が見る小野の草な刈りそね</a></p>
<h2>（天平勝寶八歳丙申二月朔乙酉廿四日戊申  太上天皇&lt;大&gt;后幸行於河内離宮  經信以壬子傳幸於難波宮也  三月七日於河内國伎人郷馬國人之家宴歌三首）</h2>
<p><a href="4458.html">にほ鳥の息長川は絶えぬとも君に語らむ言尽きめやも [古新未詳]</a></p>
<h2>（天平勝寶八歳丙申二月朔乙酉廿四日戊申  太上天皇&lt;大&gt;后幸行於河内離宮  經信以壬子傳幸於難波宮也  三月七日於河内國伎人郷馬國人之家宴歌三首）</h2>
<p><a href="4459.html">葦刈りに堀江漕ぐなる楫の音は大宮人の皆聞くまでに</a></p>
<h2></h2>
<p><a href="4460.html">堀江漕ぐ伊豆手の舟の楫つくめ音しば立ちぬ水脈早みかも</a></p>
<h2></h2>
<p><a href="4461.html">堀江より水脈さかのぼる楫の音の間なくぞ奈良は恋しかりける</a></p>
<h2></h2>
<p><a href="4462.html">舟競ふ堀江の川の水際に来居つつ鳴くは都鳥かも</a></p>
<h2></h2>
<p><a href="4463.html">霍公鳥まづ鳴く朝明いかにせば我が門過ぎじ語り継ぐまで</a></p>
<h2></h2>
<p><a href="4464.html">霍公鳥懸けつつ君が松蔭に紐解き放くる月近づきぬ</a></p>
<h2>喩族歌一首[并短歌]</h2>
<p><a href="4465.html">久方の 天の門開き 高千穂の 岳に天降りし 皇祖の 神の御代より はじ弓を 手握り持たし 真鹿子矢を 手挟み添へて 大久米の ますらたけをを 先に立て 靫取り負ほせ 山川を 岩根さくみて 踏み通り 国求ぎしつつ ちはやぶる 神を言向け まつろはぬ 人をも和し 掃き清め 仕へまつりて 蜻蛉島 大和の国の 橿原の 畝傍の宮に 宮柱 太知り立てて 天の下 知らしめしける 天皇の 天の日継と 継ぎてくる 君の御代御代 隠さはぬ 明き心を すめらへに 極め尽して 仕へくる 祖の官と 言立てて 授けたまへる 子孫の いや継ぎ継ぎに 見る人の 語り継ぎてて 聞く人の 鏡にせむを 惜しき 清きその名ぞ おぼろかに 心思ひて 空言も 祖の名絶つな 大伴の 氏と名に負へる 大夫の伴 </a></p>
<h2>（喩族歌一首[并短歌]）</h2>
<p><a href="4466.html">磯城島の大和の国に明らけき名に負ふ伴の男心つとめよ</a></p>
<h2>（喩族歌一首[并短歌]）</h2>
<p><a href="4467.html">剣太刀いよよ磨ぐべし古ゆさやけく負ひて来にしその名ぞ</a></p>
<h2>臥病悲無常欲修道作歌二首</h2>
<p><a href="4468.html">うつせみは数なき身なり山川のさやけき見つつ道を尋ねな</a></p>
<h2>（臥病悲無常欲修道作歌二首）</h2>
<p><a href="4469.html">渡る日の影に競ひて尋ねてな清きその道またもあはむため</a></p>
<h2>願壽作歌一首</h2>
<p><a href="4470.html">水泡なす仮れる身ぞとは知れれどもなほし願ひつ千年の命を</a></p>
<h2>冬十一月五日夜小雷起鳴雪落覆庭忽懐&lt;感&gt;憐聊作短歌一首</h2>
<p><a href="4471.html">消残りの雪にあへ照るあしひきの山橘をつとに摘み来な</a></p>
<h2>八日讃岐守安宿王等集於出雲掾安宿奈杼麻呂之家宴歌二首</h2>
<p><a href="4472.html">大君の命畏み於保の浦をそがひに見つつ都へ上る</a></p>
<h2>（八日讃岐守安宿王等集於出雲掾安宿奈杼麻呂之家宴歌二首）</h2>
<p><a href="4473.html">うちひさす都の人に告げまくは見し日のごとくありと告げこそ</a></p>
<h2></h2>
<p><a href="4474.html">群鳥の朝立ち去にし君が上はさやかに聞きつ思ひしごとく [一云 思ひしものを] </a></p>
<h2>廿三日集於式部少丞大伴宿祢池主之宅飲宴歌二首</h2>
<p><a href="4475.html">初雪は千重に降りしけ恋ひしくの多かる我れは見つつ偲はむ</a></p>
<h2>（廿三日集於式部少丞大伴宿祢池主之宅飲宴歌二首）</h2>
<p><a href="4476.html">奥山のしきみが花の名のごとやしくしく君に恋ひわたりなむ</a></p>
<h2>智努女王卒後圓方女王悲傷作歌一首</h2>
<p><a href="4477.html">夕霧に千鳥の鳴きし佐保路をば荒しやしてむ見るよしをなみ</a></p>
<h2>大原櫻井真人行佐保川邊之時作歌一首</h2>
<p><a href="4478.html">佐保川に凍りわたれる薄ら氷の薄き心を我が思はなくに</a></p>
<h2>藤原夫人歌一首  [浄御原宮御宇天皇之夫人也  字曰氷上大刀自也]</h2>
<p><a href="4479.html">朝夕に音のみし泣けば焼き太刀の利心も我れは思ひかねつも</a></p>
<h2></h2>
<p><a href="4480.html">畏きや天の御門を懸けつれば音のみし泣かゆ朝夕にして [作者未詳]</a></p>
<h2>三月四日於兵部大丞大原真人今城之宅宴歌一首</h2>
<p><a href="4481.html">あしひきの八つ峰の椿つらつらに見とも飽かめや植ゑてける君</a></p>
<h2></h2>
<p><a href="4482.html">堀江越え遠き里まで送り来る君が心は忘らゆましじ</a></p>
<h2>勝寶九歳六月廿三日於大監物三形王之宅宴歌一首</h2>
<p><a href="4483.html">移り行く時見るごとに心痛く昔の人し思ほゆるかも</a></p>
<h2></h2>
<p><a href="4484.html">咲く花は移ろふ時ありあしひきの山菅の根し長くはありけり</a></p>
<h2></h2>
<p><a href="4485.html">時の花いやめづらしもかくしこそ見し明らめめ秋立つごとに</a></p>
<h2>天平寶字元年十一月十八日於内裏肆宴歌二首</h2>
<p><a href="4486.html">天地を照らす日月の極みなくあるべきものを何をか思はむ</a></p>
<h2>（天平寶字元年十一月十八日於内裏肆宴歌二首）</h2>
<p><a href="4487.html">いざ子どもたはわざなせそ天地の堅めし国ぞ大和島根は</a></p>
<h2>十二月十八日於大監物三形王之宅宴歌三首</h2>
<p><a href="4488.html">み雪降る冬は今日のみ鴬の鳴かむ春へは明日にしあるらし</a></p>
<h2>（十二月十八日於大監物三形王之宅宴歌三首）</h2>
<p><a href="4489.html">うち靡く春を近みかぬばたまの今夜の月夜霞みたるらむ</a></p>
<h2>（十二月十八日於大監物三形王之宅宴歌三首）</h2>
<p><a href="4490.html">あらたまの年行き返り春立たばまづ我が宿に鴬は鳴け</a></p>
<h2></h2>
<p><a href="4491.html">大き海の水底深く思ひつつ裳引き平しし菅原の里</a></p>
<h2>廿三日於治部少輔大原今城真人之宅宴歌一首</h2>
<p><a href="4492.html">月数めばいまだ冬なりしかすがに霞たなびく春立ちぬとか</a></p>
<h2>二年正月三日召侍従竪子王臣等令侍於内裏之東屋垣下即賜玉箒肆宴  于時内相藤原朝臣奉勅宣  諸王卿等随堪任意作歌并賦詩  仍應詔旨各陳心緒作歌賦詩  [未得諸人之賦詩并作歌也]</h2>
<p><a href="4493.html">初春の初子の今日の玉箒手に取るからに揺らく玉の緒</a></p>
<h2></h2>
<p><a href="4494.html">水鳥の鴨の羽の色の青馬を今日見る人は限りなしといふ</a></p>
<h2>六日内庭假植樹木以作林帷而為肆宴歌</h2>
<p><a href="4495.html">うち靡く春ともしるく鴬は植木の木間を鳴き渡らなむ</a></p>
<h2>二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首</h2>
<p><a href="4496.html">恨めしく君はもあるか宿の梅の散り過ぐるまで見しめずありける</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4497.html">見むと言はば否と言はめや梅の花散り過ぐるまで君が来まさぬ</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4498.html">はしきよし今日の主人は礒松の常にいまさね今も見るごと</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4499.html">我が背子しかくし聞こさば天地の神を祈ひ祷み長くとぞ思ふ</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4500.html">梅の花香をかぐはしみ遠けども心もしのに君をしぞ思ふ</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4501.html">八千種の花は移ろふ常盤なる松のさ枝を我れは結ばな</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4502.html">梅の花咲き散る春の長き日を見れども飽かぬ礒にもあるかも</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4503.html">君が家の池の白波礒に寄せしばしば見とも飽かむ君かも</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4504.html">うるはしと我が思ふ君はいや日異に来ませ我が背子絶ゆる日なしに</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）</h2>
<p><a href="4505.html">礒の裏に常呼び来住む鴛鴦の惜しき我が身は君がまにまに</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）依興各思高圓離宮處作歌五首</h2>
<p><a href="4506.html">高圓の野の上の宮は荒れにけり立たしし君の御代遠そけば</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）（依興各思高圓離宮處作歌五首）</h2>
<p><a href="4507.html">高圓の峰の上の宮は荒れぬとも立たしし君の御名忘れめや</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）（依興各思高圓離宮處作歌五首）</h2>
<p><a href="4508.html">高圓の野辺延ふ葛の末つひに千代に忘れむ我が大君かも</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）（依興各思高圓離宮處作歌五首）</h2>
<p><a href="4509.html">延ふ葛の絶えず偲はむ大君の見しし野辺には標結ふべしも</a></p>
<h2>（二月於式部大輔中臣清麻呂朝臣之宅宴歌十&lt;五&gt;首）（依興各思高圓離宮處作歌五首）</h2>
<p><a href="4510.html">大君の継ぎて見すらし高圓の野辺見るごとに音のみし泣かゆ</a></p>
<h2>属目山齋作歌三首</h2>
<p><a href="4511.html">鴛鴦の住む君がこの山斎今日見れば馬酔木の花も咲きにけるかも</a></p>
<h2>（属目山齋作歌三首）</h2>
<p><a href="4512.html">池水に影さへ見えて咲きにほふ馬酔木の花を袖に扱入れな</a></p>
<h2>（属目山齋作歌三首）</h2>
<p><a href="4513.html">礒影の見ゆる池水照るまでに咲ける馬酔木の散らまく惜しも</a></p>
<h2>二月十日於内相宅餞渤海大使小野田守朝臣等宴歌一首</h2>
<p><a href="4514.html">青海原風波靡き行くさ来さつつむことなく船は速けむ</a></p>
<h2>七月五日於&lt;治&gt;部少輔大原今城真人宅餞因幡守大伴宿祢家持宴歌一首</h2>
<p><a href="4515.html">秋風の末吹き靡く萩の花ともにかざさず相か別れむ</a></p>
<h2>三年春正月一日於因幡國廳賜饗國郡司等之宴歌一首</h2>
<p><a href="4516.html">新しき年の初めの初春の今日降る雪のいやしけ吉事</a></p>

"""
FOOTER = """ <div class="register">
 <a href="register.cgi">&gt;&gt; 登録/設定変更（無料）</a>
 </div>

 </div>

 <div id="submenu">
   <ul>
     <li><a href="faq.html">よくあるご質問</a></li>
     <li><a href="contact.html">お問合せ</a></li>
   </ul>
 </div>

 <div id="footer">
   <p>
   本日の万葉集 Copyright &copy; 2011
   </p>
 <div id="footer_link">
   <ul>
     <li><a href="search.cgi">万葉集検索</a></li>
     <li><a href="all.html">万葉集全首</a></li>
     <li><a href="about.html">運営</a></li>
     <li><a href="privacy.html">個人情報保護方針</a></li>
   </ul>
 </div>
 </div>
 
</div>

<!-- ClickTale Top part -->
<script type="text/javascript">
var WRInitTime=(new Date()).getTime();
</script>
<!-- ClickTale end of Top part -->

<!-- ClickTale Bottom part -->
<div id="ClickTale" style="display: none;"></div>
<script src="http://s.clicktale.net/WRa.js" type="text/javascript"></script>
<script type="text/javascript">
if(typeof ClickTale=='function') ClickTale(12997,1);
</script>
<!-- ClickTale end of Bottom part -->
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-968446-2");
pageTracker._initData();
pageTracker._trackPageview();
</script>
 
</body>
</html>"""

from keyword import extract_keyword
import os

def get_keyword():
    'extract keyword'
    referrer = os.getenv( 'HTTP_REFERER', '' )
    keyword  = extract_keyword( referrer )
    return keyword.replace( '"', '' )

def render_html( keyword ):
    'render html'
    return HEADER % dict( keyword = keyword ) + FOOTER

def display_html( html ):
    'display html'
    print 'Content-Type: text/html\n'
    print html

def do_it():
    'do it'
    html = render_html( get_keyword() )
    display_html( html )

if '__main__' == __name__:
    do_it()
